
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>开篇：建立年薪50万的能力框架 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第1节：技术人职业发展路径.html" />
    
    
    <link rel="prev" href="概述.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >开篇：建立年薪50万的能力框架</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="java&#x80FD;&#x529B;&#x6846;&#x67B6;&#x53CA;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;">Java&#x80FD;&#x529B;&#x6846;&#x67B6;&#x53CA;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;</h2>
<p>&#x8861;&#x91CF;&#x6BCF;&#x4F4D;&#x5DE5;&#x7A0B;&#x5E08;&#x6C34;&#x5E73;&#x9AD8;&#x4F4E;&#x7684;&#x6807;&#x51C6;&#xFF0C;90%&#x6BD4;&#x62FC;&#x7684;&#x662F;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x662F;&#x8F6F;&#x5B9E;&#x529B;&#x3002;&#x5EFA;&#x7ACB;&#x5B8C;&#x6574;&#x7684;&#x77E5;&#x8BC6;&#x6846;&#x67B6;&#xFF0C;&#x4F1A;&#x5728;&#x804C;&#x573A;&#x4E2D;&#x8868;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4E0D;&#x518D;&#x8FF7;&#x832B;&#x3002;&#x5728;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x5206;&#x4E3A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3001;&#x5E94;&#x7528;&#x77E5;&#x8BC6;&#x3001;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x4E09;&#x5927;&#x6A21;&#x5757;&#x7684;&#x8003;&#x6838;&#x3002;</p>
<ul>
<li>&#x57FA;&#x7840;&#x6A21;&#x5757;&#x5305;&#x62EC;&#xFF1A;&#x5E38;&#x89C1;&#x6280;&#x672F;&#x5C97;&#x4E0E;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;JVM&#x539F;&#x7406;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7B49;</li>
<li>&#x5E94;&#x7528;&#x6A21;&#x5757;&#x5305;&#x62EC;&#xFF1A;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x96C6;&#x3001;&#x5E38;&#x7528;&#x6846;&#x67B6;&#x3001;&#x7F13;&#x5B58;&#x3001;&#x961F;&#x5217;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7B49;</li>
<li>&#x7EFC;&#x5408;&#x6A21;&#x5757;&#x5305;&#x62EC;&#xFF1A;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x3001;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3001;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x3001;&#x5BB9;&#x5668;&#x5316;&#x7B49;</li>
</ul>
<table>
<thead>
<tr>
<th style="text-align:center">&#x57FA;&#x7840;&#x6A21;&#x5757;</th>
<th style="text-align:center">&#x5E94;&#x7528;&#x6A21;&#x5757;</th>
<th style="text-align:center">&#x7EFC;&#x5408;&#x6A21;&#x5757;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x6280;&#x672F;&#x5C97;&#x4F4D;&#x4E0E;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;</td>
<td style="text-align:center">&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x96C6;</td>
<td style="text-align:center">&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</td>
</tr>
<tr>
<td style="text-align:center">&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;</td>
<td style="text-align:center">&#x5E38;&#x7528;&#x6846;&#x67B6;</td>
<td style="text-align:center">&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;</td>
</tr>
<tr>
<td style="text-align:center">JVM&#x539F;&#x7406;</td>
<td style="text-align:center">&#x7F13;&#x5B58;</td>
<td style="text-align:center">&#x5BB9;&#x5668;&#x5316;</td>
</tr>
<tr>
<td style="text-align:center">&#x591A;&#x7EBF;&#x7A0B;</td>
<td style="text-align:center">&#x961F;&#x5217;</td>
<td style="text-align:center"></td>
</tr>
<tr>
<td style="text-align:center">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</td>
<td style="text-align:center">&#x6570;&#x636E;&#x5E93;</td>
<td style="text-align:center"></td>
</tr>
<tr>
<td style="text-align:center">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;</td>
<td style="text-align:center"></td>
</tr>
</tbody>
</table>
<blockquote>
<p>&#x4E0D;&#x8BBA;&#x662F;&#x5E94;&#x5C4A;&#x751F;&#xFF0C;&#x521D;&#x4E2D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8FD8;&#x662F;&#x9AD8;&#x7EA7;/&#x8D44;&#x6DF1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#x4E5F;&#x5F88;&#x52E4;&#x594B;&#xFF0C;&#x5374;&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x65F6;&#x94E9;&#x7FBD;&#x800C;&#x5F52;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6362;&#x5DE5;&#x4F5C;&#x96BE;&#x7684;&#x539F;&#x56E0;&#x6709;&#x4E09;&#xFF1A;</p>
<ul>
<li><p>&#x4E0D;&#x77E5;&#x9053;&#x7B80;&#x5386;&#x8981;&#x5199;&#x4EC0;&#x4E48;</p>
<blockquote>
<p>&#x200B;    &#x7B80;&#x5386;&#x4E0D;&#x597D;&#x610F;&#x5473;&#x7740;&#x6CA1;&#x6709;&#x9762;&#x8BD5;&#x673A;&#x4F1A;&#x3002;&#x6280;&#x672F;&#x5019;&#x9009;&#x4EBA;&#x5927;&#x7EA6;&#x6709;80%&#x7684;&#x7B80;&#x5386;&#x901A;&#x4E0D;&#x8FC7;&#x521D;&#x7B5B;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x539F;&#x56E0;&#x6709;&#x56DB;&#x79CD;&#xFF1A;</p>
<ol>
<li><p>&#x5DE5;&#x4F5C;/&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x63CF;&#x8FF0;&#x5F97;&#x4E0D;&#x5230;&#x4F4D;</p>
</li>
<li><p>&#x4E0D;&#x61C2;&#x5F97;&#x5982;&#x4F55;&#x5305;&#x88C5;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x7279;&#x957F;</p>
</li>
<li><p>&#x5B66;&#x5386;&#x4E0D;&#x5360;&#x4F18;&#x52BF;&#xFF0C;&#x5374;&#x653E;&#x5728;&#x4E86;&#x6700;&#x663E;&#x773C;&#x7684;&#x4F4D;&#x7F6E;</p>
</li>
<li><p>&#x6392;&#x7248;&#x592A;&#x4E71;&#xFF0C;&#x5E9F;&#x8BDD;&#x592A;&#x591A;</p>
<p><strong>&#x9996;&#x5148;&#x770B;&#x770B;&#x7B80;&#x5386;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;</strong>&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x5F88;&#x591A;&#x5019;&#x9009;&#x4EBA;&#x5728;&#x6362;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6309;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;<strong>&#x6D77;&#x6295;</strong>&#xFF0C;&#x4ECE;&#x4E0D;&#x770B;&#x5C97;&#x4F4D;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x591A;&#x51C6;&#x5907;&#x51E0;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x8FD9;&#x79CD;&#x76F2;&#x76EE;&#x7684;&#x6295;&#x9012;&#x884C;&#x4E3A;&#x662F;&#x5BFC;&#x81F4;&#x5931;&#x8D25;&#x7684;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;&#x7B80;&#x5386;&#x4E2D;&#x7684;<strong>&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x3001;&#x5BF9;&#x53E3;&#x7ECF;&#x9A8C;&#x3001;&#x5B66;&#x5386;&#xFF0C;&#x751A;&#x81F3;&#x7B80;&#x5386;&#x7684;&#x7F8E;&#x89C2;&#x5EA6;&#x3001;&#x903B;&#x8F91;&#x662F;&#x5426;&#x6E05;&#x6670;</strong>&#xFF0C;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x9053;&#x574E;&#x3002; </p>
</li>
</ol>
</blockquote>
</li>
<li><p>&#x4E0D;&#x77E5;&#x9053;&#x9762;&#x8BD5;&#x5B98;&#x8981;&#x8003;&#x4EC0;&#x4E48;</p>
<blockquote>
<p>&#x200B;    &#x5F88;&#x591A;&#x4EBA;&#x63A5;&#x5230;&#x9762;&#x8BD5;&#x7535;&#x8BDD;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x7CCA;&#x91CC;&#x7CCA;&#x6D82;&#x5C31;&#x53BB;&#xFF0C;&#x8FD9;&#x79CD;&#x5931;&#x8D25;&#x7387;&#x6781;&#x9AD8;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x6E05;&#x695A;&#x4FA7;&#x91CD;&#x70B9;&#x3001;&#x5C97;&#x4F4D;&#x8981;&#x6C42;&#x3002;&#x4E0D;&#x540C;&#x884C;&#x4E1A;&#x9886;&#x57DF;&#x4E0E;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x5BF9;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x8981;&#x6C42;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8003;&#x5BDF;&#x70B9;&#x4E5F;&#x6709;&#x6240;&#x4FA7;&#x91CD;&#x3002;</p>
<p>&#x200B;    &#x6BD4;&#x5982;&#xFF0C;&#x4ECE;&#x884C;&#x4E1A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x793E;&#x4EA4;&#x95E8;&#x6237;&#x7C7B;&#x8003;&#x67E5;&#x7684;&#x662F;<strong>&#x5927;&#x89C4;&#x6A21;&#x9AD8;&#x5E76;&#x53D1;&#x573A;&#x666F;&#x7684;&#x5E94;&#x7528;&#x4E0E;&#x67B6;&#x6784;&#x80FD;&#x529B;</strong>&#xFF1B;O2O&#x884C;&#x4E1A;&#x4FA7;&#x91CD;&#x4E8E;<strong>&#x7EFC;&#x5408;&#x80FD;&#x529B;</strong>&#x7684;&#x8003;&#x5BDF;&#xFF1B;&#x800C;&#x4E92;&#x8054;&#x7F51;&#x91D1;&#x878D;&#x66F4;&#x559C;&#x6B22;&#x903B;&#x8F91;&#x7F1C;&#x5BC6;&#xFF0C;&#x5BF9;&#x9AD8;&#x53EF;&#x7528;&#x5B89;&#x5168;&#x9886;&#x57DF;&#x6709;&#x4E30;&#x5BCC;&#x7ECF;&#x9A8C;&#x7684;&#x5019;&#x9009;&#x4EBA;&#x3002;</p>
<p>&#x200B;    &#x800C;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#xFF0C;&#x6821;&#x62DB;&#x9762;&#x8BD5;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5BF9;<strong>&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x4E0E;&#x903B;&#x8F91;&#x601D;&#x7EF4;</strong>&#x65B9;&#x9762;&#x7684;&#x8003;&#x5BDF;&#xFF0C;&#x4EE5;&#x57F9;&#x517B;&#x6F5C;&#x529B;&#x7684;&#x8003;&#x5BDF;&#x4E3A;&#x4E3B;&#xFF1B;&#x521D;&#x4E2D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x5219;&#x9700;&#x8981;&#x591A;&#x5173;&#x6CE8;<strong>&#x77E5;&#x8BC6;&#x7684;&#x5E7F;&#x5EA6;&#x4E0E;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x5E94;&#x7528;</strong>&#xFF1B;&#x800C;&#x9AD8;&#x7EA7;&#x6216;&#x8005;&#x8D44;&#x6DF1;&#x5DE5;&#x7A0B;&#x5E08;&#x9700;&#x8981;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF0C;&#x80FD;&#x5BF9;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#xFF0C;&#x4EE5;&#x7EFC;&#x5408;&#x7684;&#x80FD;&#x529B;&#x8003;&#x67E5;&#x4E3A;&#x4E3B;&#x3002;</p>
<p>&#x200B;    &#x5176;&#x6B21;&#xFF0C;&#x6CA1;&#x6709;get&#x5230;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x8003;&#x67E5;&#x610F;&#x56FE;&#x3002;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x4F7F;&#x7528;&#x8FC7;&#x67D0;&#x67D0;&#x6846;&#x67B6;&#x5417;&#xFF1F;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x56DE;&#x7B54;&#x8BF4;&#x7528;&#x8FC7;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x51B7;&#x573A;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x60F3;&#x8003;&#x5BDF;<strong>&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x3001;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3001;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&#x3001;&#x6709;&#x4F55;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5176;&#x4ED6;&#x6846;&#x67B6;</strong>&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x56DE;&#x7B54;&#x201C;&#x662F;&#x201D;&#x6216;&#x8005;&#x201C;&#x5426;&#x201D;&#x7684;&#x8BDD;&#xFF0C;&#x663E;&#x7136;&#x6CA1;&#x6709;get&#x5230;&#x6211;&#x7684;&#x610F;&#x56FE;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x80FD;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x5019;&#x9009;&#x4EBA;&#x5728;<strong>&#x6C9F;&#x901A;&#x8868;&#x8FBE;</strong>&#x4E0A;&#x6709;&#x5F85;&#x63D0;&#x9AD8;&#xFF0C;&#x6050;&#x6015;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5C06;&#x6765;&#x7684;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x5EFA;&#x8BAE;&#x5728;&#x9762;&#x8BD5;&#x524D;&#x7B80;&#x5355;&#x5BF9;&#x516C;&#x53F8;<strong>&#x4E1A;&#x52A1;&#x5C97;&#x4F4D;&#x804C;&#x8D23;</strong>&#x505A;&#x4E00;&#x4E9B;&#x529F;&#x8BFE;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x624D;&#x80FD;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x664B;&#x7EA7;</p>
<blockquote>
<p>&#x200B;    &#x65B0;&#x6280;&#x672F;&#x7684;<strong>&#x5347;&#x7EA7;&#x6362;&#x4EE3;</strong>&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x6CA1;&#x8DDF;&#x4E0A;&#x5C31;&#x53EF;&#x80FD;&#x88AB;&#x6DD8;&#x6C70;&#x3002;<strong>&#x4E0D;&#x65AD;&#x5B66;&#x4E60;</strong>&#x662F;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x597D;&#x7684;&#x4E60;&#x60EF;&#xFF1A;&#x4E1C;&#x5B66;&#x4E00;&#x70B9;&#x897F;&#x5B66;&#x4E00;&#x70B9;&#x3002;&#x5F53;&#x65F6;&#x89C9;&#x5F97;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#xFF0C;&#x53D1;&#x73B0;&#x6211;&#x7684;&#x6280;&#x672F;&#x5E76;&#x6CA1;&#x6709;&#x56E0;&#x6B64;&#x800C;&#x63D0;&#x9AD8;&#x3002;&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4E0D;&#x6210;&#x4F53;&#x7CFB;&#x5F88;&#x5FEB;&#x5C31;&#x9057;&#x5FD8;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x548C;&#x73B0;&#x5B9E;&#x5DE5;&#x4F5C;&#x76F8;&#x5DEE;&#x592A;&#x8FDC;&#xFF0C;&#x65E0;&#x6CD5;&#x7075;&#x6D3B;&#x5730;&#x8FD0;&#x7528;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x5B9E;&#x9645;&#x6848;&#x4F8B;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x3002;</p>
<p>&#x200B;    &#x5B66;&#x4E60;&#x9996;&#x5148;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x5C31;&#x50CF;&#x4E66;&#x7684;<strong>&#x76EE;&#x5F55;</strong>&#x4E00;&#x6837;&#xFF0C;<strong>&#x5148;&#x6897;&#x6982;&#x540E;&#x7EC6;&#x8282;</strong>&#xFF0C;&#x5148;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;<strong>&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;</strong>&#x518D;&#x4E00;&#x5757;&#x4E00;&#x5757;&#x5730;&#x592F;&#x5B9E;&#x3002;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5168;&#x9762;&#x7684;&#x68B3;&#x7406;Java&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x5EFA;&#x7ACB;<strong>&#x601D;&#x7EF4;&#x6846;&#x67B6;</strong>&#x3002;</p>
</blockquote>
</li>
</ul>
</blockquote>
<p><img src="https://img.jinguo.tech/blog/image-20210506012953204.png?imageslim" alt="&#x9762;&#x8BD5;&#x5927;&#x7EB2;"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="概述.html" class="navigation navigation-prev " aria-label="Previous page: 32个Java面试必考点">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第1节：技术人职业发展路径.html" class="navigation navigation-next " aria-label="Next page: 第1节：技术人职业发展路径">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"开篇：建立年薪50万的能力框架","level":"1.3.1","depth":2,"next":{"title":"第1节：技术人职业发展路径","level":"1.3.2","depth":2,"path":"32个Java面试必考点/第1节：技术人职业发展路径.md","ref":"32个Java面试必考点/第1节：技术人职业发展路径.md","articles":[]},"previous":{"title":"32个Java面试必考点","level":"1.3","depth":1,"path":"32个Java面试必考点/概述.md","ref":"32个Java面试必考点/概述.md","articles":[{"title":"开篇：建立年薪50万的能力框架","level":"1.3.1","depth":2,"path":"32个Java面试必考点/开篇：建立年薪50万的能力框架.md","ref":"32个Java面试必考点/开篇：建立年薪50万的能力框架.md","articles":[]},{"title":"第1节：技术人职业发展路径","level":"1.3.2","depth":2,"path":"32个Java面试必考点/第1节：技术人职业发展路径.md","ref":"32个Java面试必考点/第1节：技术人职业发展路径.md","articles":[]},{"title":"第2节：操作系统与计算机网络","level":"1.3.3","depth":2,"path":"32个Java面试必考点/第2节：操作系统与计算机网络.md","ref":"32个Java面试必考点/第2节：操作系统与计算机网络.md","articles":[]},{"title":"第3节：Java语言特性与设计模式","level":"1.3.4","depth":2,"path":"32个Java面试必考点/第3节：Java语言特性与设计模式.md","ref":"32个Java面试必考点/第3节：Java语言特性与设计模式.md","articles":[]},{"title":"第4节：深入浅出JVM","level":"1.3.5","depth":2,"path":"32个Java面试必考点/第4节：深入浅出JVM.md","ref":"32个Java面试必考点/第4节：深入浅出JVM.md","articles":[]},{"title":"第5节：并发与多线程","level":"1.3.6","depth":2,"path":"32个Java面试必考点/第5节：并发与多线程.md","ref":"32个Java面试必考点/第5节：并发与多线程.md","articles":[]},{"title":"第6节：数据结构与算法","level":"1.3.7","depth":2,"path":"32个Java面试必考点/第6节：数据结构与算法.md","ref":"32个Java面试必考点/第6节：数据结构与算法.md","articles":[]},{"title":"第7节：常用工具集","level":"1.3.8","depth":2,"path":"32个Java面试必考点/第7节：常用工具集.md","ref":"32个Java面试必考点/第7节：常用工具集.md","articles":[]},{"title":"第8节：必会框架--Spring全家桶","level":"1.3.9","depth":2,"path":"32个Java面试必考点/第8节：必会框架--Spring全家桶.md","ref":"32个Java面试必考点/第8节：必会框架--Spring全家桶.md","articles":[]},{"title":"第9节：必会框架--RPC与ORM","level":"1.3.10","depth":2,"path":"32个Java面试必考点/第9节：必会框架--RPC与ORM.md","ref":"32个Java面试必考点/第9节：必会框架--RPC与ORM.md","articles":[]},{"title":"第10节：消息队列Kafka架构与原理","level":"1.3.11","depth":2,"path":"32个Java面试必考点/第10节：消息队列Kafka架构与原理.md","ref":"32个Java面试必考点/第10节：消息队列Kafka架构与原理.md","articles":[]},{"title":"第11节：MySQL调优与最佳实践","level":"1.3.12","depth":2,"path":"32个Java面试必考点/第11节：MySQL调优与最佳实践.md","ref":"32个Java面试必考点/第11节：MySQL调优与最佳实践.md","articles":[]},{"title":"第12节：架构的演进之路与前言技术","level":"1.3.13","depth":2,"path":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","ref":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","articles":[]},{"title":"彩蛋：技术人行走职场的建议","level":"1.3.14","depth":2,"path":"32个Java面试必考点/彩蛋：技术人行走职场的建议.md","ref":"32个Java面试必考点/彩蛋：技术人行走职场的建议.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/开篇：建立年薪50万的能力框架.md","mtime":"2021-05-06T14:34:33.807Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

