
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>彩蛋：技术人行走职场的建议 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="第12节：架构的演进之路与前言技术.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >彩蛋：技术人行走职场的建议</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6280;&#x672F;&#x4EBA;&#x884C;&#x8D70;&#x804C;&#x573A;&#x7684;&#x5EFA;&#x8BAE;">&#x6280;&#x672F;&#x4EBA;&#x884C;&#x8D70;&#x804C;&#x573A;&#x7684;&#x5EFA;&#x8BAE;</h2>
<p>&#x8FD9;&#x662F;&#x4E3A;&#x300A;32&#x4E2A;Java&#x9762;&#x8BD5;&#x5FC5;&#x8003;&#x70B9;&#x300B;&#x51C6;&#x5907;&#x7684;&#x5C0F;&#x5F69;&#x86CB;&#xFF0C;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x804C;&#x573A;&#x91CC;&#x5B9E;&#x7528;&#x7684;&#x5EFA;&#x8BAE;&#x548C;&#x6280;&#x5DE7;&#x3002;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x6D89;&#x53CA;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x4F55;&#x6253;&#x9020;&#x4E00;&#x4EFD;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x7B80;&#x5386;</li>
<li>&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x5E94;&#x8BE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;</li>
<li>&#x804C;&#x573A;&#x6210;&#x957F;&#x5EFA;&#x8BAE;</li>
<li>&#x4E00;&#x4E9B;&#x9AD8;&#x6548;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x5C0F; Tips</li>
</ol>
<h3 id="&#x5982;&#x4F55;&#x6253;&#x9020;&#x4E00;&#x4EFD;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x7B80;&#x5386;">&#x5982;&#x4F55;&#x6253;&#x9020;&#x4E00;&#x4EFD;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x7B80;&#x5386;</h3>
<p>&#x9996;&#x5148;&#x6765;&#x770B;&#x600E;&#x4E48;&#x5199;&#x7B80;&#x5386;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5019;&#x9009;&#x4EBA;&#x90FD;&#x662F;&#x5012;&#x5728;&#x4E86;&#x7B80;&#x5386;&#x7B5B;&#x9009;&#x8FD9;&#x4E00;&#x5173;&#x3002;HR &#x6216;&#x8005;&#x9762;&#x8BD5;&#x5B98;&#x4E00;&#x822C;&#x53EA;&#x4F1A;&#x5728;&#x7B80;&#x5386;&#x4E0A;&#x505C;&#x7559; 10&#xFF5E;30 &#x79D2;&#xFF0C;&#x5982;&#x679C;&#x7B80;&#x5386;&#x4E0D;&#x5438;&#x5F15;&#x4EBA;&#xFF0C;&#x518D;&#x4F18;&#x79C0;&#x7684;&#x5019;&#x9009;&#x4EBA;&#x4E5F;&#x4F1A;&#x9519;&#x5931;&#x826F;&#x673A;&#x3002;</p>
<h4 id="&#x597D;&#x7B80;&#x5386;&#x7684;&#x7279;&#x70B9;"><strong>&#x597D;&#x7B80;&#x5386;&#x7684;&#x7279;&#x70B9;</strong></h4>
<ul>
<li>&#x7ED3;&#x6784;&#x6E05;&#x6670;&#x3001;&#x4E3B;&#x6B21;&#x5206;&#x660E;&#x3002;</li>
</ul>
<p>&#x7B80;&#x5386;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x3001;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x3001;&#x81EA;&#x6211;&#x603B;&#x7ED3;&#x7B49;&#x90E8;&#x5206;&#xFF0C;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x8981;&#x505A;&#x5230;&#x4E3B;&#x6B21;&#x5206;&#x660E;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#xFF0C;&#x5EFA;&#x8BAE;&#x6309;&#x7167;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x5012;&#x5E8F;&#x6765;&#x6392;&#x5217;&#xFF0C;&#x6700;&#x65B0;&#x7684;&#x9879;&#x76EE;&#x653E;&#x5728;&#x6700;&#x524D;&#x3002;</p>
<p>&#x591A;&#x4E2A;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x4E5F;&#x8981;&#x5206;&#x4E3B;&#x6B21;&#x3002;&#x91CD;&#x70B9;&#x7684;&#x9879;&#x76EE;&#x3001;&#x6700;&#x80FD;&#x4F53;&#x73B0;&#x4F60;&#x80FD;&#x529B;&#x548C;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8981;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF0C;&#x6B21;&#x8981;&#x7684;&#x9879;&#x76EE;&#x5C3D;&#x91CF;&#x7B80;&#x6D01;&#xFF0C;&#x540C;&#x4E00;&#x7C7B;&#x578B;&#x7684;&#x9879;&#x76EE;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x3002;&#x5173;&#x4E8E;&#x9879;&#x76EE;&#x600E;&#x4E48;&#x4ECB;&#x7ECD;&#x5DF2;&#x7ECF;&#x5728;&#x524D;&#x9762;&#x7B2C; 10 &#x8BFE;&#x4E2D;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x9762;&#x8BD5;&#x8FD8;&#x662F;&#x7B80;&#x5386;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; STAR &#x6CD5;&#x5219;&#xFF0C;&#x5728;&#x7B80;&#x5386;&#x4E2D; STAR &#x6CD5;&#x5219;&#x7684;&#x5404;&#x4E2A;&#x8981;&#x7D20;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7CBE;&#x7EC3;&#x3002;</p>
<ul>
<li>&#x8BED;&#x53E5;&#x901A;&#x987A;&#xFF0C;&#x6CA1;&#x6709;&#x9519;&#x522B;&#x5B57;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E00;&#x4E9B;&#x82F1;&#x6587;&#x540D;&#x79F0;&#x7684;&#x62FC;&#x5199;&#x3002;</li>
</ul>
<p>&#x8BED;&#x53E5;&#x4E0D;&#x901A;&#x6216;&#x8005;&#x592A;&#x8FC7;&#x4E8E;&#x53E3;&#x8BED;&#x5316;&#xFF0C;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F60;&#x7684;&#x903B;&#x8F91;&#x548C;&#x8868;&#x8FBE;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#x4E0D;&#x592A;&#x597D;&#x3002;&#x800C;&#x9519;&#x522B;&#x5B57;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F60;&#x505A;&#x4E8B;&#x4E0D;&#x7EC6;&#x5FC3;&#x4E0D;&#x4E13;&#x4E1A;&#xFF0C;&#x4E0D;&#x91CD;&#x89C6;&#x9762;&#x8BD5;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x8BF4;&#x4E0D;&#x5B9A; Bug &#x9891;&#x51FA;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6280;&#x672F;&#x5DE5;&#x4F5C;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x68C0;&#x67E5;&#x62FC;&#x5199;&#x548C;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x8981;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x89C9;&#x5F97;&#x4F60;&#x662F;&#x4E2A;&#x4E25;&#x8C28;&#x7684;&#x4EBA;&#x3002;</p>
<ul>
<li>Less is more&#xFF0C;&#x5C11;&#x5373;&#x662F;&#x591A;&#x3002;</li>
</ul>
<p>&#x7B80;&#x5386;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x8D85;&#x8FC7; 2 &#x9875;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x60F3;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x9A6C;&#x4E0A;&#x5C31;&#x4F1A;&#x88AB; Pass&#x3002;&#x7B80;&#x5386;&#x4E00;&#x5B9A;&#x90FD;&#x662F;&#x4F53;&#x73B0;&#x4F60;&#x80FD;&#x529B;&#x7684;&#x5173;&#x952E;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#x7684;&#x4FE1;&#x606F;&#x4E00;&#x5F8B;&#x90FD;&#x8981;&#x5220;&#x9664;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6559;&#x80B2;&#x80CC;&#x666F;&#x53EA;&#x4FDD;&#x7559;&#x9AD8;&#x7B49;&#x6559;&#x80B2;&#x9636;&#x6BB5;&#x5373;&#x53EF;&#xFF0C;&#x9AD8;&#x4E2D;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x662F;&#x793E;&#x62DB;&#xFF0C;&#x5927;&#x5B66;&#x91CC;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x8BC1;&#x4E66;&#x5C31;&#x4E0D;&#x7528;&#x4F53;&#x73B0;&#x7B49;&#x3002;</p>
<ul>
<li>&#x6240;&#x6709;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x91CF;&#x5316;&#x7684;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x70B9;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4F1A;&#x5FFD;&#x89C6;&#x7684;&#x5730;&#x65B9;&#x3002;&#x7B80;&#x5386;&#x91CC;&#x4E0D;&#x80FD;&#x53EA;&#x8BF4;&#x201C;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x8981;&#x8BF4;&#x201C;&#x505A;&#x6210;&#x4E86;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x53EF;&#x91CF;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x66F4;&#x52A0;&#x771F;&#x5B9E;&#x53EF;&#x4FE1;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x8BBE;&#x8BA1;&#x7684;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5728;&#x7EBF;&#x4E0A;&#x652F;&#x6301;&#x4E86; 20W &#x7684; QPS&#xFF1B;&#x6BD4;&#x5982;&#x5B8C;&#x6210;&#x4E86; 15 &#x4E2A;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x5F00;&#x53D1;&#xFF0C;&#x6BD4;&#x5982;&#x4F18;&#x5316;&#x540E;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x63D0;&#x5347;&#x4E86; 70% &#x7B49;&#x7B49;&#x3002;&#x6700;&#x597D;&#x7528;&#x6570;&#x5B57;&#x6765;&#x4F53;&#x73B0;&#x3002;</p>
<ul>
<li>&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#x90E8;&#x5206;&#x8981;&#x66F4;&#x52A0;&#x52A1;&#x5B9E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7A7A;&#x6D1E;&#x7684;&#x63CF;&#x8FF0;&#x3002;</li>
</ul>
<p>&#x50CF;&#x201D;&#x6027;&#x683C;&#x5F00;&#x6717;&#x3001;&#x8D23;&#x4EFB;&#x5FC3;&#x5F3A;&#x3001;&#x5584;&#x4E8E;&#x7EC4;&#x7EC7;&#x3001;&#x534F;&#x8C03;&#x548C;&#x6C9F;&#x901A;&#xFF0C;&#x80FD;&#x826F;&#x597D;&#x5730;&#x4E0E;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x201C;&#x8FD9;&#x867D;&#x7136;&#x770B;&#x4E0A;&#x53BB;&#x633A;&#x50CF;&#x90A3;&#x4E48;&#x56DE;&#x4E8B;&#x513F;&#xFF0C;&#x4F46;&#x6BD4;&#x8F83;&#x7A7A;&#x6D1E;&#xFF0C;&#x5343;&#x7BC7;&#x4E00;&#x5F8B;&#x6CA1;&#x6709;&#x7279;&#x70B9;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5173;&#x952E;&#x8BCD;+&#x8BF4;&#x660E;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5206;&#x6761;&#x6765;&#x5199;&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#x8BF4;&#xFF1A;&#x201C;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#xFF1A;&#x4E3B;&#x5BFC;&#x8FC7;&#x6388;&#x6743;&#x8BA4;&#x8BC1;&#x3001;&#x652F;&#x4ED8;&#x3001;&#x89C6;&#x9891;&#x3001;&#x8D26;&#x6237;&#x7B49;&#x9879;&#x76EE;&#x843D;&#x5730;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x548C;&#x5B9E;&#x73B0;&#x6709;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x201D;&#x3002;</p>
<h4 id="&#x5199;&#x7B80;&#x5386;&#x7684;&#x6280;&#x5DE7;"><strong>&#x5199;&#x7B80;&#x5386;&#x7684;&#x6280;&#x5DE7;</strong></h4>
<p>&#x77E5;&#x9053;&#x4E86;&#x597D;&#x7B80;&#x5386;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x8FDB;&#x4E00;&#x6B65;&#x6253;&#x78E8;&#x7B80;&#x5386;&#x3002;</p>
<ol>
<li>&#x4E86;&#x89E3;&#x5DE5;&#x4F5C;&#x5C97;&#x4F4D;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x9488;&#x5BF9;&#x5C97;&#x4F4D;&#x6765;&#x8C03;&#x6574;&#x7B80;&#x5386;&#x3002;</li>
</ol>
<p>&#x597D;&#x7684;&#x7B80;&#x5386;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x8981;&#x6839;&#x636E;&#x5E94;&#x8058;&#x7684;&#x516C;&#x53F8;&#x548C;&#x5C97;&#x4F4D;&#x505A;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x63D0;&#x9AD8;&#x5339;&#x914D;&#x5EA6;&#x3002;&#x6709;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#x8981;&#x7A81;&#x51FA;&#x4F60;&#x975E;&#x5E38;&#x5408;&#x9002;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#xFF0C;&#x7B80;&#x5386;&#x4E2D;&#x8981;&#x5F3A;&#x8C03;&#x4F60;&#x7684;&#x4F18;&#x52BF;&#x3001;&#x6280;&#x80FD;&#x3001;&#x7279;&#x957F;&#xFF0C;&#x6B63;&#x597D;&#x662F;&#x62DB;&#x8058;&#x804C;&#x4F4D;&#x6240;&#x9700;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x6781;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x6210;&#x529F;&#x7387;&#x3002;</p>
<ol>
<li>&#x8981;&#x60F3;&#x5728;&#x6D77;&#x91CF;&#x7B80;&#x5386;&#x4E2D;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x5851;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5F15;&#x8D77;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x5174;&#x8DA3;&#x3002;</li>
</ol>
<p>&#x5148;&#x5BA1;&#x89C6;&#x81EA;&#x5DF1;&#xFF0C;&#x5BFB;&#x627E;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x70B9;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53C2;&#x4E0E;&#x8FC7;&#x975E;&#x5E38;&#x591A;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x90A3;&#x4E48;&#x5B9E;&#x6218;&#x7ECF;&#x9A8C;&#x7EDD;&#x5BF9;&#x662F;&#x4F60;&#x7684;&#x52A0;&#x5206;&#x9879;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x90A3;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x903B;&#x8F91;&#x6E05;&#x6670;&#x3001;&#x601D;&#x7EF4;&#x975E;&#x5E38;&#x654F;&#x6377;&#xFF1F;&#x6216;&#x8005;&#x4F60;&#x7684;&#x81EA;&#x6211;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x975E;&#x5E38;&#x5F3A;&#xFF0C;&#x9605;&#x8BFB;&#x8FC7;&#x5F88;&#x591A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x7684;&#x4EE3;&#x7801;&#xFF1F;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53C2;&#x4E0E;&#x8FC7; GitHub &#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6216;&#x8005;&#x7ECF;&#x5E38;&#x64B0;&#x5199;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x7B80;&#x5386;&#x4E2D;&#x4F53;&#x73B0;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x975E;&#x5E38;&#x5173;&#x6CE8;&#x7684;&#x70B9;&#x3002;</p>
<p>&#x4F46;&#x5207;&#x8BB0;&#xFF0C;&#x4F60;&#x7B80;&#x5386;&#x4E2D;&#x7A81;&#x51FA;&#x7684;&#x70B9;&#xFF0C;&#x4E5F;&#x4F1A;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x91CD;&#x70B9;&#x8003;&#x5BDF;&#x7684;&#x70B9;&#xFF0C;&#x8981;&#x80FD;&#x628A;&#x63E1;&#x4F4F;&#xFF0C;&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x5751;&#x3002;</p>
<ol>
<li><p>&#x53EF;&#x4EE5;&#x6362;&#x4E00;&#x4E2A;&#x89C6;&#x89D2;&#xFF0C;&#x627E;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x670B;&#x53CB;&#x6765;&#x5E2E;&#x5FD9; Review &#x4F60;&#x7684;&#x7B80;&#x5386;&#xFF0C;&#x542C;&#x542C;&#x54EA;&#x91CC;&#x4E0D;&#x8DB3;&#x6216;&#x4FEE;&#x6539;&#x5EFA;&#x8BAE;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x53C2;&#x4E0E;&#x8FC7;&#x6BD4;&#x8F83;&#x91CD;&#x5927;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6216;&#x8005;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x51FA;&#x5F69;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x770B;&#x770B;&#x8D1F;&#x8D23;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x3001;&#x4E0B;&#x6E38;&#x662F;&#x5426;&#x6709;&#x6BD4;&#x8F83;&#x6709;&#x7279;&#x8272;&#x670D;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x719F;&#x6089;&#x7684;&#x5176;&#x4ED6;&#x5C0F;&#x7EC4;&#x662F;&#x5426;&#x6709;&#x91CD;&#x70B9;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
</li>
</ol>
<p>&#x6B63;&#x6240;&#x8C13;&#x4ED6;&#x5C71;&#x4E4B;&#x77F3;&#x53EF;&#x4EE5;&#x653B;&#x7389;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5411;&#x540C;&#x4E8B;&#x8BF7;&#x6559;&#x5B66;&#x4E60;&#xFF0C;&#x4E86;&#x89E3;&#x90A3;&#x4E9B;&#x9879;&#x76EE;&#x7684;&#x67B6;&#x6784;&#x3001;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x3001;&#x601D;&#x8003;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x9F13;&#x52B1;&#x4F60;&#x53BB;&#x9020;&#x5047;&#xFF0C;&#x800C;&#x662F;&#x80FD;&#x591F;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x70ED;&#x60C5;&#x548C;&#x597D;&#x5B66;&#x3002;</p>
<p>&#x4F46;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x771F;&#x6B63;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x3002;</p>
<ol>
<li>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x5B58;&#x5728;&#x786C;&#x4F24;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x53E6;&#x8F9F;&#x8E4A;&#x5F84;&#x3002;</li>
</ol>
<p>&#x6BD4;&#x5982;&#x4F60;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#xFF0C;&#x6280;&#x672F;&#x80FD;&#x529B;&#x9AD8;&#x8D85;&#xFF0C;&#x4F46;&#x662F;&#x5B66;&#x5386;&#x4E0D;&#x9AD8;&#xFF0C;&#x8FD9;&#x6837;&#x7B80;&#x5386;&#x5F88;&#x53EF;&#x80FD;&#x901A;&#x4E0D;&#x8FC7;&#x521D;&#x7B5B;&#xFF0C;&#x8FDE;&#x9762;&#x8BD5;&#x673A;&#x4F1A;&#x90FD;&#x96BE;&#x4EE5;&#x83B7;&#x5F97;&#x3002;&#x8FD9;&#x65F6;&#x627E;&#x670B;&#x53CB;&#x5185;&#x63A8;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x6295;&#x9012;&#x7B80;&#x5386;&#x7ED9;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x662F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x591A;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x7FA4;&#xFF0C;&#x5C31;&#x6709;&#x673A;&#x4F1A;&#x8054;&#x7CFB;&#x5230;&#x76EE;&#x6807;&#x516C;&#x53F8;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5E2E;&#x5FD9;&#x5185;&#x63A8;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8981;&#x6CE8;&#x610F;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5BF9;&#x6280;&#x672F;&#x80FD;&#x529B;&#x6BD4;&#x8F83;&#x6CE8;&#x91CD;&#xFF0C;&#x6280;&#x672F;&#x80FD;&#x529B;&#x4E00;&#x822C;&#x7684;&#x8BDD;&#x4ECE;&#x8FD9;&#x6761;&#x8DEF;&#x4E0A;&#x5F88;&#x96BE;&#x8D70;&#x901A;&#x3002;&#x53D8;&#x5F3A;&#x6CA1;&#x6709;&#x6377;&#x5F84;&#x3002;</p>
<hr>
<h3 id="&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x5E94;&#x8BE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;">&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x5E94;&#x8BE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;</h3>
<p>&#x524D;&#x9762;&#x8BB2;&#x4E86;&#x5F88;&#x591A;&#x9762;&#x8BD5;&#x524D;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x4E5F;&#x4E0D;&#x8981;&#x5FFD;&#x7565;&#x4E86;&#x9762;&#x8BD5;&#x540E;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x51E0;&#x70B9;&#x5EFA;&#x8BAE;&#x3002;</p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x4E00;&#x822C;&#x9762;&#x8BD5;&#x5B98;&#x90FD;&#x4F1A;&#x8BE2;&#x95EE;&#x5019;&#x9009;&#x4EBA;&#x6709;&#x6CA1;&#x6709;&#x54EA;&#x4E9B;&#x60F3;&#x77E5;&#x9053;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E2A;&#x8868;&#x73B0;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x95EE;&#x3002;</p>
</li>
<li><p>&#x4F60;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x51C6;&#x5907; 1&#xFF5E;2 &#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5BF9;&#x9762;&#x8BD5;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x8865;&#x5145;&#x548C;&#x5EF6;&#x4F38;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
</li>
<li><p>&#x201C;&#x521A;&#x624D;&#x9762;&#x8BD5;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x53EF;&#x4EE5;&#x5982;&#x4F55;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#xFF0C;&#x60A8;&#x770B;&#x662F;&#x5426;&#x53EF;&#x884C;&#xFF0C;&#x80FD;&#x5426;&#x7ED9;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF1F;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x5174;&#x8DA3;&#x548C;&#x6267;&#x7740;&#xFF1B;</p>
</li>
<li><p>&#x5BF9;&#x9762;&#x8BD5;&#x516C;&#x53F8;&#x7684;&#x6280;&#x672F;&#x6216;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x8BE2;&#x95EE;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x6211;&#x542C;&#x8BF4;&#x60A8;&#x7684;&#x516C;&#x53F8;&#x5BF9; xxx &#x6846;&#x67B6;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x9020;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x4E3B;&#x8981;&#x662F;&#x60F3;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x95EE;&#x9898;&#x201D;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x5BF9;&#x4E1A;&#x754C;&#x6280;&#x672F;&#x8D8B;&#x52BF;&#x7684;&#x4E86;&#x89E3;&#xFF1B;</p>
</li>
<li><p>&#x83B7;&#x53D6;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF0C;&#x201C;&#x60A8;&#x770B;&#x6211;&#x8FD9;&#x6B21;&#x9762;&#x8BD5;&#x4E2D;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x201D;&#xFF1B;</p>
</li>
<li><p>&#x8BE2;&#x95EE;&#x4E00;&#x4E0B;&#x9762;&#x8BD5;&#x7684;&#x5C97;&#x4F4D;&#x804C;&#x8D23;&#xFF0C;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x54EA;&#x4E9B;&#x4E1A;&#x52A1;&#x7EBF;&#x548C;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x4F55;&#x79CD;&#x6280;&#x672F;&#x6808;&#x7B49;&#x7B49;&#x3002;</p>
</li>
</ol>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x662F;HR&#x9762;&#x8BD5;&#xFF0C;&#x53EF;&#x4EE5;&#x8BE2;&#x95EE;&#x4E00;&#x4E0B;&#x5173;&#x4E8E;&#x5C97;&#x4F4D;&#x7684;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x548C;&#x804C;&#x4E1A;&#x664B;&#x5347;&#x9014;&#x5F84;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x8868;&#x73B0;&#x51FA;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x610F;&#x8BC6;&#x548C;&#x4E0A;&#x8FDB;&#x5FC3;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x9A6C;&#x4E0A;&#x8BE2;&#x95EE;&#x9762;&#x8BD5;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x662F;&#x7F3A;&#x4E4F;&#x8010;&#x5FC3;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x73B0;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x56DE;&#x5BB6;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x9762;&#x8BD5;&#x590D;&#x76D8;&#x4E0E;&#x603B;&#x7ED3;&#x3002;</li>
</ol>
<p>&#x6BCF;&#x6B21;&#x9762;&#x8BD5;&#x4E0D;&#x8BBA;&#x6210;&#x529F;&#x4E0E;&#x5426;&#x90FD;&#x975E;&#x5E38;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x9762;&#x8BD5;&#x7ED3;&#x675F;&#x540E;&#x90FD;&#x8981;&#x5BF9;&#x9762;&#x8BD5;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#x3002;&#x56DE;&#x7B54;&#x4E0D;&#x4E0A;&#x6765;&#x7684;&#x95EE;&#x9898;&#x8981;&#x53CA;&#x65F6;&#x67E5;&#x9605;&#x8D44;&#x6599;&#x6216;&#x6E90;&#x7801;&#x641E;&#x660E;&#x767D;&#xFF0C;&#x8865;&#x5145;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x77ED;&#x677F;&#x3002;&#x4EE5;&#x53CA;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x54EA;&#x4E9B;&#x884C;&#x4E3A;&#x89E6;&#x53D1;&#x4E86;&#x9762;&#x8BD5;&#x5B98;&#x4E0D;&#x6EE1;&#xFF0C;&#x5728;&#x4E0B;&#x6B21;&#x9762;&#x8BD5;&#x65F6;&#x53EF;&#x4EE5;&#x626C;&#x957F;&#x907F;&#x77ED;&#x3002;</p>
<hr>
<h3 id="&#x804C;&#x573A;&#x6210;&#x957F;&#x5EFA;&#x8BAE;">&#x804C;&#x573A;&#x6210;&#x957F;&#x5EFA;&#x8BAE;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x901A;&#x8FC7;&#x52AA;&#x529B;&#x6210;&#x529F;&#x8FDB;&#x5165;&#x5230;&#x4E86;&#x5FC3;&#x4EEA;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x61C8;&#x6020;&#x653E;&#x677E;&#xFF0C;&#x804C;&#x573A;&#x6210;&#x957F;&#x548C;&#x65B0;&#x6280;&#x672F;&#x5B66;&#x4E60;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8FDB;&#x5219;&#x9000;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x804C;&#x573A;&#x4E2D;&#x8BE5;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x5C31;&#x662F;&#x8981;&#x660E;&#x786E;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x3002; </p>
<p>&#x4F60;&#x8981;&#x4E3B;&#x52A8;&#x4ECE;&#x4E1A;&#x52A1;&#x89D2;&#x5EA6;&#x3001;&#x4EA7;&#x54C1;&#x89D2;&#x5EA6;&#x6765;&#x601D;&#x8003;&#x95EE;&#x9898;&#xFF0C;&#x601D;&#x8003;&#x5982;&#x4F55;&#x80FD;&#x5728;&#x4E1A;&#x52A1;&#x89D2;&#x5EA6;&#x66F4;&#x597D;&#x7684;&#x4E3A;&#x516C;&#x53F8;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x901A;&#x8FC7;&#x4F18;&#x5316;&#x4E1A;&#x52A1;&#x7684;&#x4EA4;&#x4E92;&#x548C;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x4E3A;&#x516C;&#x53F8;&#x8282;&#x7EA6; 30% &#x670D;&#x52A1;&#x5668;&#x6210;&#x672C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x6301;&#x7EED;&#x601D;&#x8003;&#x8981;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x65B0;&#x6D41;&#x7A0B;&#x4E0B;&#x7684;&#x6280;&#x672F;&#x96BE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x65B9;&#x5411;&#x65F6;&#xFF0C;&#x8981;&#x8861;&#x91CF;&#x53EF;&#x884C;&#x6027;&#x3001;&#x96BE;&#x5EA6;&#x4E0E;&#x6536;&#x76CA;&#xFF0C;&#x4F18;&#x5148;&#x7A81;&#x7834;&#x6700;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x65B9;&#x5411;&#x3002;&#x6BD4;&#x5982;&#x964D;&#x4F4E;&#x8FD0;&#x884C;&#x6210;&#x672C;&#x548C;&#x63D0;&#x9AD8;&#x7814;&#x53D1;&#x6548;&#x7387;&#x6765;&#x6BD4;&#x8F83;&#xFF0C;&#x53EF;&#x4EE5;&#x4F18;&#x5148;&#x4EE5;&#x964D;&#x4F4E;&#x6210;&#x672C;&#x4E3A;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x65B9;&#x5411;&#x4EE5;&#x540E;&#xFF0C;&#x8981;&#x628A;&#x65B9;&#x5411;&#x8F6C;&#x5316;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x89C4;&#x5B9A;&#x65F6;&#x95F4;&#x548C;&#x9636;&#x6BB5;&#xFF0C;&#x6309;&#x8BA1;&#x5212;&#x5206;&#x6B65;&#x5B8C;&#x6210;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BA1;&#x5212;&#x4F1A;&#x4E0E;&#x672C;&#x804C;&#x5DE5;&#x4F5C;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#xFF0C;&#x8981;&#x534F;&#x8C03;&#x597D;&#x65F6;&#x95F4;&#x548C;&#x6548;&#x7387;&#xFF0C;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x79CD;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x65B9;&#x5411;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4E0D;&#x8981;&#x6025;&#x8E81;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x4E3A;&#x5B66;&#x4E60;&#x67D0;&#x4E2A;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x4E2D;&#x5FC5;&#x987B;&#x8981;&#x638C;&#x63E1;&#x7684;&#x65B0;&#x6280;&#x672F;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7ED9;&#x4E0D;&#x540C;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF1A;</p>
<ul>
<li><p>&#x5DE5;&#x4F5C; 1&#xFF5E;2 &#x5E74;&#xFF0C;&#x4EE5;&#x5B66;&#x4E60;&#x77E5;&#x8BC6;&#x4E3A;&#x4E3B;&#xFF0C;&#x5148;&#x6253;&#x597D;&#x57FA;&#x7840;&#xFF0C;&#x6CE8;&#x610F;&#x77E5;&#x8BC6;&#x5E7F;&#x5EA6;&#x7684;&#x57F9;&#x517B;&#xFF0C;&#x4FDD;&#x6301;&#x5BF9;&#x65B0;&#x6280;&#x672F;&#x7684;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x4E0D;&#x5FC3;&#x6D6E;&#x6C14;&#x8E81;&#xFF1B;</p>
</li>
<li><p>&#x5DE5;&#x4F5C; 3 &#x5E74;&#x4EE5;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x4E00;&#x4E9B;&#x4E3B;&#x52A8;&#x601D;&#x8003;&#xFF0C;&#x57F9;&#x517B;&#x81EA;&#x6211;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#xFF0C;&#x8981;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x63D0;&#x5347;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x3001;&#x8DE8;&#x56E2;&#x961F;&#x6C9F;&#x901A;&#x3001;&#x9879;&#x76EE;&#x8BBE;&#x8BA1;&#x7B49;&#x80FD;&#x529B;&#xFF1B;</p>
</li>
<li><p>&#x5DE5;&#x4F5C; 5 &#x5E74;&#x4EE5;&#x4E0A;&#xFF0C;&#x8981;&#x91CD;&#x70B9;&#x6811;&#x7ACB;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x54C1;&#x724C;&#x3002;&#x8981;&#x7ECF;&#x5E38;&#x601D;&#x8003;&#x4E1A;&#x52A1;&#x6216;&#x9879;&#x76EE;&#x4E2D;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#xFF0C;&#x89E3;&#x51B3;&#x540E;&#x7684;&#x6536;&#x76CA;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x8981;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x52A0;&#x5F3A;&#x3002;</p>
</li>
</ul>
<p>&#x200B;    &#x7136;&#x540E;&#xFF0C;&#x8981;&#x52AA;&#x529B;&#x6253;&#x9020;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x54C1;&#x724C;&#x548C;&#x6280;&#x672F;&#x53E3;&#x7891;&#xFF0C;&#x79EF;&#x7D2F;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x8D23;&#x4EFB;&#x5FC3;&#xFF0C;&#x53EA;&#x8981;&#x4EA4;&#x4EE3;&#x7ED9;&#x4F60;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x5B9A;&#x4F1A;&#x8A00;&#x51FA;&#x5FC5;&#x884C;&#xFF0C;&#x8D1F;&#x8D23;&#x5230;&#x5E95;&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x7ECF;&#x5E38;&#x534F;&#x52A9;&#x540C;&#x4E8B;&#x6392;&#x67E5;&#x89E3;&#x51B3;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x7ECF;&#x5E38;&#x505A;&#x4E00;&#x4E9B;&#x6709;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#x7684;&#x5206;&#x4EAB;&#x6216;&#x6280;&#x672F;&#x95EE;&#x9898;&#x6392;&#x67E5;&#x6848;&#x4F8B;&#x5206;&#x4EAB;&#x7B49;&#x7B49;&#x3002; </p>
<p>&#x4E0D;&#x8981;&#x7B80;&#x5355;&#x8BA4;&#x4E3A;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x6211;&#x5C31;&#x518D;&#x627E;&#x53E6;&#x4E00;&#x4E2A;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x90A3;&#x4E48;&#x8F9B;&#x82E6;&#x6253;&#x9020;&#x4EC0;&#x4E48;&#x6280;&#x672F;&#x54C1;&#x724C;&#x3002;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x4F60;&#x540E;&#x7EED;&#x7684;&#x804C;&#x573A;&#x4EBA;&#x8109;&#x90FD;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4F60;&#x7684;&#x6280;&#x672F;&#x54C1;&#x724C;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x7EF4;&#x6301;&#x597D;&#x7684;&#x6280;&#x672F;&#x54C1;&#x724C;&#x4F1A;&#x5BF9;&#x4F60;&#x804C;&#x4E1A;&#x4E2D;&#x540E;&#x671F;&#x53D1;&#x5C55;&#x5927;&#x6709;&#x88E8;&#x76CA;&#x3002; </p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8981;&#x7ECF;&#x5E38;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#x4E0E;&#x81EA;&#x6211;&#x53CD;&#x601D;&#x3002;&#x771F;&#x6B63;&#x7684;&#x6210;&#x957F;&#x90FD;&#x662F;&#x5728;&#x603B;&#x7ED3;&#x4E0E;&#x53CD;&#x601D;&#x4E4B;&#x540E;&#x83B7;&#x5F97;&#x7684;&#x3002;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;&#x6216;&#x9636;&#x6BB5;&#x6027;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x90FD;&#x8981;&#x53CA;&#x65F6;&#x603B;&#x7ED3;&#xFF0C;&#x65E2;&#x6709;&#x52A9;&#x4E8E;&#x53D1;&#x73B0;&#x6539;&#x8FDB;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x6709;&#x5229;&#x4E8E;&#x540E;&#x7EED;&#x51C6;&#x5907;&#x664B;&#x5347;&#x7D20;&#x6750;&#x3002; </p>
<p>&#x53EF;&#x4EE5;&#x5206;&#x8FD9;&#x51E0;&#x6761;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#xFF1A;</p>
<ul>
<li>&#x83B7;&#x5F97;&#x4E86;&#x54EA;&#x4E9B;&#x6536;&#x76CA;</li>
<li>&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x95EE;&#x9898;</li>
<li>&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x8BBE;&#x8BA1;&#x521D;&#x671F;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;</li>
<li>&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x9700;&#x8981;&#x63D0;&#x65E9;&#x89E3;&#x51B3;</li>
<li>&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x81EA;&#x5DF1;&#x6709;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x540E;&#x7EED;&#x8981;&#x5982;&#x4F55;&#x6539;&#x8FDB;&#x7B49;&#x7B49;</li>
<li>&#x5B8C;&#x6210;&#x4E00;&#x6B21;&#x9879;&#x76EE;&#x91CD;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x65E7;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x90FD;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x3001;&#x91CD;&#x6784;&#x65F6;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x83B7;&#x5F97;&#x7684;&#x6536;&#x76CA;&#x6700;&#x660E;&#x663E;&#x7B49;&#x7B49;&#x3002;</li>
</ul>
<hr>
<h3 id="&#x9AD8;&#x6548;&#x5B66;&#x4E60;tips">&#x9AD8;&#x6548;&#x5B66;&#x4E60;Tips</h3>
<p>&#x4E0B;&#x9762;&#x4ECE;&#x7ECF;&#x9A8C;&#x51FA;&#x53D1;&#xFF0C;&#x5206;&#x4EAB;&#x51E0;&#x4E2A;&#x9AD8;&#x6548;&#x5B66;&#x4E60;&#x7684; Tips&#x3002;</p>
<ol>
<li><p>&#x5FC5;&#x987B;&#x8981;&#x6709;&#x79EF;&#x6781;&#x4E3B;&#x52A8;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x89C2;&#x4E0A;&#x4E0D;&#x60F3;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x80AF;&#x5B9A;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x6709;&#x6548;&#x7387;&#x3002;&#x73B0;&#x5728;&#x79CD;&#x6811;&#x662F;&#x4E3A;&#x4E86;&#x65E5;&#x540E;&#x4E58;&#x51C9;&#x3002;</p>
</li>
<li><p>&#x8981;&#x628A;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x6210;&#x591A;&#x4E2A;&#x7B80;&#x5355;&#x3001;&#x5355;&#x4E00;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4E89;&#x53D6;&#x6BCF;&#x6B21;&#x53EA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6309;&#x81EA;&#x5DF1;&#x7684;&#x5F85;&#x529E;&#x4E8B;&#x9879;&#x8868;&#xFF0C;&#x4E00;&#x9879;&#x4E00;&#x9879;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8D8A;&#x4E13;&#x6CE8;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x8D8A;&#x9AD8;&#x3002;</p>
</li>
<li><p>&#x8981;&#x89C4;&#x5212;&#x597D;&#x65F6;&#x95F4;&#x8BA1;&#x5212;&#xFF0C;&#x5E76;&#x6309;&#x89C4;&#x5F8B;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x907F;&#x514D;&#x62D6;&#x5EF6;&#x75C7;&#x3002;&#x6CE8;&#x610F;&#x65F6;&#x95F4;&#x8BA1;&#x5212;&#x4E2D;&#x8981;&#x5B89;&#x6392;&#x51FA;&#x5145;&#x8DB3;&#x7684;&#x4F11;&#x606F;&#x65F6;&#x95F4;&#xFF0C;&#x4F1A;&#x4F11;&#x606F;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
</li>
<li><p>&#x8981;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x5DE5;&#x4F5C;&#x6216;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x3002;&#x6BD4;&#x5982;&#x5B66;&#x4E60;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65AD;&#x70B9;&#x8C03;&#x8BD5;&#x3001;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x3001;&#x753B;&#x7C7B;&#x5173;&#x7CFB;&#x56FE;&#x3001;&#x6D41;&#x7A0B;&#x56FE;&#x3001;&#x67B6;&#x6784;&#x56FE;&#x7B49;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x3002;</p>
</li>
<li><p>&#x8981;&#x6709;&#x9636;&#x6BB5;&#x7684;&#x4EA7;&#x51FA;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x7ECF;&#x5E38;&#x83B7;&#x5F97;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x7684;&#x575A;&#x6301;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x3002;&#x9636;&#x6BB5;&#x7684;&#x4EA7;&#x51FA;&#x7269;&#x53EF;&#x4EE5;&#x662F;&#x5B9A;&#x671F;&#x7684;&#x5DE5;&#x4F5C;&#x8BB0;&#x5F55;&#xFF0C;&#x5C0F;&#x7EC4;&#x5185;&#x7684;&#x6280;&#x672F;&#x5206;&#x4EAB;&#x3001;&#x603B;&#x7ED3;&#x7684;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x8981;&#x505A;&#x597D;&#x603B;&#x7ED3;&#x4E0E;&#x6539;&#x8FDB;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x65F6;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x592A;&#x4E60;&#x60EF;&#xFF0C;&#x6548;&#x7387;&#x5E76;&#x4E0D;&#x592A;&#x9AD8;&#xFF0C;&#x968F;&#x7740;&#x6309;&#x9636;&#x6BB5;&#x4E0D;&#x65AD;&#x603B;&#x7ED3;&#x548C;&#x6539;&#x8FDB;&#xFF0C;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x4E5F;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x63D0;&#x9AD8;&#x3002;</p>
</li>
</ol>
<p>&#x5728;&#x804C;&#x573A;&#x6253;&#x62FC;&#x5C31;&#x597D;&#x6BD4;&#x4E0B;&#x68CB;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x5929;&#x751F;&#x5C31;&#x662F;&#x9AD8;&#x624B;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x591A;&#x770B;&#x591A;&#x5B66;&#x3001;&#x591A;&#x5B9E;&#x6218;&#x5207;&#x78CB;&#x624D;&#x80FD;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#x3002;&#x800C;&#x4E14;&#x9AD8;&#x624B;&#x5728;&#x843D;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6C38;&#x8FDC;&#x601D;&#x8003;&#x7684;&#x90FD;&#x662F;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x60F3;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x591A;&#xFF0C;&#x68CB;&#x529B;&#x4E5F;&#x5C31;&#x66F4;&#x9AD8;&#x3002;&#x804C;&#x573A;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4E5F;&#x662F;&#x4ECE;&#x4E00;&#x540D;&#x5927;&#x5B66;&#x751F;&#xFF0C;&#x9760;&#x81EA;&#x5DF1;&#x6478;&#x7D22;&#x4E86; 10 &#x5E74;&#x9010;&#x6E10;&#x6210;&#x4E3A;&#x73B0;&#x5728;&#x7684;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x3002;&#x4F60;&#x53EA;&#x6709;&#x4E0D;&#x65AD;&#x5F80;&#x524D;&#x770B;&#x3001;&#x5F80;&#x5168;&#x5C40;&#x770B;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8D70;&#x597D;&#x4E0B;&#x4E00;&#x6B65;&#x3002;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#xFF0C;&#x627E;&#x5230;&#x6700;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x957F;&#x65B9;&#x5F0F;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第12节：架构的演进之路与前言技术.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第12节：架构的演进之路与前言技术">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"彩蛋：技术人行走职场的建议","level":"1.3.14","depth":2,"previous":{"title":"第12节：架构的演进之路与前言技术","level":"1.3.13","depth":2,"path":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","ref":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/彩蛋：技术人行走职场的建议.md","mtime":"2021-05-09T16:55:00.900Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

