
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第12节：架构的演进之路与前言技术 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="彩蛋：技术人行走职场的建议.html" />
    
    
    <link rel="prev" href="第11节：MySQL调优与最佳实践.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第12节：架构的演进之路与前言技术</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[toc]</p>
<h2 id="&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#x4E4B;&#x8DEF;&#x4E0E;&#x524D;&#x6CBF;&#x6280;&#x672F;">&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#x4E4B;&#x8DEF;&#x4E0E;&#x524D;&#x6CBF;&#x6280;&#x672F;</h2>
<p>&#x672C;&#x8BFE;&#x65F6;&#x4F1A;&#x8BB2;&#x89E3;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4EE5;&#x53CA;&#x9762;&#x8BD5;&#x4E2D;&#x505A;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x91CD;&#x70B9;&#x6709;&#x5982;&#x4E0B;&#x4E09;&#x90E8;&#x5206;&#x3002;</p>
<ul>
<li><p>&#x4ECB;&#x7ECD;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#xFF1A;&#x5305;&#x62EC;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x3001;&#x4E91;&#x539F;&#x751F;&#x4EE5;&#x53CA;&#x4E1A;&#x754C;&#x6700;&#x65B0;&#x8D8B;&#x52BF; ServiceMesh&#x3002;</p>
</li>
<li><p>&#x8BB2;&#x89E3;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x70B9;&#xFF1A;Docker &#x548C; K8s&#x3002;</p>
</li>
<li><p>&#x9762;&#x8BD5;&#x6280;&#x5DE7;&#xFF0C;&#x6559;&#x4F60;&#x5982;&#x4F55;&#x66F4;&#x6709;&#x6548;&#x5730;&#x505A;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x3002;</p>
</li>
</ul>
<h3 id="&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x6F14;&#x8FDB;">&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x6F14;&#x8FDB;</h3>
<p>&#x9996;&#x5148;&#x4EE5;&#x6F14;&#x8FDB;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x4E86;&#x89E3;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3002;</p>
<h4 id="&#x5355;&#x4F53;&#x67B6;&#x6784;"><strong>&#x5355;&#x4F53;&#x67B6;&#x6784;</strong></h4>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x662F;&#x5355;&#x4F53;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510002445.png?imageslim" alt=""></p>
<p>&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x6DF7;&#x5408;&#x90E8;&#x7F72;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#xFF0C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x8FDB;&#x7A0B;&#x5185;&#x8C03;&#x7528;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x6B63;&#x5982;&#x56FE;&#x4E2D; Service &#x4E4B;&#x95F4;&#x7684;&#x7EA2;&#x8272;&#x7BAD;&#x5934;&#x6240;&#x793A;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#xFF0C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8C03;&#x7528;&#x7684;&#x6027;&#x80FD;&#x4E5F;&#x6700;&#x597D;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x7F3A;&#x70B9;&#x4E5F;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li><p>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x9879;&#x76EE;&#x8D8A;&#x6765;&#x8D8A;&#x81C3;&#x80BF;&#xFF1B;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x56E0;&#x4E3A; JAR &#x5305;&#x5F15;&#x7528;&#x5BFC;&#x81F4;&#x9891;&#x7E41;&#x7684;&#x4F9D;&#x8D56;&#x51B2;&#x7A81;&#xFF1B;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x8D44;&#x6E90;&#x53D8;&#x66F4;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x88AB;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x5F15;&#x7528;&#xFF0C;&#x5347;&#x7EA7;&#x8D44;&#x6E90;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x4E1A;&#x52A1;&#x65B9;&#x540C;&#x65F6;&#x5347;&#x7EA7;&#xFF1B;</p>
</li>
<li><p>&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x76F4;&#x8FDE;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x4E5F;&#x5B58;&#x5728;&#x660E;&#x663E;&#x7684;&#x6570;&#x636E;&#x5B89;&#x5168;&#x98CE;&#x9669;&#xFF1B;</p>
</li>
<li><p>&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x540E;&#x56DE;&#x5F52;&#x56F0;&#x96BE;&#x3001;&#x67B6;&#x6784;&#x96BE;&#x4EE5;&#x8C03;&#x6574;&#x7B49;&#x7B49;&#x3002;</p>
</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x8026;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x5BFC;&#x81F4;&#x7684;&#x3002;&#x5728;&#x670D;&#x52A1;&#x89C4;&#x6A21;&#x4E0D;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x91C7;&#x7528;&#x5355;&#x4F53;&#x67B6;&#x6784;&#xFF0C;&#x65B9;&#x4FBF;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x670D;&#x52A1;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x65F6;&#xFF0C;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x5C31;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p><strong>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;</strong></p>
<p>&#x5F53;&#x670D;&#x52A1;&#x7684;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x670D;&#x52A1;&#x8026;&#x5408;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x51FA;&#x73B0;&#x4E86; SOA &#x5C31;&#x662F;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF0C;&#x5B83;&#x7684;&#x8D77;&#x6E90;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x968F;&#x7740;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x53D1;&#x5C55;&#x5230;&#x76EE;&#x524D;&#x4E1A;&#x754C;&#x666E;&#x904D;&#x91C7;&#x7528;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510002548.png?imageslim" alt=""></p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x8BA9;&#x670D;&#x52A1;&#x5C3D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5355;&#x72EC;&#x5F00;&#x53D1;&#x3001;&#x5355;&#x72EC;&#x6D4B;&#x8BD5;&#x3001;&#x5355;&#x72EC;&#x90E8;&#x7F72;&#x3002;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x901A;&#x8FC7; RPC &#x6216;&#x8005; HTTP &#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x4EA4;&#x4E92;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7684;&#x84DD;&#x8272;&#x52A0;&#x7C97;&#x7BAD;&#x5934;&#x6240;&#x793A;&#x3002; </p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x89E3;&#x51B3;&#x4E86;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x7684;&#x8026;&#x5408;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#x6216;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#xFF0C;&#x8981;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x524D;&#x9700;&#x8981;&#x5148;&#x627E;&#x5230;&#x670D;&#x52A1;&#xFF0C;&#x5373;&#x6240;&#x8C13;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x5FAE;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x53D1;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x524D;&#x9762;&#x8BFE;&#x7A0B;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684; RPC &#x65B9;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x7684;&#x6CE8;&#x518C;&#x548C;&#x8BA2;&#x9605;&#xFF0C;&#x6765;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x4E2D;&#x95F4;&#x7070;&#x8272;&#x7684; Registry &#x6A21;&#x5757;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7531;&#x670D;&#x52A1;&#x7684;&#x8C03;&#x7528;&#x7AEF;&#x83B7;&#x5F97;&#x5230;&#x5168;&#x90E8;&#x53EF;&#x7528;&#x670D;&#x52A1;&#x8282;&#x70B9;&#xFF0C;&#x7531; Client &#x4FA7;&#x8FDB;&#x884C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x662F;&#x901A;&#x8FC7; HTTP &#x534F;&#x8BAE;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x7AEF;&#x63D0;&#x4F9B;&#x7684; RESTful &#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0D;&#x9700;&#x8981; Client &#x4FA7;&#x505A;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x800C;&#x662F;&#x5728; Server &#x7AEF;&#x901A;&#x8FC7; Nignx &#x8FD9;&#x6837;&#x7684;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x6765;&#x63D0;&#x4F9B; Server &#x4FA7;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;</p>
<p>&#x4E0D;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x4EA4;&#x4E92;&#x90FD;&#x4ECE;&#x8FDB;&#x7A0B;&#x5185;&#x901A;&#x4FE1;&#x53D8;&#x6210;&#x4E86;&#x8FDC;&#x7A0B;&#x901A;&#x4FE1;&#xFF0C;&#x6240;&#x4EE5;&#x6027;&#x80FD;&#x5FC5;&#x7136;&#x4F1A;&#x53D7;&#x5230;&#x4E00;&#x4E9B;&#x5F71;&#x54CD;&#x3002;&#x6B64;&#x5916;&#x7531;&#x4E8E;&#x5F88;&#x591A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x3001;Server &#x7AEF;&#x670D;&#x52A1;&#x5668;&#x5B95;&#x673A;&#x3001;&#x6316;&#x6398;&#x673A;&#x94F2;&#x65AD;&#x673A;&#x623F;&#x5149;&#x7EA4;&#x7B49;&#x7B49;&#xFF0C;&#x9700;&#x8981;&#x8BB8;&#x591A;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x548C;&#x63AA;&#x65BD;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x5FAE;&#x670D;&#x52A1;&#x6D41;&#x7545;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x524D;&#x9762;&#x5728; Spring Cloud &#x5185;&#x5BB9;&#x4E2D;&#x63D0;&#x5230;&#x7684; Hystrix &#x7194;&#x65AD;&#x5668;&#x3001;Ribbon&#x5BA2;&#x6237;&#x7AEF;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x3001;Eureka&#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#x7B49;&#x7B49;&#x90FD;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x7EC4;&#x4EF6;&#x3002;</p>
<h4 id="cap-&#x539F;&#x5219;&#x4E0E;-base-&#x7406;&#x8BBA;"><strong>CAP &#x539F;&#x5219;&#x4E0E; BASE &#x7406;&#x8BBA;</strong></h4>
<p>&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684; CAP &#x539F;&#x5219;&#x4E0E; BASE &#x7406;&#x8BBA;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;CAP &#x539F;&#x5219;&#x6307;&#x7684;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;Consistency &#x4E00;&#x81F4;&#x6027;&#x3001; Availability &#x53EF;&#x7528;&#x6027;&#x3001;Partition tolerance &#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x7279;&#x6027;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x4E24;&#x4E2A;&#xFF0C;&#x4E09;&#x8005;&#x4E0D;&#x53EF;&#x517C;&#x5F97;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510002639.png?imageslim" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x81F4;&#x6027;&#x6307;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF1B;&#x53EF;&#x7528;&#x6027;&#x6307;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x8BFB;&#x548C;&#x5199;&#xFF1B;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#x662F;&#x6307;&#x5F53;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#x6216;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#x6545;&#x969C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x6EE1;&#x8DB3;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x65E2;&#x7136;&#x65E0;&#x6CD5;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x4E09;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x6709;&#x4E09;&#x79CD;&#x53D6;&#x820D;&#x3002;</p>
<ul>
<li><p>&#x7B2C;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F; CA&#xFF0C;&#x5C31;&#x662F;&#x653E;&#x5F03;&#x5206;&#x533A;&#x5BB9;&#x9519;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x7B49;&#x540C;&#x4E8E;&#x653E;&#x5F03;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5; CA &#x53EA;&#x5B58;&#x5728;&#x4E8E;&#x5355;&#x673A;&#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x4E2A;&#x9009;&#x62E9;&#x662F; CP&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x5F3A;&#x4E00;&#x81F4;&#x548C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#xFF0C;&#x5141;&#x8BB8;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#x51FA;&#x73B0;&#x77ED;&#x65F6;&#x7684;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x91C7;&#x7528; CP &#x539F;&#x5219;&#x5B9E;&#x73B0;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6BD4;&#x5982; ZooKeeper&#x3002;ZooKeeper&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x534F;&#x8C03;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x662F; ZK &#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#xFF0C;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x77ED;&#x65F6;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;ZK &#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x7528;&#x6765;&#x505A;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#x3002;&#x5176;&#x4ED6;&#x9009;&#x62E9; CP &#x5B9E;&#x73B0;&#x7684;&#x7CFB;&#x7EDF;&#x8FD8;&#x6709; Consul&#x3001;etcd &#x7B49;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x4E2A;&#x9009;&#x62E9;&#x662F; AP&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#xFF0C;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x51FA;&#x73B0;&#x77ED;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x91C7;&#x7528; AP &#x539F;&#x5219;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6709; Eureka&#x3001;Nacos&#x3002;&#x5728;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x77ED;&#x671F;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x5BF9;&#x670D;&#x52A1;&#x4EA4;&#x4E92;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x6B64;&#x91C7;&#x7528; AP &#x539F;&#x5219;&#x7684;&#x6CE8;&#x518C;&#x4E2D;&#x5FC3;&#x624D;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
</li>
</ul>
<p>&#x7136;&#x540E;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B; BASE &#x7406;&#x8BBA;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x5E95;&#x90E8;&#x7684;&#x8BCD;&#x6C47;&#x6240;&#x793A;&#xFF0C;BASE  &#x662F;&#x6307; Basically Available &#x57FA;&#x672C;&#x53EF;&#x7528;&#xFF0C;Soft-state &#x8F6F;&#x72B6;&#x6001;&#xFF0C;Eventual Consistency &#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5B83;&#x662F;&#x5BF9; CAP &#x4E2D;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x6743;&#x8861;&#x7684;&#x7ED3;&#x679C;&#x3002;BASE &#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5373;&#x4F7F;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x7279;&#x70B9;&#xFF0C;&#x91C7;&#x7528;&#x9002;&#x5F53;&#x7684;&#x65B9;&#x5F0F;&#x8FBE;&#x5230;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<h4 id="&#x4E91;&#x539F;&#x751F;&#x670D;&#x52A1;"><strong>&#x4E91;&#x539F;&#x751F;&#x670D;&#x52A1;</strong></h4>
<p>&#x7EE7;&#x7EED;&#x8BB2;&#x89E3;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x670D;&#x52A1;&#x89E3;&#x8026;&#x5408;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#x6210;&#x4F17;&#x591A;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x90E8;&#x7F72;&#x9700;&#x8981;&#x8003;&#x8651;&#x5355;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x673A;&#x623F;&#x591A;&#x8282;&#x70B9;&#x90E8;&#x7F72;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x6D6A;&#x8D39;&#x3002; </p>
<p>&#x53E6;&#x5916;&#x5728;&#x670D;&#x52A1;&#x6269;&#x5BB9;&#x65F6;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x4F9D;&#x8D56;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5BF9;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x666E;&#x53CA;&#x6709;&#x4E00;&#x5B9A;&#x963B;&#x788D;&#x3002;&#x5BB9;&#x5668;&#x5316;&#x6280;&#x672F;&#x628A;&#x670D;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x6253;&#x5305;&#x7BA1;&#x7406;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x670D;&#x52A1;&#x6269;&#x7F29;&#x5BB9;&#x65F6;&#x5BF9;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x7684;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5229;&#x7528;&#x7387;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#x968F;&#x7740;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x9010;&#x6E10;&#x6210;&#x719F;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4E5F;&#x5FEB;&#x901F;&#x666E;&#x53CA;&#x3002;</p>
<p>&#x4E91;&#x539F;&#x751F;&#x67B6;&#x6784;&#x7531;&#x5FAE;&#x670D;&#x52A1;&#x7EC4;&#x6210;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x3001;&#x6301;&#x7EED;&#x3001;&#x53EF;&#x9760;&#x3001;&#x89C4;&#x6A21;&#x5316;&#x5730;&#x4EA4;&#x4ED8;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x56FE;&#x4E0A;&#x90E8;&#x5217;&#x51FA;&#x4E86;&#x4E91;&#x539F;&#x751F;&#x7684;&#x4E09;&#x4E2A;&#x7279;&#x5F81;&#xFF1A;</p>
<ul>
<li><p>&#x5BB9;&#x5668;&#x5316;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x662F;&#x4E91;&#x539F;&#x751F;&#x7684;&#x4E3B;&#x4F53;&#xFF1B;</p>
</li>
<li><p>Devops&#xFF0C;&#x662F;&#x5BF9;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x52A8;&#x6001;&#x7BA1;&#x7406;&#xFF1B;</p>
</li>
<li><p>&#x6301;&#x7EED;&#x4EA4;&#x4ED8;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x662F;&#x4E91;&#x539F;&#x751F;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
</li>
</ul>
<p><img src="https://img.jinguo.tech/blog/20210510002845.png?imageslim" alt=""></p>
<p>&#x4E91;&#x539F;&#x751F;&#x670D;&#x52A1;&#x9700;&#x8981;&#x5E95;&#x5C42;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x63D0;&#x4F9B; IaaS &#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6216;&#x8005; PaaS &#x5E73;&#x53F0;&#x8BBE;&#x65BD;&#x6765;&#x8FD0;&#x884C;&#xFF0C;IaaS &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x63D0;&#x4F9B;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#xFF0C;PaaS &#x5E73;&#x53F0;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x63D0;&#x4F9B;&#x4E86;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF1A;&#x81EA;&#x5EFA;&#x7684;&#x79C1;&#x6709;&#x4E91;&#x548C;&#x4E91;&#x5382;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x516C;&#x6709;&#x4E91;&#x3002;&#x516C;&#x6709;&#x4E91;&#x6BD4;&#x5982;&#x963F;&#x91CC;&#x4E91;&#x3001;AWS&#x3001;&#x817E;&#x8BAF;&#x4E91;&#x7B49;&#x7B49;&#xFF0C;&#x50CF;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x79C1;&#x6709;&#x4E91;&#x4E0E;&#x516C;&#x6709;&#x4E91;&#x7ED3;&#x5408;&#x7684;&#x6DF7;&#x5408;&#x4E91;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x539F;&#x5219;&#xFF1A;12 &#x8981;&#x7D20;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510002906.png?imageslim" alt=""></p>
<p>12&#x8981;&#x7D20;&#x5B9A;&#x4E49;&#x4E86;&#x8BBE;&#x8BA1;SaaS&#x5E94;&#x7528;&#x65F6;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF0C;SaaS&#x662F;&#x8F6F;&#x4EF6;&#x5373;&#x670D;&#x52A1;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x901A;&#x8FC7;&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x6765;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;  </p>
<ol>
<li><p>&#x7B2C; 1 &#x4E2A;&#x8981;&#x7D20;&#x662F;&#x57FA;&#x51C6;&#x4EE3;&#x7801;&#xFF0C;&#x662F;&#x6307;&#x4EE3;&#x7801;&#x7531;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x6765;&#x7BA1;&#x7406;&#xFF0C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x53EA;&#x6709;&#x4E00;&#x4EFD;&#x57FA;&#x51C6;&#x4EE3;&#x7801;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x6709;&#x591A;&#x4E2A;&#x7684;&#x90E8;&#x7F72;&#x5B9E;&#x4F8B;&#x3002;</p>
</li>
<li><p>&#x7B2C; 2 &#x4E2A;&#x8981;&#x7D20;&#x4F9D;&#x8D56;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x663E;&#x793A;&#x7684;&#x58F0;&#x660E;&#x4F9D;&#x8D56;&#xFF0C;&#x65B9;&#x4FBF;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x6784;&#x5EFA;&#x3002; </p>
</li>
<li><p>&#x7B2C; 3 &#x4E2A;&#x8981;&#x7D20;&#x914D;&#x7F6E;&#xFF0C;&#x6307;&#x8981;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5199;&#x5728;&#x4EE3;&#x7801;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x914D;&#x7F6E;&#x4E0E;&#x4EE3;&#x7801;&#x8981;&#x5206;&#x5F00;&#x7BA1;&#x7406;&#xFF0C;&#x4ECE;&#x4EE3;&#x7801;&#x5916;&#x90E8;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x4F8B;&#x5982;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#x3001;&#x4EFF;&#x771F;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#x4EE5;&#x53CA;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x914D;&#x7F6E;&#x90FD;&#x5E94;&#x8BE5;&#x4ECE;&#x5BF9;&#x5E94;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#x3002; </p>
</li>
<li><p>&#x7B2C; 4 &#x4E2A;&#x8981;&#x7D20;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x628A;&#x4F9D;&#x8D56;&#x7684;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x7EDF;&#x4E00;&#x770B;&#x4F5C;&#x8D44;&#x6E90;&#x6765;&#x5BF9;&#x5F85;&#x3002;&#x4E0D;&#x8BBA;&#x662F; DB&#x3001;&#x7F13;&#x5B58;&#x8FD8;&#x662F; HTTP &#x670D;&#x52A1;&#x3002; </p>
</li>
<li><p>&#x7B2C; 5 &#x4E2A;&#x8981;&#x7D20;&#x662F;&#x6784;&#x5EFA;&#x3001;&#x53D1;&#x5E03;&#x3001;&#x8FD0;&#x884C;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x4E25;&#x683C;&#x533A;&#x5206;&#x5E94;&#x7528;&#x7684;&#x6784;&#x5EFA;&#x3001;&#x53D1;&#x5E03;&#x3001;&#x8FD0;&#x884C;&#x8FD9;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x6309;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x3002; </p>
</li>
<li><p>&#x7B2C; 6 &#x4E2A;&#x8981;&#x7D20;&#x8FDB;&#x7A0B;&#xFF0C;&#x662F;&#x6307;&#x5E94;&#x7528;&#x4EE5;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x8981;&#x4FDD;&#x8BC1;&#x5E94;&#x7528;&#x7684;&#x65E0;&#x72B6;&#x6001;&#x6027;&#x3002; </p>
</li>
<li><p>&#x7B2C; 7 &#x4E2A;&#x8981;&#x7D20;&#x7AEF;&#x53E3;&#x7ED1;&#x5B9A;&#xFF0C;&#x662F;&#x6307;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7AEF;&#x53E3;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x5E94;&#x7528;&#x4E0E;&#x7AEF;&#x53E3;&#x662F;&#x7ED1;&#x5B9A;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x6307;&#x5177;&#x4F53;&#x7684;&#x67D0;&#x4E2A;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x800C;&#x662F;&#x6307;&#x4E00;&#x65E6;&#x670D;&#x52A1;&#x542F;&#x52A8;&#x786E;&#x5B9A;&#x4E86;&#x7AEF;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x5C31;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x5BF9;&#x5E94;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x505C;&#x6B62;&#x3002; </p>
</li>
<li><p>&#x7B2C; 8 &#x4E2A;&#x8981;&#x7D20;&#x5E76;&#x53D1;&#xFF0C;&#x662F;&#x6307;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x5E76;&#x53D1;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x8FDB;&#x7A0B;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x3002; </p>
</li>
<li><p>&#x7B2C; 9 &#x4E2A;&#x8981;&#x7D20;&#x6613;&#x5904;&#x7406;&#xFF0C;&#x662F;&#x6307;&#x5E94;&#x7528;&#x5E94;&#x8BE5;&#x5BB9;&#x6613;&#x88AB;&#x7BA1;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F18;&#x96C5;&#x505C;&#x673A;&#x548C;&#x5FEB;&#x901F;&#x542F;&#x52A8;&#xFF0C;&#x6784;&#x5EFA;&#x6700;&#x5065;&#x58EE;&#x7684;&#x670D;&#x52A1;&#x3002; </p>
</li>
<li><p>&#x7B2C; 10 &#x4E2A;&#x8981;&#x7D20;&#x5F00;&#x53D1;/&#x751F;&#x4EA7;&#x7B49;&#x4EF7;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x4FDD;&#x8BC1;&#x5728;&#x5F00;&#x53D1;&#x3001;&#x9884;&#x89C8;&#x3001;&#x751F;&#x4EA7;&#x7B49;&#x4E0D;&#x540C;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x4E00;&#x81F4;&#x3002; </p>
</li>
<li><p>&#x7B2C; 11 &#x4E2A;&#x8981;&#x7D20;&#x65E5;&#x5FD7;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x5408;&#x7406;&#x8BB0;&#x5F55;&#x5E94;&#x7528;&#x7684;&#x8FD0;&#x884C;&#x65E5;&#x5FD7;&#xFF0C;&#x5E76;&#x628A;&#x65E5;&#x5FD7;&#x5F53;&#x4F5C;&#x4E00;&#x79CD;&#x4E8B;&#x4EF6;&#x6D41;&#x6765;&#x5BF9;&#x5F85;&#xFF0C;&#x65B9;&#x4FBF;&#x5BF9;&#x65E5;&#x5FD7;&#x7684;&#x6536;&#x96C6;&#x548C;&#x5904;&#x7406;&#x3002; </p>
</li>
<li><p>&#x7B2C; 12 &#x4E2A;&#x8981;&#x7D20;&#x7BA1;&#x7406;&#x8FDB;&#x7A0B;&#xFF0C;&#x662F;&#x6307;&#x8981;&#x628A;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x4EFB;&#x52A1;&#x5F53;&#x4F5C;&#x4E00;&#x6B21;&#x6027;&#x8FDB;&#x7A0B;&#x6765;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5E38;&#x9A7B;&#x540E;&#x53F0;&#x8FDB;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
</ol>
<p>&#x4EE5;&#x4E0A;12&#x8981;&#x7D20;&#x662F;&#x5BF9;&#x8BBE;&#x8BA1;&#x4E91;&#x539F;&#x751F;&#x670D;&#x52A1;&#x7684;&#x6307;&#x5BFC;&#x539F;&#x5219;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x8FDB;&#x884C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x5B8C;&#x5168;&#x7167;&#x642C;&#x3002;</p>
<hr>
<h3 id="service-mesh">Service Mesh</h3>
<p>&#x4E91;&#x539F;&#x751F;&#x5E94;&#x7528;&#x662F;&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x63A8;&#x8FDB;&#x65B9;&#x5411;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x4EE3;&#x7684;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x6700;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x5316;&#x8D8B;&#x52BF;&#xFF0C;&#x5B83;&#x79BB;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E9B;&#x9065;&#x8FDC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9759;&#x5F85;&#x5B83;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>Service Mesh &#x662F; 2017 &#x5E74;&#x9010;&#x6E10;&#x5728;&#x56FD;&#x5185;&#x8FDB;&#x5165;&#x5927;&#x5BB6;&#x89C6;&#x91CE;&#x7684;&#x4E00;&#x79CD;&#x67B6;&#x6784;&#x65B9;&#x5F0F;&#xFF0C;&#x88AB;&#x8A89;&#x4E3A;&#x4E0B;&#x4E00;&#x4EE3;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x3002;Service Mesh &#x5728;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A; Sidecar &#x8FB9;&#x8F66;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x5DE6;&#x4E0B;&#x65B9;&#x7684;&#x653E;&#x5927;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x4F1A;&#x4F34;&#x751F;&#x7740;&#x90E8;&#x7F72;&#x4E00;&#x4E2A; Sidecar&#xFF0C;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x4E0D;&#x518D;&#x7531;&#x670D;&#x52A1;&#x81EA;&#x8EAB;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x670D;&#x52A1;&#x6240;&#x6709;&#x7684;&#x51FA;&#x3001;&#x5165;&#x8BF7;&#x6C42;&#x90FD;&#x4EA4;&#x7531;&#x8FD9;&#x4E2A; Sidecar &#x6765;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x5E73;&#x9762;&#x5BF9;&#x6240;&#x6709;&#x7684; Sidecar &#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x7531; Sidecar &#x6765;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3001;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x6D41;&#x91CF;&#x8C03;&#x5EA6;&#x7B49;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510003123.png?imageslim" alt=""></p>
<p>&#x76EE;&#x524D;&#x6700;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684; Service Mesh &#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#xFF0C;&#x662F;&#x7531; Google&#x3001;IBM&#x3001;Lyft &#x4E09;&#x5BB6;&#x4E00;&#x8D77;&#x7EF4;&#x62A4;&#x7684; Istio&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x5173;&#x6CE8;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x8BE6;&#x7EC6;&#x5C55;&#x5F00;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48; Service Mesh &#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x533A;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;Service Mesh &#x53C8;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510003139.png?imageslim" alt=""></p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x51FA;&#x73B0;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8026;&#x5408;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7EFF;&#x8272;&#x7684;&#x7AD6;&#x7EBF;&#xFF0C;&#x5C31;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x628A; Service A&#x3001;B&#x3001;C &#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x8026;&#xFF0C;&#x670D;&#x52A1;&#x5355;&#x72EC;&#x90E8;&#x7F72;&#x3001;&#x5355;&#x72EC;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x65F6;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x90FD;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4F8B;&#x5982;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3001;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x4EA4;&#x4E92;&#x3001;&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x7B56;&#x7565;&#x3001;&#x670D;&#x52A1;&#x7194;&#x65AD;&#x7B49;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x4E0E;&#x670D;&#x52A1;&#x81EA;&#x8EAB;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#x3002;</p>
<p>Service Mesh &#x7684;&#x601D;&#x8DEF;&#x662F;&#x628A;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0E;&#x4E1A;&#x52A1;&#x65E0;&#x5173;&#x7684;&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x89E3;&#x8026;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7EA2;&#x8272;&#x7684;&#x7EBF;&#xFF0C;&#x5BF9;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x6A2A;&#x5207;&#xFF0C;&#x628A;&#x4E0E;&#x670D;&#x52A1;&#x4EA4;&#x4E92;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#x4ECE;&#x670D;&#x52A1;&#x4E2D;&#x5265;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x7EDF;&#x4E00;&#x4EA4;&#x7ED9; Sidecar &#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x66F4;&#x805A;&#x7126;&#x4E8E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x63D0;&#x9AD8;&#x7814;&#x53D1;&#x6548;&#x7387;&#x3002;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x529F;&#x80FD;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#xFF0C;Sidecar &#x53EF;&#x4EE5;&#x66F4;&#x4E13;&#x6CE8;&#x4E8E;&#x670D;&#x52A1;&#x7684;&#x4EA4;&#x4E92;&#x4E0E;&#x7BA1;&#x7406;&#xFF0C;&#x66F4;&#x65B9;&#x4FBF;&#x5B9E;&#x73B0;&#x6781;&#x81F4;&#x7684;&#x529F;&#x80FD;&#x4E0E;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;Service Mesh &#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5B83;&#x5BF9;&#x4E1A;&#x52A1;&#x4E0E;&#x670D;&#x52A1;&#x4EA4;&#x4E92;&#x3001;&#x7BA1;&#x7406;&#x8FDB;&#x884C;&#x4E86;&#x62C6;&#x5206;&#xFF0C;&#x63D0;&#x4F9B;&#x7EDF;&#x4E00;&#x3001;&#x5F3A;&#x5927;&#x7684;&#x670D;&#x52A1;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x6F14;&#x8FDB;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;Service Mesh &#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x7684; Sidecar &#x8FDB;&#x7A0B;&#xFF0C;&#x5929;&#x7136;&#x9002;&#x5408;&#x4E3A;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x7684;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7EDF;&#x4E00;&#x7684;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x6B64;&#x8DE8;&#x8BED;&#x8A00;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x4E5F;&#x662F; Service Mesh &#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x70B9;&#xFF0C;&#x50CF;&#x5FAE;&#x535A;&#x57FA;&#x4E8E; Motan &#x7814;&#x53D1;&#x7684; Weibo Mesh&#xFF0C;&#x521D;&#x8877;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5185;&#x90E8;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x670D;&#x52A1;&#x5316;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5F15;&#x5165;&#x4E86;&#x989D;&#x5916;&#x7684; Sidecar&#xFF0C;Service Mesh &#x7684;&#x67B6;&#x6784;&#x590D;&#x6742;&#x5EA6;&#x66F4;&#x9AD8;&#xFF0C;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F; Service Mesh &#x67B6;&#x6784;&#x9700;&#x8981;&#x52AA;&#x529B;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x610F;&#x4E49;"><strong>&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x610F;&#x4E49;</strong></h4>
<p>&#x901A;&#x8FC7;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x4ECE;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x5230;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x89E3;&#x8026;&#xFF0C;&#x4F46;&#x5E26;&#x6765;&#x4E86;&#x989D;&#x5916;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x4E0E;&#x4EA4;&#x4E92;&#x95EE;&#x9898;&#xFF1B;&#x4ECE;&#x5FAE;&#x670D;&#x52A1;&#x5230; Service Mesh&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E1A;&#x52A1;&#x4E0E;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x529F;&#x80FD;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x4F46;&#x662F;&#x5F15;&#x5165;&#x4E86;&#x989D;&#x5916;&#x7684;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x67B6;&#x6784;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x968F;&#x4E4B;&#x63D0;&#x9AD8;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x610F;&#x4E49;&#x5728;&#x54EA;&#x91CC;&#xFF1F;</p>
<p>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x4ECE;&#x6765;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6743;&#x8861;&#x7684;&#x827A;&#x672F;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x8BA9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x4E86;&#x8F6C;&#x79FB;&#xFF0C;&#x65B9;&#x4FBF;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x96C6;&#x4E2D;&#x6574;&#x6CBB;&#x548C;&#x5904;&#x7406;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x66F4;&#x805A;&#x7126;&#x4E1A;&#x52A1;&#x7814;&#x53D1;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x4EA4;&#x7ED9;&#x4E13;&#x95E8;&#x7684;&#x7EC4;&#x4EF6;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x672F;&#x4E1A;&#x6709;&#x4E13;&#x653B;&#x3002;&#x901A;&#x8FC7;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x8FDB;&#xFF0C;&#x867D;&#x7136;&#x5F53;&#x4E0B;&#x6CA1;&#x6709;&#x6D88;&#x706D;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x7684;&#x8BA9;&#x95EE;&#x9898;&#x53D8;&#x7684;&#x900F;&#x660E;&#x5316;&#xFF0C;&#x53D8;&#x7684;&#x4E1A;&#x52A1;&#x65E0;&#x611F;&#x77E5;&#xFF0C;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x6574;&#x4F53;&#x7684;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x4E0E;&#x6269;&#x5C55;&#x80FD;&#x529B;&#xFF0C;&#x62D3;&#x5BBD;&#x670D;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x4E0A;&#x9650;&#x3002;</p>
<h3 id="&#x5BB9;&#x5668;&#x5316;&#x57FA;&#x7840;">&#x5BB9;&#x5668;&#x5316;&#x57FA;&#x7840;</h3>
<p>&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x5C31;&#x662F;&#xFF1A;&#x5BB9;&#x5668;&#x5316;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x5BB9;&#x5668;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x6210;&#x719F;&#x3002;&#x6240;&#x4EE5;&#x63A5;&#x4E0B;&#x6765;&#x5B66;&#x4E60;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5BB9;&#x5668;&#x5316;&#x6280;&#x672F; Docker &#x548C;&#x5BB9;&#x5668;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF; Kubernetes&#x3002;</p>
<h4 id="docker-&#x4F5C;&#x7528;"><strong>Docker &#x4F5C;&#x7528;</strong></h4>
<p>Docker &#x7684;&#x4F5C;&#x7528;&#x4E3B;&#x8981;&#x662F;&#x5FEB;&#x901F;&#x7684;&#x6784;&#x5EFA;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x955C;&#x50CF;&#x80FD;&#x591F;&#x4E3A;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5BB9;&#x5668;&#x5316;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x5C4F;&#x853D;&#x4E0D;&#x540C;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x5728;&#x4EFB;&#x4F55; Docker &#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x50CF; Java &#x7684;&#x4E00;&#x6B21;&#x7F16;&#x8BD1;&#x5230;&#x5904;&#x8FD0;&#x884C;&#x3002;</p>
<p>Docker &#x662F;&#x8F7B;&#x91CF;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x53F0;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x5BF9;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4E86;&#x6709;&#x6548;&#x7684;&#x9694;&#x79BB;&#xFF0C;&#x63D0;&#x9AD8;&#x5BBF;&#x4E3B;&#x673A;&#x7684;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x3002;</p>
<h4 id="docker-&#x7279;&#x70B9;"><strong>Docker &#x7279;&#x70B9;</strong></h4>
<ol>
<li><p>&#x5F00;&#x6E90;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x4F7F;&#x7528; Docker &#x5BB9;&#x5668;&#x6280;&#x672F;&#x3002;</p>
</li>
<li><p>&#x57FA;&#x4E8E; LXC &#x5B9E;&#x73B0;&#x7684;&#x8F7B;&#x91CF;&#x865A;&#x62DF;&#x5316;&#xFF0C;Docker &#x5BB9;&#x5668;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6A21;&#x62DF;&#xFF0C;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#x3002;</p>
</li>
<li><p>&#x80FD;&#x591F;&#x652F;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x6784;&#x5EFA;&#x3002;</p>
</li>
<li><p>Docker &#x7684;&#x67B6;&#x6784;&#x5341;&#x5206;&#x7075;&#x6D3B;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x652F;&#x6301;&#x4E0D;&#x540C;&#x5B58;&#x50A8;&#x9A71;&#x52A8;&#x5B9E;&#x73B0;&#x3002;</p>
</li>
<li><p>Docker &#x63D0;&#x4F9B;&#x53EF;&#x89C6;&#x5316; UI&#xFF0C;&#x7BA1;&#x7406;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
</li>
</ol>
<h4 id="docker-&#x4E3B;&#x8981;&#x6982;&#x5FF5;"><strong>Docker &#x4E3B;&#x8981;&#x6982;&#x5FF5;</strong></h4>
<ol>
<li>&#x955C;&#x50CF;&#xFF0C;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x548C;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x955C;&#x50CF;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x955C;&#x50CF;&#x662F;&#x90E8;&#x7F72;&#x7684;&#x57FA;&#x7840;&#x3002;</li>
<li><p>&#x5BB9;&#x5668;&#xFF0C;&#x5C31;&#x662F; Container&#xFF0C;&#x5BB9;&#x5668;&#x662F;&#x57FA;&#x4E8E;&#x955C;&#x50CF;&#x7684;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x5BB9;&#x5668;&#x3002;</p>
</li>
<li><p>&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x662F;&#x8FD0;&#x884C;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x7BA1;&#x7406;&#x8FDB;&#x7A0B;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x8FC7; Client &#x4E0E;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;</p>
</li>
<li><p>&#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x7528;&#x6765;&#x548C;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4EA4;&#x4E92;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; Socket &#x6216;&#x8005; RESTful API &#x8BBF;&#x95EE;&#x8FDC;&#x7A0B;&#x7684; Docker &#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x955C;&#x50CF;&#x4ED3;&#x5E93;&#xFF0C;&#x7C7B;&#x4F3C;&#x6211;&#x4EEC;&#x7684; Git &#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#xFF0C;&#x955C;&#x50CF;&#x4ED3;&#x5E93;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x3001;&#x7BA1;&#x7406;&#x4E0D;&#x540C;&#x670D;&#x52A1;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x955C;&#x50CF;&#x3002;&#x670D;&#x52A1;&#x90E8;&#x7F72;&#x65F6;&#x4F1A;&#x4ECE;&#x955C;&#x50CF;&#x4ED3;&#x5E93;&#x62C9;&#x53D6;&#x5BF9;&#x5E94;&#x7248;&#x672C;&#x7684;&#x955C;&#x50CF;&#x8FDB;&#x884C;&#x90E8;&#x7F72;&#x3002;</p>
</li>
</ol>
<h4 id="docker&#x5B9E;&#x73B0;&#x539F;&#x7406;"><strong>Docker&#x5B9E;&#x73B0;&#x539F;&#x7406;</strong></h4>
<p>Docker &#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x4E0D;&#x540C;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x6765;&#x5B9E;&#x73B0;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x4E3B;&#x8981;&#x5229;&#x7528;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7684;&#x9694;&#x79BB;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510003358.png?imageslim" alt=""></p>
<p>&#x9996;&#x5148;&#x662F;&#x5229;&#x7528; Linux &#x7684; Namespace &#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x6765;&#x9694;&#x79BB;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x5F7C;&#x6B64;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x7684; Namespace&#xFF0C;&#x4E92;&#x76F8;&#x65E0;&#x6CD5;&#x611F;&#x77E5;&#x5BF9;&#x65B9;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p>Docker &#x5B9E;&#x73B0;&#x4E86; Host&#x3001;Container&#x3001;None &#x548C; Bridge &#x56DB;&#x79CD;&#x7F51;&#x7EDC;&#x6A21;&#x5F0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528; Bridge &#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x5728;&#x521B;&#x5EFA;&#x65F6;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x5BF9;&#x865A;&#x62DF;&#x7F51;&#x5361;&#xFF0C;&#x4E24;&#x4E2A;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x7EC4;&#x6210;&#x4E86;&#x6570;&#x636E;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4F1A;&#x653E;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4F1A;&#x52A0;&#x5165;&#x5230; Docker0 &#x7684;&#x7F51;&#x6865;&#x4E2D;&#x3002;Docker0 &#x7F51;&#x6865;&#x901A;&#x8FC7; iptables &#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x4E0E;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x7F51;&#x5361;&#x76F8;&#x8FDE;&#xFF0C;&#x6240;&#x6709;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x90FD;&#x4F1A;&#x901A;&#x8FC7; iptables &#x8F6C;&#x53D1;&#x5230; Docker0 &#x5E76;&#x7531;&#x7F51;&#x6865;&#x5206;&#x53D1;&#x7ED9;&#x5BF9;&#x5E94;&#x7684;&#x5BB9;&#x5668;&#x7F51;&#x5361;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5BB9;&#x5668;&#x8FDB;&#x7A0B;&#x4FEE;&#x6539;&#x5BBF;&#x4E3B;&#x673A;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#xFF0C;Docker &#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x7684;&#x6839;&#x8282;&#x70B9;&#xFF0C;&#x7ED3;&#x5408; Namespace &#x6765;&#x9694;&#x79BB;&#x4E0D;&#x540C;&#x5BB9;&#x5668;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x901A;&#x8FC7; Namespace&#xFF0C;Docker &#x9694;&#x79BB;&#x4E86;&#x8FDB;&#x7A0B;&#x3001;&#x7F51;&#x7EDC;&#x548C;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x4E2D;&#x7684; CPU &#x548C;&#x5185;&#x5B58;&#x7B49;&#x8FD8;&#x662F;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x3002;Docker &#x901A;&#x8FC7; Control Groups &#x4E5F;&#x5C31;&#x662F; Cgroups &#x6765;&#x5BF9;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x9650;&#x5236;&#xFF0C;&#x5305;&#x62EC; CPU&#x3001;&#x5185;&#x5B58;&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x7B49;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;Docker &#x662F;&#x5982;&#x4F55;&#x628A;&#x955C;&#x50CF;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x7684;&#x5462;&#xFF1F;Docker &#x7684;&#x955C;&#x50CF;&#x662F;&#x5206;&#x5C42;&#x7ED3;&#x6784;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x955C;&#x50CF;&#x53EF;&#x4EE5;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C42;&#x3001;&#x57FA;&#x7840;&#x73AF;&#x5883;&#x5C42;&#x3001;Web &#x5BB9;&#x5668;&#x5C42;&#x3001;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x5C42;&#xFF0C;&#x5C42;&#x5C42;&#x4F9D;&#x8D56;&#x6784;&#x6210;&#x3002;&#x901A;&#x8FC7; UnionFS &#x5C31;&#x662F;&#x8054;&#x5408;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x628A; Image &#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x5206;&#x5C42;&#x4F5C;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x53EA;&#x8BFB;&#x76EE;&#x5F55;&#xFF0C;&#x800C; Container &#x662F;&#x5728;&#x53EA;&#x8BFB;&#x7684;&#x955C;&#x50CF;&#x76EE;&#x5F55;&#x4E0A;&#x521B;&#x5EFA;&#x7684;&#x53EF;&#x8BFB;&#x53EF;&#x5199;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x628A;&#x955C;&#x50CF;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x7684;&#x3002;Docker &#x63D0;&#x4F9B;&#x4E86; AUFS&#x3001;Overlay&#x3001;Devicemapper&#x3001;ZFS &#x7B49;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x5B58;&#x50A8;&#x9A71;&#x52A8;&#x5B9E;&#x73B0;&#x3002;</p>
<h4 id="kubernetes-&#x4F5C;&#x7528;"><strong>Kubernetes &#x4F5C;&#x7528;</strong></h4>
<p>Kubernetes &#x4E5F;&#x53EB; K8s&#xFF0C;&#x56E0;&#x4E3A; K &#x4E0E; s &#x4E4B;&#x95F4;&#x4E00;&#x5171;&#x6709; 8  &#x4E2A;&#x5B57;&#x6BCD;&#x3002;K8s &#x662F;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A; PaaS &#x5E73;&#x53F0;&#xFF0C;PaaS &#x5E73;&#x53F0;&#x662F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728; K8s &#x4E4B;&#x4E0A;&#x7684;&#x3002;</p>
<p>K8s &#x7684;&#x4F5C;&#x7528;&#x662F;&#x8FDB;&#x884C;&#x5BB9;&#x5668;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#xFF0C;&#x5B83;&#x53EA;&#x9488;&#x5BF9;&#x5BB9;&#x5668;&#x7BA1;&#x7406;&#xFF0C;&#x4E0D;&#x90E8;&#x7F72;&#x6E90;&#x7801;&#x4E0D;&#x7F16;&#x8BD1;&#x5E94;&#x7528;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x5BB9;&#x5668;&#x7684;&#x81EA;&#x52A8;&#x90E8;&#x7F72;&#x4E0E;&#x6309;&#x6307;&#x5B9A;&#x6761;&#x4EF6;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x6269;&#x7F29;&#x5BB9;&#x670D;&#x52A1;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x5E94;&#x7528;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x652F;&#x6301;&#x5E94;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x6EDA;&#x52A8;&#x66F4;&#x65B0;&#x3001;&#x8D44;&#x6E90;&#x76D1;&#x63A7;&#x7B49;&#x7B49;&#x3002;</p>
<h4 id="kubernetes-&#x7279;&#x70B9;"><strong>Kubernetes &#x7279;&#x70B9;</strong></h4>
<ol>
<li><p>&#x53EF;&#x79FB;&#x690D;&#xFF0C;&#x652F;&#x6301;&#x5728;&#x516C;&#x6709;&#x4E91;&#xFF0C;&#x79C1;&#x6709;&#x4E91;&#xFF0C;&#x6DF7;&#x5408;&#x4E91;&#x4E2D;&#x8FD0;&#x884C;&#xFF1B;</p>
</li>
<li><p>&#x53EF;&#x6269;&#x5C55;&#xFF0C;K8s &#x91C7;&#x7528;&#x6A21;&#x5757;&#x5316;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x63D2;&#x4EF6;&#x5316;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x53EF;&#x6302;&#x8F7D;&#xFF0C;&#x53EF;&#x7EC4;&#x5408;&#xFF1B;</p>
</li>
<li><p>&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x652F;&#x6301;&#x670D;&#x52A1;&#x7684;&#x81EA;&#x52A8;&#x90E8;&#x7F72;&#xFF0C;&#x81EA;&#x52A8;&#x91CD;&#x542F;&#xFF0C;&#x81EA;&#x52A8;&#x590D;&#x5236;&#xFF0C;&#x81EA;&#x52A8;&#x4F38;&#x7F29;&#x3002;</p>
</li>
</ol>
<h4 id="kubernetes-&#x91CD;&#x8981;&#x6982;&#x5FF5;"><strong>Kubernetes &#x91CD;&#x8981;&#x6982;&#x5FF5;</strong></h4>
<p>K8s &#x4E2D;&#x7684;&#x6982;&#x5FF5;&#x975E;&#x5E38;&#x7684;&#x591A;&#xFF0C;&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x4E86;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x51E0;&#x4E2A;&#x3002;</p>
<p>K8s &#x662F;&#x5BB9;&#x5668;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x5BB9;&#x5668;&#x9996;&#x5148;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;K8s &#x9996;&#x5148;&#x8981;&#x7BA1;&#x7406;&#x5BBF;&#x4E3B;&#x673A;&#x96C6;&#x7FA4;&#xFF0C;K8s &#x5206;&#x4E3A; Master &#x8282;&#x70B9;&#x548C; Node &#x8282;&#x70B9;&#xFF0C;&#x4E5F;&#x53EB; Worker Node&#x3002;</p>
<p>Master &#x8D1F;&#x8D23;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#xFF0C;&#x7BA1;&#x7406; K8s &#x96C6;&#x7FA4;&#x3002;Master &#x534F;&#x8C03;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x884C;&#x4E3A;/&#x6D3B;&#x52A8;&#xFF0C;&#x4F8B;&#x5982;&#x5E94;&#x7528;&#x7684;&#x8FD0;&#x884C;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x66F4;&#x65B0;&#x7B49;&#x3002;</p>
<p>Node &#x8282;&#x70B9;&#x7528;&#x6765;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#x3002;Node &#x4E0A;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x591A;&#x4E2A; Pod&#xFF0C;Pod &#x662F; K8s &#x521B;&#x5EFA;&#x6216;&#x90E8;&#x7F72;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;Pod &#x4E2D;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x591A;&#x4E2A; Container&#xFF0C;&#x4E00;&#x4E2A; Container &#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x955C;&#x50CF;&#x3002;</p>
<p>Pod &#x4E2D;&#x7684; Container &#x5171;&#x4EAB;&#x7F51;&#x7EDC;&#x4E0E;&#x5B58;&#x50A8;&#x3002;</p>
<p>Service &#x662F; K8s &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x6982;&#x5FF5;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x4E0D;&#x540C;&#x7684; Pod &#x6DFB;&#x52A0;&#x6807;&#x7B7E;&#xFF0C;&#x6765;&#x5212;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684; Service&#x3002;</p>
<p>Deployment &#x8868;&#x793A;&#x7528;&#x6237;&#x5BF9; K8s &#x96C6;&#x7FA4;&#x7684;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x3002;</p>
<h4 id="kubernetes-&#x67B6;&#x6784;"><strong>Kubernetes &#x67B6;&#x6784;</strong></h4>
<p>&#x4E0B;&#x56FE;&#x662F;K8s&#x67B6;&#x6784;&#x56FE;&#xFF0C;&#x56FE;&#x5DE6;&#x4FA7;&#x7EFF;&#x8272;&#x7684;&#x6A21;&#x5757;&#x4EE3;&#x8868; Master &#x8282;&#x70B9;&#xFF0C;&#x53F3;&#x4FA7;&#x84DD;&#x8272;&#x7684;&#x6A21;&#x5757;&#x4EE3;&#x8868;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#x7684;Worker Node &#x8282;&#x70B9;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510003619.png?imageslim" alt=""></p>
<p>&#x5148;&#x6765;&#x770B; Master &#x8282;&#x70B9;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x7070;&#x8272;&#x7684;&#x90E8;&#x5206;&#x662F; Master &#x4E2D;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5176;&#x4E2D; API Server &#x662F;&#x7528;&#x6237;&#x5BF9; K8s &#x4E2D;&#x8D44;&#x6E90;&#x64CD;&#x4F5C;&#x7684;&#x552F;&#x4E00;&#x5165;&#x53E3;&#xFF0C;&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x3001;&#x7BA1;&#x7406;&#x90E8;&#x7F72;&#x72B6;&#x6001;&#x7B49;&#x90FD;&#x9700;&#x8981;&#x901A;&#x8FC7; api server &#x8FDB;&#x884C;&#x3002;API Server &#x63D0;&#x4F9B;&#x4E86;&#x8BA4;&#x8BC1;&#x3001;&#x6388;&#x6743;&#x3001;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x3001;API &#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x7B49;&#x673A;&#x5236;&#x3002;</p>
<p>Controller Manager &#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x96C6;&#x7FA4;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6BD4;&#x5982;&#x6545;&#x969C;&#x68C0;&#x6D4B;&#x3001;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x3001;&#x6EDA;&#x52A8;&#x66F4;&#x65B0;&#x7B49;&#xFF0C;Controller Manager &#x5305;&#x542B;&#x591A;&#x4E2A;&#x53EF;&#x4EE5;&#x6269;&#x5C55; Controller&#xFF0C;&#x4F8B;&#x5982; Node Controller &#x8D1F;&#x8D23;&#x521D;&#x59CB;&#x5316; Node &#x8282;&#x70B9;&#xFF0C;&#x83B7;&#x53D6;&#x8FD0;&#x884C;&#x4E2D;&#x7684; Node &#x4FE1;&#x606F;&#x3001;Route Controller &#x8D1F;&#x8D23;&#x914D;&#x7F6E;&#x96C6;&#x7FA4;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x3001;Service Controller &#x8D1F;&#x8D23;&#x76D1;&#x542C;&#x670D;&#x52A1;&#x521B;&#x5EFA;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x7B49;&#x4E8B;&#x4EF6;&#x6765;&#x8C03;&#x6574;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x4FE1;&#x606F;&#x7B49;&#x7B49;&#x3002;</p>
<p>Scheduler &#x8D1F;&#x8D23;&#x8D44;&#x6E90;&#x7684;&#x8C03;&#x5EA6;&#xFF0C;&#x6309;&#x7167;&#x9884;&#x5B9A;&#x7684;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x9009;&#x62E9;&#x54EA;&#x4E2A; Pod &#x8FD0;&#x884C;&#x5728;&#x54EA;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x56FE;&#x4E0B;&#x65B9;&#x7684;&#x7EFF;&#x8272;&#x6A21;&#x5757;&#x662F;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x7684;&#x72B6;&#x6001;&#x7684; etcd&#x3002;</p>
<p>&#x56FE;&#x6700;&#x5DE6;&#x4FA7;&#x7684; kubectl &#x662F;&#x7528;&#x4E8E;&#x8FD0;&#x884C; K8s &#x547D;&#x4EE4;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;kubectl &#x4E0E; API Server &#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x901A;&#x8FC7; API Server &#x4E0B;&#x53D1;&#x5BF9; K8s &#x96C6;&#x7FA4;&#x7684;&#x6307;&#x4EE4;&#x3002;</p>
<p>&#x518D;&#x6765;&#x770B;&#x56FE;&#x53F3;&#x4FA7;&#x7684; Worker Node&#x3002;&#x521A;&#x624D;&#x4ECB;&#x7ECD;&#x6982;&#x5FF5;&#x65F6;&#x63D0;&#x8FC7;&#xFF0C;Node &#x7528;&#x6765;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#xFF0C;&#x6240;&#x4EE5; Node &#x4E2D;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x662F; Docker&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x5BB9;&#x5668;&#x6280;&#x672F;&#xFF0C;&#x4F8B;&#x5982; Rkt&#x3002;</p>
<p>Node &#x4E2D;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x7531;&#x4E00;&#x4E2A; Pod &#x7EC4;&#x6210;&#xFF0C;&#x53EF;&#x4EE5;&#x628A; Pod &#x770B;&#x4F5C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A; Container &#x5BB9;&#x5668;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x5171;&#x540C;&#x534F;&#x4F5C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E9B;&#x534F;&#x4F5C;&#x7684;&#x955C;&#x50CF;&#x6253;&#x5305;&#x653E;&#x5728;&#x4E00;&#x4E2A; Pod &#x4E2D;&#xFF0C;&#x5171;&#x4EAB; Pod &#x7684;&#x5B58;&#x50A8;&#x548C;&#x7F51;&#x7EDC;&#x3002;&#x6BD4;&#x5982; istio &#x4E2D;&#x7684; Sidecar &#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x670D;&#x52A1;&#x7684; Pod &#x4E2D;&#x6CE8;&#x5165;&#x4E00;&#x4E2A; Sidecar &#x955C;&#x50CF;&#x6765;&#x5B9E;&#x73B0;&#x4E0E;&#x670D;&#x52A1; IP &#x7ED1;&#x5B9A;&#xFF0C;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x3002;</p>
<p>&#x770B;&#x5230;&#x53F3;&#x9762;&#x56FE;&#x4E2D;&#x7070;&#x8272;&#x7684;&#x4E24;&#x4E2A; Node &#x6A21;&#x5757;&#xFF0C;kubelet &#x8D1F;&#x8D23;&#x4E0E; Master &#x901A;&#x4FE1;&#xFF0C;&#x5B83;&#x5468;&#x671F;&#x6027;&#x5730;&#x8BBF;&#x95EE; APIcontroller &#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x548C;&#x62A5;&#x544A;&#x3001;&#x6267;&#x884C;&#x5BB9;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x7EF4;&#x62A4;&#x5BB9;&#x5668;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4E5F;&#x8D1F;&#x8D23; Volume&#xFF08;CVI&#xFF09;&#x548C;&#x7F51;&#x7EDC;&#xFF08;CNI&#xFF09;&#x7684;&#x7BA1;&#x7406;&#x3002;</p>
<p>kube-proxy &#x5904;&#x7406;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x548C;&#x6BCF;&#x4E2A;&#x5BB9;&#x5668;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6539;&#x53D8; iptables &#x89C4;&#x5219;&#x6765;&#x63A7;&#x5236;&#x5728;&#x5BB9;&#x5668;&#x4E0A;&#x7684; TCP &#x548C; UDP &#x5305;&#x3002;</p>
<p>K8s &#x628A;&#x6240;&#x6709;&#x88AB;&#x7BA1;&#x7406;&#x7684;&#x8D44;&#x6E90;&#x770B;&#x4F5C;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x8D44;&#x6E90;&#x7684;&#x7BA1;&#x7406;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x5BF9;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x7684;&#x8BBE;&#x7F6E;&#x3002;K8s &#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x914D;&#x7F6E;&#x91C7;&#x7528; YAML &#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#x3002;K8s &#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x6982;&#x5FF5;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x56DB;&#x7C7B;&#xFF1A;</p>
<ul>
<li><p>&#x8D44;&#x6E90;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982; Pod&#x3001;Job&#xFF1B;</p>
</li>
<li><p>&#x914D;&#x7F6E;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982; Node&#x3001;Namespace&#x3001;Service&#xFF1B;</p>
</li>
<li><p>&#x5B58;&#x50A8;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982; Volume&#x3001;PresidentVolume&#xFF1B;</p>
</li>
<li><p>&#x7B56;&#x7565;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982; SecurityContext&#x3001;ResourceQuota&#x3001;LimitRange &#x7B49;&#x7B49;&#x3002;</p>
</li>
</ul>
<p>&#x5982;&#x679C;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x8FDB;&#x884C;&#x7EC3;&#x4E60;&#x3002;&#x6BD4;&#x5982;&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x673A;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528; Minikube &#x6765;&#x90E8;&#x7F72; K8s &#x8FDB;&#x884C;&#x7EC3;&#x4E60;&#x3002;</p>
<hr>
<h3 id="&#x8003;&#x5BDF;&#x70B9;&#x4E0E;&#x52A0;&#x5206;&#x9879;">&#x8003;&#x5BDF;&#x70B9;&#x4E0E;&#x52A0;&#x5206;&#x9879;</h3>
<h4 id="&#x8003;&#x5BDF;&#x70B9;"><strong>&#x8003;&#x5BDF;&#x70B9;</strong></h4>
<p>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E3B;&#x8981;&#x770B;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x548C;&#x53D1;&#x5C55;&#x6F5C;&#x529B;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x8003;&#x5BDF;&#x70B9;&#x6709;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A; </p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#xFF0C;&#x8981;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x3002;&#x6BD4;&#x5982;&#x7CFB;&#x7EDF;&#x53EF;&#x7528;&#x6027;&#x3001;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x6545;&#x969C;&#x7684;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x7194;&#x65AD;&#x3001;&#x5BB9;&#x707E;&#x3001;&#x6D41;&#x91CF;&#x8FC1;&#x79FB;&#x3001;&#x591A;&#x673A;&#x623F;&#x591A;&#x6D3B;&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x89E3;&#x8026;&#x5408;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#xFF0C;&#x8981;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4F18;&#x5316;&#x7684;&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5E76;&#x884C;&#x3001;&#x5F02;&#x6B65;&#x3001;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x548C;&#x5782;&#x76F4;&#x6269;&#x5C55;&#x3001;&#x9884;&#x5904;&#x7406;&#x3001;&#x7F13;&#x5B58;&#x3001;&#x5206;&#x533A;&#xFF08;Sharding&#xFF09;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#xFF0C;&#x4F1A;&#x8003;&#x5BDF;&#x5BF9;&#x8D1F;&#x8D23;&#x7684;&#x5DE5;&#x4F5C;&#x4E86;&#x89E3;&#x7A0B;&#x5EA6;&#x3001;&#x662F;&#x5426;&#x6709;&#x8D23;&#x4EFB;&#x2F3C;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;&#x7684;&#x670D;&#x52A1;&#x7684;&#x90E8;&#x7F72;&#x89C4;&#x6A21;&#xFF0C;&#x8C03;&#x7528;&#x91CF;&#x7EA7;&#x90FD;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x8D23;&#x4EFB;&#x5FC3;&#x5462;&#xFF1F;</p>
</li>
<li><p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#x3002;</p>
</li>
</ol>
<h4 id="&#x52A0;&#x5206;&#x9879;"><strong>&#x52A0;&#x5206;&#x9879;</strong></h4>
<p>&#x52A0;&#x5206;&#x70B9;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#x8868;&#x73B0;&#x51FA;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x548C;&#x601D;&#x8003;&#x80FD;&#x529B;&#x3002; </p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x4E86;&#x89E3;&#x4E1A;&#x754C;&#x6700;&#x65B0;&#x8D8B;&#x52BF;&#xFF0C;&#x6BD4;&#x5982; Service Mesh &#x7684;&#x601D;&#x8DEF;&#x548C;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x4E2A;&#xFF0C;&#x5728;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E0D;&#x540C;&#x65B9;&#x6848;&#x7684;&#x9009;&#x578B;&#x6216;&#x5BF9;&#x6BD4;&#x4F1A;&#x66F4;&#x597D;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x65F6;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x6848;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x540C;&#x6B65;&#x65B9;&#x6848;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5F02;&#x6B65;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6848;&#x5404;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x5408;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x3001;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x3001;&#x8BF7;&#x6C42;&#x91CF;&#x7EA7; &#x9009;&#x62E9;&#x4E86;&#x67D0;&#x4E00;&#x79CD;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x9762;&#x8BD5;&#x6280;&#x5DE7;">&#x9762;&#x8BD5;&#x6280;&#x5DE7;</h3>
<h4 id="&#x4ECB;&#x7ECD;&#x9879;&#x76EE;"><strong>&#x4ECB;&#x7ECD;&#x9879;&#x76EE;</strong></h4>
<p>&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x9047;&#x5230;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x89C1;&#x8FC7;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5728;&#x91CC;&#x8868;&#x73B0;&#x7684;&#x5E76;&#x4E0D;&#x597D;&#xFF1A;&#x8981;&#x4E48;&#x8BB2;&#x4E0D;&#x6E05;&#x695A;&#x9879;&#x76EE;&#x7684;&#x7ED3;&#x6784;&#x4E0E;&#x4EA4;&#x4E92;&#x6D41;&#x7A0B;&#xFF1B;&#x8981;&#x4E48;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#xFF1B;&#x8981;&#x4E48;&#x6CA1;&#x6709;&#x601D;&#x8003;&#x8FC7;&#x9879;&#x76EE;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E0D;&#x4EC5;&#x662F;&#x9488;&#x5BF9;&#x9762;&#x8BD5;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x6211;&#x4EEC;&#x66F4;&#x5E94;&#x8BE5;&#x641E;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5DE5;&#x4F5C; 1&#xFF5E;3 &#x5E74;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x3002; </p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x5730;&#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;&#x7684;&#x9879;&#x76EE;&#xFF1F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x56FE;&#x4E2D;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x662F;&#x6839;&#x636E;&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#x603B;&#x7ED3;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x63D0;&#x793A;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x8981;&#x91CD;&#x70B9;&#x4F53;&#x73B0;&#x54EA;&#x4E9B;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510003907.png?imageslim" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8981;&#x7B80;&#x5355;&#x4EA4;&#x4EE3;&#x9879;&#x76EE;&#x80CC;&#x666F;&#xFF0C;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x8FDB;&#x5165;&#x5230;&#x9879;&#x76EE;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x3002;&#x4E00;&#x822C;&#x91C7;&#x7528; STAR &#x6CD5;&#x5219;&#x6765;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#xFF1A;</p>
<ul>
<li><p>Situation &#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x80CC;&#x666F;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x7814;&#x53D1;&#x4E00;&#x4E2A;&#x77ED;&#x89C6;&#x9891; APP&#xFF0C;&#x914D;&#x5408;&#x516C;&#x53F8;&#x4E3B;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x4EA4;&#x53C9;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x91CF;&#x4E0E;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF1B;</p>
</li>
<li><p>Task &#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x5728;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x8D1F;&#x8D23;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x7814;&#x53D1;&#xFF1B;</p>
</li>
<li><p>Action &#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x65F6;&#x7528;&#x4E86; 2 &#x5468;&#x65F6;&#x95F4;&#x505A;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;4 &#x5468;&#x65F6;&#x95F4;&#x505A;&#x7814;&#x53D1;&#xFF0C;2 &#x5468;&#x65F6;&#x95F4;&#x6D4B;&#x8BD5;&#x4E0A;&#x7EBF;&#xFF1B;</p>
</li>
<li><p>Result &#x4ECB;&#x7ECD;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x5BB9;&#x6613;&#x5FFD;&#x89C6;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6BD4;&#x5982;&#x9879;&#x76EE;&#x4E0A;&#x7EBF;&#x540E; 2 &#x4E2A;&#x6708;&#x7528;&#x6237;&#x6570; 100w&#xFF0C;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x63A5;&#x53E3;&#x603B;&#x91CF;&#x5CF0;&#x503C; 50000qps&#xFF0C;&#x4E3B;&#x8981;&#x63A5;&#x53E3;&#x670D;&#x52A1; SLA p99 &#x5C0F;&#x4E8E; 50ms&#x3002;</p>
</li>
</ul>
<p>&#x6CE8;&#x610F;&#x80CC;&#x666F;&#x4ECB;&#x7ECD;&#x662F;&#x4E3A;&#x540E;&#x9762;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x505A;&#x94FA;&#x57AB;&#xFF0C;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x4F60;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x6700;&#x60F3;&#x4E86;&#x89E3;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x52A1;&#x5FC5;&#x8981;&#x7ED3;&#x5408;&#x67B6;&#x6784;&#x56FE;&#x3001;&#x4EA4;&#x4E92;&#x6D41;&#x7A0B;&#x56FE;&#x6765;&#x4ECB;&#x7ECD;&#xFF0C;&#x907F;&#x514D;&#x5BF9;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x95EE;&#x9898;&#x7406;&#x89E3;&#x6B67;&#x4E49;&#x3002;&#x67B6;&#x6784;&#x56FE;&#x8981;&#x6CE8;&#x610F;&#x8FB9;&#x754C;&#x6E05;&#x6670;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x4E0E;&#x5176;&#x4ED6;&#x4F9D;&#x8D56;&#x7684;&#x5916;&#x90E8;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x670D;&#x52A1;&#x5185;&#x90E8;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x8FB9;&#x754C;&#x90FD;&#x8981;&#x63CF;&#x8FF0;&#x6E05;&#x6670;&#x3002;&#x8FD9;&#x6709;&#x5229;&#x4E8E;&#x4F60;&#x4E0B;&#x4E00;&#x6B65;&#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x8981;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x5BF9;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x4ECB;&#x7ECD;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x5177;&#x4F53;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x4F8B;&#x5982;&#x6211;&#x8BBE;&#x8BA1;&#x4E86;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#xFF0C;&#x6216;&#x8005;&#x6211;&#x5B9E;&#x73B0;&#x4E86;&#x67B6;&#x6784;&#x56FE;&#x4E2D;&#x7684;&#x67D0;&#x51E0;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x4F60;&#x9762;&#x8BD5;&#x7684;&#x7EDD;&#x5BF9;&#x52A0;&#x5206;&#x70B9;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x628A;&#x63E1;&#x4F4F;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8981;&#x7A81;&#x51FA;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x505A;&#x7684;&#x6700;&#x6709;&#x6311;&#x6218;&#x7684;&#x70B9;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3001;&#x6216;&#x8005;&#x72EC;&#x7279;&#x6709;&#x6548;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x6570;&#x636E;&#x91CF;&#x975E;&#x5E38;&#x5927;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x4F18;&#x5316; Redis &#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF0C;&#x51CF;&#x5C11;&#x4E86; 70% &#x7684; Redis &#x4F7F;&#x7528;&#x5BB9;&#x91CF;&#xFF1B;&#x6BD4;&#x5982;&#x5BF9;&#x67E5;&#x8BE2;&#x63A5;&#x53E3;&#x5E94;&#x7528;&#x53CC;&#x53D1;&#x529F;&#x80FD;&#x4F7F; p999 &#x964D;&#x4F4E;&#x4E86; 60%&#xFF1B;&#x518D;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x4E86; Trace &#x529F;&#x80FD;&#x6765;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x8981;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x7684;&#x5B9E;&#x73B0;&#x80FD;&#x529B;&#x4E0E;&#x4EAE;&#x70B9;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x8981;&#x4E3A;&#x7B2C;&#x4E09;&#x6B65;&#x4ECB;&#x7ECD;&#x7684;&#x4F18;&#x79C0;&#x67B6;&#x6784;&#x6216;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x63D0;&#x4F9B;&#x8BC1;&#x660E;&#xFF0C;&#x6BD4;&#x5982;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x4E86;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E2D;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#x5316;&#x6765;&#x63D0;&#x9AD8;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x90A3;&#x8FD9;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x7CFB;&#x7EDF;&#x4E0A;&#x7EBF;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x6A21;&#x5757;&#x5316;&#x65B9;&#x5F0F;&#x652F;&#x6301;&#x4E86; 7 &#x4E2A;&#x65B0;&#x4E1A;&#x52A1;&#x7684;&#x63A5;&#x5165;&#x6765;&#x4F53;&#x73B0;&#x4F60;&#x8BBE;&#x8BA1;&#x7684;&#x67B6;&#x6784;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x662F;&#x53EF;&#x4EE5;&#x91CF;&#x5316;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x7528;&#x6027;&#x80FD;&#x5927;&#x5E45;&#x63D0;&#x5347;&#xFF0C;&#x6781;&#x5927;&#x63D0;&#x9AD8;&#x7075;&#x6D3B;&#x6027;&#x8FD9;&#x7C7B;&#x5F88;&#x865A;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x597D;&#x4E00;&#x70B9;&#x7684;&#x8868;&#x8FF0;&#x53EF;&#x4EE5;&#x662F;&#x8FD9;&#x6837;&#xFF1A;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#xFF0C;&#x5BF9;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x7684;&#x8C03;&#x7528;&#x8BF7;&#x6C42;&#x4ECE; 7000qps &#x964D;&#x4F4E;&#x5230; 600qps&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x8981;&#x4F53;&#x73B0;&#x51FA;&#x4F60;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x638C;&#x63E1;&#x80FD;&#x529B;&#x548C;&#x4E86;&#x89E3;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x601D;&#x8003;&#x9879;&#x76EE;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x7684;&#x70B9;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x73B0;&#x5728;&#x9879;&#x76EE; QPS &#x4E0D;&#x9AD8;&#xFF0C;&#x67D0;&#x4E9B;&#x4EFB;&#x52A1;&#x662F;&#x540C;&#x6B65;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x5904;&#x7406;&#x6B65;&#x9AA4;&#x662F;&#x53EF;&#x4EE5;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x91CF;&#x7EA7;&#x589E;&#x52A0;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; kafka &#x8FDB;&#x884C;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x3002;&#x5904;&#x7406;&#x65F6;&#x8FD8;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x6D88;&#x606F;&#x91CD;&#x590D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x5904;&#x7406;&#x903B;&#x8F91;&#x8BBE;&#x8BA1;&#x6210;&#x5E42;&#x7B49;&#x6027;&#x7684;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x8981;&#x4F53;&#x73B0;&#x4F60;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x601D;&#x8003;&#x4EE5;&#x53CA;&#x603B;&#x7ED3;&#x53CD;&#x601D;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4F5C;&#x4E3A;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4F4D;&#x6309;&#x7167;&#x4E0A;&#x9762; 5 &#x4E2A;&#x65B9;&#x5411;&#x6765;&#x4EA4;&#x6D41;&#x7684;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x975E;&#x5E38;&#x770B;&#x597D;&#x4ED6;&#x3002;</p>
<hr>
<h3 id="&#x9762;&#x8BD5;&#x6280;&#x5DE7;">&#x9762;&#x8BD5;&#x6280;&#x5DE7;</h3>
<p>&#x518D;&#x6765;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x5907;&#x6218;&#x9762;&#x8BD5;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x80AF;&#x5B9A;&#x8981;&#x63D0;&#x524D;&#x601D;&#x8003;&#x3001;&#x63D0;&#x524D;&#x51C6;&#x5907;&#x3002;</li>
</ol>
<p>&#x50CF;&#x9879;&#x76EE;&#x67B6;&#x6784;&#x56FE;&#x600E;&#x4E48;&#x753B;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x5230;&#x5E95;&#x54EA;&#x4E2A;&#x8BBE;&#x8BA1;&#x6700;&#x6709;&#x4EAE;&#x70B9;&#xFF0C;&#x9879;&#x76EE;&#x8FD8;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#x7684;&#x5730;&#x65B9;&#x7B49;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x627E;&#x5230;&#x6BD4;&#x8F83;&#x7406;&#x60F3;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x5728;&#x9762;&#x8BD5;&#x73B0;&#x573A;&#x4E34;&#x65F6;&#x56DE;&#x7B54;&#x96BE;&#x5EA6;&#x975E;&#x5E38;&#x5927;&#x3002;&#x4E00;&#x5B9A;&#x8981;&#x6839;&#x636E;&#x6211;&#x524D;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x63D0;&#x524D;&#x51C6;&#x5907;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x8981;&#x8BB0;&#x4F4F;&#x9879;&#x76EE;&#x5728;&#x7CBE;&#x4E0D;&#x5728;&#x591A;&#x3002;</li>
</ol>
<p>&#x6709;&#x7684;&#x4EBA;&#x5728;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x4F1A;&#x629B;&#x51FA;&#x597D;&#x51E0;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x7684;&#x90FD;&#x5F88;&#x6F66;&#x8349;&#x3002;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x662F;&#x60F3;&#x901A;&#x8FC7;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x6765;&#x8003;&#x5BDF;&#x4F60;&#x7684;&#x5404;&#x65B9;&#x9762;&#x80FD;&#x529B;&#xFF0C;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#x7684;&#x9879;&#x76EE;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x4E00;&#x5B9A;&#x8981;&#x9009;&#x4F60;&#x6700;&#x4E86;&#x89E3;&#x3001;&#x6700;&#x80FD;&#x4EE3;&#x8868;&#x4F60;&#x80FD;&#x529B;&#x7684;&#x6765;&#x4ECB;&#x7ECD;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E09;&#x70B9;&#xFF0C;&#x6211;&#x4E86;&#x89E3;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x7684;&#x3002;</li>
</ol>
<p>&#x6709;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x673A;&#x9047;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6CA1;&#x6709;&#x8D1F;&#x8D23;&#x8FC7;&#x91CD;&#x70B9;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4E0D;&#x8FC7;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x8003;&#x5BDF;&#x70B9;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x767D;&#x767D;&#x5728;&#x8FD9;&#x91CC;&#x4E22;&#x5206;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x591A;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5176;&#x4ED6;&#x540C;&#x4E8B;&#x6216;&#x56E2;&#x961F;&#x8D1F;&#x8D23;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x80FD;&#x628A;&#x7EC6;&#x8282;&#x641E;&#x660E;&#x767D;&#xFF0C;&#x628A;&#x67B6;&#x6784;&#x7406;&#x89E3;&#x900F;&#xFF0C;&#x90A3;&#x4E48;&#x77E5;&#x8BC6;&#x5C31;&#x662F;&#x4F60;&#x7684;&#xFF0C;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x56DB;&#x70B9;&#xFF0C;&#x8981;&#x91CD;&#x70B9;&#x4F53;&#x73B0;&#x5BF9;&#x67B6;&#x6784;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x601D;&#x8003;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4F1A;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x89C9;&#x5F97;&#x4F60;&#x4F1A;&#x5F88;&#x6709;&#x6F5C;&#x529B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4ECB;&#x7ECD;&#x9879;&#x76EE;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x65F6;&#x505A;&#x9002;&#x5F53;&#x7684;&#x5EF6;&#x4F38;&#x3002;&#x4F8B;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#xFF1A;&#x5728;&#x6211;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x4F4E;&#x6982;&#x7387;&#x7684;&#x6D88;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x4E8E;&#x6027;&#x80FD;&#x4F18;&#x5148;&#x8003;&#x8651;&#xFF0C;&#x53BB;&#x6389;&#x4E86; Kafka &#x7684; ACK &#x5E94;&#x7B54;&#x3002;&#x5982;&#x679C;&#x662F;&#x4E25;&#x683C;&#x8981;&#x6C42;&#x4E0D;&#x4E22;&#x6D88;&#x606F;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4F1A;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5E94;&#x7B54;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x6700;&#x9AD8;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x6027;&#x7B49;&#x7EA7;&#x3002;</p>
<hr>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x300A;32&#x4E2A;Java&#x9762;&#x8BD5;&#x5FC5;&#x8003;&#x70B9;&#x300B;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x7ED3;&#x675F;&#xFF0C;&#x611F;&#x8C22;&#x652F;&#x6301;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第11节：MySQL调优与最佳实践.html" class="navigation navigation-prev " aria-label="Previous page: 第11节：MySQL调优与最佳实践">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="彩蛋：技术人行走职场的建议.html" class="navigation navigation-next " aria-label="Next page: 彩蛋：技术人行走职场的建议">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第12节：架构的演进之路与前言技术","level":"1.3.13","depth":2,"next":{"title":"彩蛋：技术人行走职场的建议","level":"1.3.14","depth":2,"path":"32个Java面试必考点/彩蛋：技术人行走职场的建议.md","ref":"32个Java面试必考点/彩蛋：技术人行走职场的建议.md","articles":[]},"previous":{"title":"第11节：MySQL调优与最佳实践","level":"1.3.12","depth":2,"path":"32个Java面试必考点/第11节：MySQL调优与最佳实践.md","ref":"32个Java面试必考点/第11节：MySQL调优与最佳实践.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","mtime":"2021-05-09T16:48:39.100Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

