
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第11节：MySQL调优与最佳实践 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第12节：架构的演进之路与前言技术.html" />
    
    
    <link rel="prev" href="第10节：消息队列Kafka架构与原理.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第11节：MySQL调优与最佳实践</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[toc]</p>
<h2 id="mysql&#x8C03;&#x4F18;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;">MySQL&#x8C03;&#x4F18;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h2>
<h3 id="&#x8BE6;&#x89E3;-mysql">&#x8BE6;&#x89E3; MySQL</h3>
<p>&#x4E0B;&#x9762;&#x6765;&#x5B66;&#x4E60;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x4F7F;&#x7528;&#x6700;&#x4E3A;&#x5E7F;&#x6CDB;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93; MySQL&#xFF0C;&#x5B83;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x7ED3;&#x6784;&#x56FE;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510000920.png?imageslim" alt=""></p>
<h4 id="&#x5E38;&#x7528;-sql-&#x8BED;&#x53E5;"><strong>&#x5E38;&#x7528; SQL &#x8BED;&#x53E5;</strong></h4>
<p>&#x5BF9;&#x4E8E;&#x624B;&#x5199;&#x5E38;&#x7528; SQL &#x8BED;&#x53E5;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x6B8A;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x6839;&#x636E;&#x6240;&#x5217;&#x7684;&#x8BED;&#x53E5;&#x7C7B;&#x578B;&#x591A;&#x505A;&#x4E00;&#x4E9B;&#x7EC3;&#x4E60;&#x5C31;&#x597D;&#x3002;</p>
<h4 id="&#x6570;&#x636E;&#x7C7B;&#x578B;"><strong>&#x6570;&#x636E;&#x7C7B;&#x578B;</strong></h4>
<p>&#x8981;&#x77E5;&#x9053;MySQL&#x90FD;&#x63D0;&#x4F9B;&#x54EA;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x3002;&#x53EF;&#x6309;&#x7ED9;&#x51FA;&#x7684;&#x5206;&#x7C7B;&#x8FDB;&#x884C;&#x8BB0;&#x5FC6;&#xFF0C;&#x4E0D;&#x4E00;&#x4E00;&#x7F57;&#x5217;&#x3002;</p>
<h4 id="&#x5F15;&#x64CE;"><strong>&#x5F15;&#x64CE;</strong></h4>
<p>&#x4ECB;&#x7ECD; MySQL &#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x3002;</p>
<ul>
<li><p>MyISAM &#x662F; MySQL &#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#x662F;&#x652F;&#x6301;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x4E0D;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x3001;&#x4F7F;&#x7528;&#x8868;&#x7EA7;&#x9501;&#x3002;</p>
</li>
<li><p>InnoDB &#x5728; 5.5 &#x7248;&#x672C;&#x540E;&#x6210;&#x4E3A;&#x4E86; MySQL &#x7684;&#x9ED8;&#x8BA4;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x7279;&#x70B9;&#x662F;&#x652F;&#x6301; ACID &#x4E8B;&#x52A1;&#x3001;&#x652F;&#x6301;&#x5916;&#x952E;&#x3001;&#x652F;&#x6301;&#x884C;&#x7EA7;&#x9501;&#x63D0;&#x9AD8;&#x4E86;&#x5E76;&#x53D1;&#x6548;&#x7387;&#x3002;</p>
</li>
<li><p>TokuDB &#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x53D1;&#x7684;&#x5F00;&#x6E90;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x6709;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#x5199;&#x901F;&#x5EA6;&#xFF0C;&#x652F;&#x6301;&#x6570;&#x636E;&#x7684;&#x538B;&#x7F29;&#x5B58;&#x50A8;&#x3001;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x6DFB;&#x52A0;&#x7D22;&#x5F15;&#x800C;&#x4E0D;&#x5F71;&#x54CD;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x538B;&#x7F29;&#x7684;&#x539F;&#x56E0;&#xFF0C;TokuDB &#x975E;&#x5E38;&#x9002;&#x5408;&#x8BBF;&#x95EE;&#x9891;&#x7387;&#x4E0D;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x6216;&#x5386;&#x53F2;&#x6570;&#x636E;&#x5F52;&#x6863;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x5927;&#x91CF;&#x8BFB;&#x53D6;&#x7684;&#x573A;&#x666F;&#x3002;</p>
</li>
</ul>
<h4 id="&#x9501;"><strong>&#x9501;</strong></h4>
<p>MySQL &#x4E2D;&#x7684;&#x9501;&#xFF0C;&#x4E0A;&#x9762;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#xFF0C;MyIASAM &#x4F7F;&#x7528;&#x8868;&#x7EA7;&#x9501;&#xFF0C;InnoDB &#x4F7F;&#x7528;&#x884C;&#x7EA7;&#x9501;&#x3002;</p>
<ul>
<li><p>&#x8868;&#x9501;&#x5F00;&#x9500;&#x5C0F;&#xFF0C;&#x52A0;&#x9501;&#x5FEB;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#xFF1B;&#x4F46;&#x662F;&#x9501;&#x7684;&#x7C92;&#x5EA6;&#x5927;&#xFF0C;&#x53D1;&#x751F;&#x9501;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x9AD8;&#xFF0C;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;</p>
</li>
<li><p>&#x884C;&#x7EA7;&#x9501;&#x5F00;&#x9500;&#x5927;&#xFF0C;&#x52A0;&#x9501;&#x6162;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6B7B;&#x9501;&#xFF0C;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x9501;&#x5B9A;&#x7C92;&#x5EA6;&#x6700;&#x5C0F;&#xFF0C;&#x53D1;&#x751F;&#x9501;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x4F4E;&#xFF0C;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;</p>
</li>
<li><p>&#x5171;&#x4EAB;&#x9501;&#x4E5F;&#x5C31;&#x662F;&#x8BFB;&#x9501;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5199;&#x3002;MySQL &#x53EF;&#x4EE5;&#x901A;&#x8FC7; lock in share mode &#x8BED;&#x53E5;&#x663E;&#x793A;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x9501;&#x3002;</p>
</li>
<li><p>&#x6392;&#x4ED6;&#x9501;&#x5C31;&#x662F;&#x5199;&#x9501;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x8BFB;&#x53D6;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5199;&#x3002;&#x5BF9;&#x4E8E; UPDATE&#x3001;DELETE &#x548C; INSERT &#x8BED;&#x53E5;&#xFF0C;InnoDB &#x4F1A;&#x81EA;&#x52A8;&#x7ED9;&#x6D89;&#x53CA;&#x7684;&#x6570;&#x636E;&#x96C6;&#x52A0;&#x6392;&#x4ED6;&#x9501;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528; select for update &#x663E;&#x793A;&#x4F7F;&#x7528;&#x6392;&#x4ED6;&#x9501;&#x3002;</p>
</li>
</ul>
<h4 id="&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x51FD;&#x6570;"><strong>&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x51FD;&#x6570;</strong></h4>
<p>MySQL &#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x91CD;&#x590D;&#x7F16;&#x5199;&#x76F8;&#x540C;&#x7684; SQL &#x8BED;&#x53E5;&#xFF0C;&#x5E76;&#x4E14;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x548C;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x5728; MySQL &#x670D;&#x52A1;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x66F4;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x51FD;&#x6570;&#x4E00;&#x822C;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x9488;&#x5BF9;&#x6027;&#x6BD4;&#x8F83;&#x5F3A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x7279;&#x6B8A;&#x7B56;&#x7565;&#x6C42;&#x548C;&#x7B49;&#x3002;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5305;&#x62EC;&#x4FEE;&#x6539;&#x8868;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x4FEE;&#x6539;&#x5168;&#x5C40;&#x6570;&#x636E;&#x5E93;&#x72B6;&#x6001;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E00;&#x822C;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x90E8;&#x5206;&#x6765;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x6765;&#x8C03;&#x7528;&#x3002;SQL &#x8BED;&#x53E5;&#x4E2D;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x3002;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E00;&#x822C;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x73B0;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4F1A;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x5E94;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x3002;</p>
<h4 id="&#x65B0;&#x7279;&#x6027;"><strong>&#x65B0;&#x7279;&#x6027;</strong></h4>
<p>&#x6B64;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x4E86;&#x89E3; MySQL8.0 &#x7684;&#x4E00;&#x4E9B;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li><p>&#x9ED8;&#x8BA4;&#x5B57;&#x7B26;&#x96C6;&#x683C;&#x5F0F;&#x6539;&#x4E3A;&#x4E86; UTF-8&#xFF1B;</p>
</li>
<li><p>&#x589E;&#x52A0;&#x4E86;&#x9690;&#x85CF;&#x7D22;&#x5F15;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x9690;&#x85CF;&#x540E;&#x7684;&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x88AB;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x7528;&#x4E8E;&#x6027;&#x80FD;&#x8C03;&#x8BD5;&#xFF1B;</p>
</li>
<li><p>&#x652F;&#x6301;&#x4E86;&#x901A;&#x7528;&#x8868;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F7F;&#x590D;&#x6742;&#x67E5;&#x8BE2;&#x4E2D;&#x7684;&#x5D4C;&#x5165;&#x8868;&#x8BED;&#x53E5;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#xFF1B;</p>
</li>
<li><p>&#x65B0;&#x589E;&#x4E86;&#x7A97;&#x53E3;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x65B0;&#x7684;&#x67E5;&#x8BE2;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
</ul>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x7A97;&#x53E3;&#x51FD;&#x6570;&#x4E0E; SUM&#x3001;COUNT &#x7B49;&#x96C6;&#x5408;&#x51FD;&#x6570;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x5C06;&#x591A;&#x884C;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x5408;&#x5E76;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x7ED3;&#x679C;&#x653E;&#x5728;&#x591A;&#x884C;&#x4E2D;&#xFF0C;&#x5373;&#x7A97;&#x53E3;&#x51FD;&#x6570;&#x4E0D;&#x9700;&#x8981; GROUP BY&#x3002;</p>
<h4 id="&#x7D22;&#x5F15;"><strong>&#x7D22;&#x5F15;</strong></h4>
<p>&#x6765;&#x770B; MySQL &#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5927;&#x5E45;&#x589E;&#x52A0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67E5;&#x8BE2;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x3002;&#x4F46;&#x662F;&#x7D22;&#x5F15;&#x4E5F;&#x662F;&#x6709;&#x4EE3;&#x4EF7;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x6765;&#x4FDD;&#x5B58;&#x7D22;&#x5F15;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5BF9;&#x4E8E;&#x63D2;&#x5165;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x7B49;&#x64CD;&#x4F5C;&#x7531;&#x4E8E;&#x66F4;&#x65B0;&#x7D22;&#x5F15;&#x4F1A;&#x589E;&#x52A0;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x6B64;&#x7D22;&#x5F15;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7528;&#x5728;&#x8BFB;&#x591A;&#x5199;&#x5C11;&#x7684;&#x573A;&#x666F;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5B66;&#x4E60; MySQL &#x7D22;&#x5F15;&#x7C7B;&#x578B;&#x3002;</p>
<ul>
<li><p>&#x552F;&#x4E00;&#x7D22;&#x5F15;&#xFF0C;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x7A7A;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x7D22;&#x5F15;&#x4E00;&#x822C;&#x7528;&#x6765;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x4FDD;&#x5B58;&#x8D26;&#x6237;&#x4FE1;&#x606F;&#x7684;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7684; ID &#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x552F;&#x4E00;&#xFF0C;&#x5982;&#x679C;&#x91CD;&#x590D;&#x63D2;&#x5165;&#x76F8;&#x540C;&#x7684;&#x8D26;&#x6237; ID &#x65F6;  MySQL &#x8FD4;&#x56DE;&#x5F02;&#x5E38;&#x3002;</p>
</li>
<li><p>&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x7A7A;&#x503C;&#x3002;</p>
</li>
<li><p>&#x666E;&#x901A;&#x7D22;&#x5F15;&#xFF0C;&#x4E0E;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x5B58;&#x5728;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;&#x4F8B;&#x5982;&#x5B66;&#x751F;&#x7684;&#x6210;&#x7EE9;&#x8868;&#xFF0C;&#x5404;&#x4E2A;&#x5B66;&#x79D1;&#x7684;&#x5206;&#x6570;&#x662F;&#x5141;&#x8BB8;&#x91CD;&#x590D;&#x7684;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7D22;&#x5F15;&#x3002;</p>
</li>
<li><p>&#x8054;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x5C31;&#x662F;&#x7531;&#x591A;&#x4E2A;&#x5217;&#x5171;&#x540C;&#x7EC4;&#x6210;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x4E00;&#x4E2A;&#x8868;&#x4E2D;&#x542B;&#x6709;&#x591A;&#x4E2A;&#x5355;&#x5217;&#x7684;&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x662F;&#x8054;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x8054;&#x5408;&#x7D22;&#x5F15;&#x662F;&#x5BF9;&#x591A;&#x4E2A;&#x5217;&#x5B57;&#x6BB5;&#x6309;&#x987A;&#x5E8F;&#x5171;&#x540C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x3002;&#x5E94;&#x7528;&#x8054;&#x5408;&#x7D22;&#x5F15;&#x65F6;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x6700;&#x5DE6;&#x539F;&#x5219;&#xFF0C;&#x5C31;&#x662F; where &#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x4E0E;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x8FDB;&#x884C;&#x5339;&#x914D;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x8868;&#xFF0C;&#x7528;&#x59D3;&#x540D;&#x548C;&#x5E74;&#x9F84;&#x7EC4;&#x6210;&#x4E86;&#x8054;&#x5408;&#x7D22;&#x5F15;&#xFF0C;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x662F;&#x201C;&#x59D3;&#x540D;&#x7B49;&#x4E8E;&#x5F20;&#x4E09;&#x201C;&#xFF0C;&#x90A3;&#x4E48;&#x6EE1;&#x8DB3;&#x6700;&#x5DE6;&#x539F;&#x5219;&#xFF1B;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x662F;&#x201C;&#x5E74;&#x9F84;&#x5927;&#x4E8E; 20&#x201C;&#xFF0C;&#x7531;&#x4E8E;&#x7D22;&#x5F15;&#x4E2D;&#x6700;&#x5DE6;&#x7684;&#x5B57;&#x6BB5;&#x662F;&#x59D3;&#x540D;&#x4E0D;&#x662F;&#x5E74;&#x9F84;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x3002;</p>
</li>
<li><p>&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x524D;&#x9762;&#x63D0;&#x5230;&#x4E86;&#xFF0C;MyISAM &#x5F15;&#x64CE;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x5728; 5.6 &#x7248;&#x672C;&#x540E; InnoDB &#x5F15;&#x64CE;&#x4E5F;&#x652F;&#x6301;&#x4E86;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x5E76;&#x4E14;&#x5728; 5.7.6 &#x7248;&#x672C;&#x540E;&#x652F;&#x6301;&#x4E86;&#x4E2D;&#x6587;&#x7D22;&#x5F15;&#x3002;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x53EA;&#x80FD;&#x5728; CHAR&#x3001;VARCHAR&#x3001;TEXT &#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x5E95;&#x5C42;&#x4F7F;&#x7528;&#x5012;&#x6392;&#x7D22;&#x5F15;&#x5B9E;&#x73B0;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x5BF9;&#x4E8E;&#x5927;&#x6570;&#x636E;&#x91CF;&#x7684;&#x8868;&#xFF0C;&#x751F;&#x6210;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x4F1A;&#x975E;&#x5E38;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x4E5F;&#x975E;&#x5E38;&#x6D88;&#x8017;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;</p>
</li>
</ul>
<p>&#x7136;&#x540E;&#x6765;&#x770B;&#x7D22;&#x5F15;&#x7684;&#x5B9E;&#x73B0;&#x3002; </p>
<ul>
<li><p>B+ &#x6811;&#x5B9E;&#x73B0;&#xFF0C;B+ &#x6811;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7528;&#x4F5C; &gt; &#x6216; &lt; &#x8FD9;&#x6837;&#x7684;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#xFF0C;&#x662F; MySQL &#x4E2D;&#x6700;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x7D22;&#x5F15;&#x5B9E;&#x73B0;&#x3002; </p>
</li>
<li><p>R-Tree &#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x5730;&#x7406;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7A7A;&#x95F4;&#x7D22;&#x5F15;&#x3002;&#x4E0D;&#x8FC7;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x5C11;&#x3002; </p>
</li>
<li><p>Hash &#x662F;&#x4F7F;&#x7528;&#x6563;&#x5217;&#x8868;&#x6765;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#xFF0C;Hash &#x65B9;&#x5F0F;&#x4E0D;&#x50CF; B-Tree &#x90A3;&#x6837;&#x9700;&#x8981;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#x624D;&#x80FD;&#x5B9A;&#x4F4D;&#x5230;&#x8BB0;&#x5F55;&#xFF0C;&#x56E0;&#x6B64; Hash &#x7D22;&#x5F15;&#x7684;&#x6548;&#x7387;&#x9AD8;&#x4E8E; B-Tree&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x652F;&#x6301;&#x8303;&#x56F4;&#x67E5;&#x627E;&#x548C;&#x6392;&#x5E8F;&#x7B49;&#x529F;&#x80FD;&#x3002;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x4E5F;&#x6BD4;&#x8F83;&#x5C11;&#x3002; </p>
</li>
<li><p>FullText &#x5C31;&#x662F;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5168;&#x6587;&#x7D22;&#x5F15;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x8BB0;&#x5F55;&#x5173;&#x952E;&#x5B57;&#x4E0E;&#x5BF9;&#x5E94;&#x6587;&#x6863;&#x5173;&#x7CFB;&#x7684;&#x5012;&#x6392;&#x7D22;&#x5F15;&#x3002;</p>
</li>
</ul>
<hr>
<h3 id="&#x8C03;&#x4F18;">&#x8C03;&#x4F18;</h3>
<p>MySQL &#x7684;&#x8C03;&#x4F18;&#x4E5F;&#x662F;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x4E00;&#x9879;&#x6280;&#x80FD;&#xFF0C;&#x4E00;&#x822C; MySQL &#x8C03;&#x4F18;&#x6709;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x56DB;&#x4E2A;&#x7EAC;&#x5EA6;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510001428.png?imageslim" alt=""></p>
<ul>
<li><p>&#x7B2C;&#x4E00;&#x4E2A;&#x7EAC;&#x5EA6;&#x662F;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x3001;&#x8868;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x4EE5;&#x53CA;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x7EAC;&#x5EA6;&#x8FDB;&#x884C;&#x7684;&#x4F18;&#x5316;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x4E2A;&#x7EAC;&#x5EA6;&#x662F;&#x5BF9;&#x6211;&#x4EEC;&#x4E1A;&#x52A1;&#x4E2D;&#x4F7F;&#x7528;&#x7684; SQL &#x8BED;&#x53E5;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x8C03;&#x6574; where &#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x4E2A;&#x7EAC;&#x5EA6;&#x662F;&#x5BF9; MySQL &#x670D;&#x52A1;&#x7684;&#x914D;&#x7F6E;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x94FE;&#x63A5;&#x6570;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x5BF9;&#x7D22;&#x5F15;&#x7F13;&#x5B58;&#x3001;&#x67E5;&#x8BE2;&#x7F13;&#x5B58;&#x3001;&#x6392;&#x5E8F;&#x7F13;&#x5B58;&#x7B49;&#x5404;&#x79CD;&#x7F13;&#x5B58;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x56DB;&#x4E2A;&#x7EAC;&#x5EA6;&#x662F;&#x5BF9;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#x8C03;&#x6574;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x3001;&#x7981;&#x7528; swap&#x3001;&#x589E;&#x52A0;&#x5185;&#x5B58;&#x3001;&#x5347;&#x7EA7;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x7B49;&#x7B49;&#x3002;</p>
</li>
</ul>
<p>&#x8FD9;&#x56DB;&#x4E2A;&#x7EAC;&#x5EA6;&#x4ECE;&#x4F18;&#x5316;&#x7684;&#x6210;&#x672C;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F18;&#x5316;&#x6210;&#x672C;&#x9010;&#x6E10;&#x5347;&#x9AD8;&#xFF1B;&#x4ECE;&#x4F18;&#x5316;&#x6548;&#x679C;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#x4F18;&#x5316;&#x7684;&#x6548;&#x679C;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x7EAC;&#x5EA6;&#x4E0E;&#x4E1A;&#x52A1;&#x606F;&#x606F;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x638C;&#x63E1;&#xFF0C;&#x540E;&#x4E24;&#x4E2A;&#x7EAC;&#x5EA6;&#x66F4;&#x9002;&#x5408; DBA &#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#xFF0C;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x91CD;&#x70B9;&#x6765;&#x770B;&#x524D;&#x4E24;&#x4E2A;&#x7EAC;&#x5EA6;&#xFF0C;&#x8981;&#x70B9;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510001529.png?imageslim" alt=""></p>
<p>&#x5148;&#x770B;&#x5230;&#x56FE;&#x4E2D;&#x5DE6;&#x8FB9;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5173;&#x4E8E;&#x8868;&#x7ED3;&#x6784;&#x548C;&#x7D22;&#x5F15;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x5E94;&#x8BE5;&#x638C;&#x63E1;&#x5982;&#x4E0B;&#x539F;&#x5219;&#x3002;</p>
<ol>
<li><p>&#x8981;&#x5728;&#x8BBE;&#x8BA1;&#x8868;&#x7ED3;&#x6784;&#x65F6;&#xFF0C;&#x8003;&#x8651;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6C34;&#x5E73;&#x4E0E;&#x5782;&#x76F4;&#x6269;&#x5C55;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x524D;&#x89C4;&#x5212;&#x597D;&#x672A;&#x6765;1&#x5E74;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3001;&#x8BFB;&#x5199;&#x91CF;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x89C4;&#x5212;&#x597D;&#x5206;&#x5E93;&#x5206;&#x8868;&#x65B9;&#x6848;&#x3002;&#x6BD4;&#x5982;&#x8BBE;&#x8BA1;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x8868;&#xFF0C;&#x9884;&#x8BA1; 1 &#x5E74;&#x540E;&#x7528;&#x6237;&#x6570;&#x636E; 10&#x4EBF; &#x6761;&#xFF0C;&#x5199; QPS &#x7EA6; 5000&#xFF0C;&#x8BFB; QPS 30000&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x6309; UID &#x7EAC;&#x5EA6;&#x8FDB;&#x884C;&#x6563;&#x5217;&#xFF0C;&#x5206;&#x4E3A; 4 &#x4E2A;&#x5E93;&#x6BCF;&#x4E2A;&#x5E93; 32 &#x5F20;&#x8868;&#xFF0C;&#x5355;&#x8868;&#x6570;&#x636E;&#x91CF;&#x63A7;&#x5236;&#x5728; KW &#x7EA7;&#x522B;&#x3002;</p>
</li>
<li><p>&#x8981;&#x4E3A;&#x5B57;&#x6BB5;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x4FDD;&#x7559;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4F18;&#x5148;&#x9009;&#x7528;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x4F8B;&#x5982;&#x4FDD;&#x5B58;&#x5E74;&#x9F84;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x8981;&#x4F7F;&#x7528; TINYINT &#x800C;&#x4E0D;&#x8981;&#x4F7F;&#x7528; INT&#x3002;</p>
</li>
<li><p>&#x53EF;&#x4EE5;&#x5C06;&#x5B57;&#x6BB5;&#x591A;&#x7684;&#x8868;&#x5206;&#x89E3;&#x6210;&#x591A;&#x4E2A;&#x8868;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x589E;&#x52A0;&#x4E2D;&#x95F4;&#x8868;&#x8FDB;&#x884C;&#x5173;&#x8054;&#x3002;&#x5047;&#x5982;&#x4E00;&#x5F20;&#x8868;&#x6709; 40&#xFF5E;50 &#x4E2A;&#x5B57;&#x6BB5;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8BBE;&#x8BA1;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x65F6;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x62C6;&#x5206;&#x51FA;&#x591A;&#x5F20;&#x8868;&#x3002;&#x800C;&#x5728;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x65F6;&#x9700;&#x8981;&#x5BF9;&#x591A;&#x5F20;&#x8868;&#x8FDB;&#x884C;&#x5173;&#x8054;&#x67E5;&#x8BE2;&#xFF0C;&#x6709;&#x65F6;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#xFF0C;&#x4F1A;&#x964D;&#x4F4E;&#x8303;&#x5F0F;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5728;&#x8868;&#x4E2D;&#x4FDD;&#x5B58;&#x4E00;&#x5B9A;&#x7684;&#x5197;&#x4F59;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x53EB;&#x505A;&#x53CD;&#x8303;&#x5F0F;&#x3002;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#x53CD;&#x8303;&#x5F0F;&#x4E00;&#x5B9A;&#x8981;&#x9002;&#x5EA6;&#x3002;</p>
</li>
<li><p>&#x8981;&#x64C5;&#x7528;&#x7D22;&#x5F15;&#xFF0C;&#x6BD4;&#x5982;&#x4E3A;&#x7ECF;&#x5E38;&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x7684;&#x5B57;&#x6BB5;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x3001;&#x521B;&#x5EFA;&#x8054;&#x5408;&#x7D22;&#x5F15;&#x65F6;&#x8981;&#x6839;&#x636E;&#x6700;&#x5DE6;&#x539F;&#x5219;&#x8003;&#x8651;&#x7D22;&#x5F15;&#x7684;&#x590D;&#x7528;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#xFF1B;&#x8981;&#x4E3A;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E0D;&#x80FD;&#x91CD;&#x590D;&#x7684;&#x5B57;&#x6BB5;&#x521B;&#x5EFA;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x7B49;&#x7B49;&#x3002;&#x4E0D;&#x8FC7;&#x8981;&#x6CE8;&#x610F;&#x7D22;&#x5F15;&#x5BF9;&#x63D2;&#x5165;&#x3001;&#x66F4;&#x65B0;&#x7B49;&#x5199;&#x64CD;&#x4F5C;&#x662F;&#x6709;&#x4EE3;&#x4EF7;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x6EE5;&#x7528;&#x7D22;&#x5F15;&#xFF0C;&#x6BD4;&#x5982;&#x50CF;&#x6027;&#x522B;&#x8FD9;&#x6837;&#x552F;&#x4E00;&#x5F88;&#x5DEE;&#x7684;&#x5B57;&#x6BB5;&#x5C31;&#x4E0D;&#x9002;&#x5408;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;</p>
</li>
<li><p>&#x5217;&#x5B57;&#x6BB5;&#x5C3D;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A; not null&#x3002;MySQL &#x96BE;&#x4EE5;&#x5BF9;&#x4F7F;&#x7528; null &#x7684;&#x5217;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#xFF0C;&#x5141;&#x8BB8; null &#x4F1A;&#x4F7F;&#x7D22;&#x5F15;&#x3001;&#x7D22;&#x5F15;&#x7EDF;&#x8BA1;&#x548C;&#x503C;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5141;&#x8BB8; null &#x503C;&#x7684;&#x5217;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD8;&#x9700;&#x8981; MySQL &#x5185;&#x90E8;&#x8FDB;&#x884C;&#x7279;&#x6B8A;&#x5904;&#x7406;&#x3002;</p>
</li>
</ol>
<p>   &#x518D;&#x770B;&#x5230;&#x5982;&#x56FE;&#x53F3;&#x8FB9;&#x6240;&#x793A;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5BF9; SQL &#x8BED;&#x53E5;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x7684;&#x539F;&#x5219;&#x3002;</p>
<ol>
<li><p>&#x8981;&#x627E;&#x5230;&#x6700;&#x9700;&#x8981;&#x4F18;&#x5316;&#x7684; SQL &#x8BED;&#x53E5;&#x3002;&#x8981;&#x4E48;&#x662F;&#x4F7F;&#x7528;&#x6700;&#x9891;&#x7E41;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4F18;&#x5316;&#x540E;&#x63D0;&#x9AD8;&#x6700;&#x660E;&#x663E;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x8BE2; MySQL &#x7684;&#x6162;&#x67E5;&#x8BE2;&#x65E5;&#x5FD7;&#x6765;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x7684; SQL &#x8BED;&#x53E5;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x5B66;&#x4F1A;&#x5229;&#x7528; MySQL &#x63D0;&#x4F9B;&#x7684;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x3002;&#x4F8B;&#x5982;&#x4F7F;&#x7528; Explain &#x6765;&#x5206;&#x6790;&#x8BED;&#x53E5;&#x7684;&#x6267;&#x884C;&#x8BA1;&#x5212;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x4E86;&#x7D22;&#x5F15;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x626B;&#x63CF;&#x4E86;&#x591A;&#x5C11;&#x8BB0;&#x5F55;&#xFF0C;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x6392;&#x5E8F;&#x7B49;&#x7B49;&#x3002;&#x6216;&#x8005;&#x5229;&#x7528; Profile &#x547D;&#x4EE4;&#x6765;&#x5206;&#x6790;&#x67D0;&#x4E2A;&#x8BED;&#x53E5;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5404;&#x4E2A;&#x5206;&#x6B65;&#x7684;&#x8017;&#x65F6;&#x3002;</p>
</li>
<li><p>&#x8981;&#x6CE8;&#x610F;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x662F;&#x8981;&#x907F;&#x514D;&#x4F7F;&#x7528; SELECT *&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x6307;&#x5B9A;&#x5177;&#x4F53;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x539F;&#x56E0;&#x4E00;&#x662F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x67E5;&#x8BE2;&#x51FA;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x4E8C;&#x662F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x67E5;&#x8BE2;&#x5217;&#x5B57;&#x6BB5;&#x7684;&#x5143;&#x4FE1;&#x606F;&#x3002;</p>
</li>
<li><p>&#x662F;&#x5C3D;&#x91CF;&#x4F7F;&#x7528; prepared statements&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5B83;&#x6027;&#x80FD;&#x66F4;&#x597D;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x53EF;&#x4EE5;&#x9632;&#x6B62; SQL &#x6CE8;&#x5165;&#x3002;</p>
</li>
<li><p>&#x662F;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x626B;&#x63CF;&#x6765;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C3D;&#x91CF;&#x5728;&#x6709;&#x7D22;&#x5F15;&#x7684;&#x5B57;&#x6BB5;&#x4E0A;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x8003;&#x5BDF;&#x70B9;&#x4E0E;&#x52A0;&#x5206;&#x9879;">&#x8003;&#x5BDF;&#x70B9;&#x4E0E;&#x52A0;&#x5206;&#x9879;</h3>
<h4 id="&#x8003;&#x5BDF;&#x70B9;"><strong>&#x8003;&#x5BDF;&#x70B9;</strong></h4>
<p>&#x6765;&#x770B;&#x8FD9;&#x4E00;&#x8282;&#x7684;&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#x3002;</p>
<ol>
<li><p>&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x6D88;&#x606F;&#x961F;&#x5217;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x3001;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x4EE5;&#x53CA;&#x5E38;&#x7528;&#x961F;&#x5217;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7279;&#x70B9;&#x3002;&#x6BD4;&#x5982;&#x6D88;&#x606F;&#x961F;&#x5217;&#x9002;&#x7528;&#x4E8E;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x548C;&#x524A;&#x5CF0;&#x586B;&#x8C37;&#x7684;&#x573A;&#x666F;&#xFF1B;Kafka &#x5728;&#x63D0;&#x4F9B;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B9E;&#x73B0;&#x4E86; 0 &#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x5206;&#x5E03;&#x5F0F;&#x961F;&#x5217;&#x670D;&#x52A1;&#xFF1B;MySQL &#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x5F15;&#x64CE;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x578B;&#x4E0E;&#x975E;&#x4E8B;&#x52A1;&#x578B;&#x7684;&#x5173;&#x7CFB;&#x5BF9;&#x8C61;&#x5E93;&#x670D;&#x52A1;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x8981;&#x4E86;&#x89E3; Kafka &#x7684;&#x67B6;&#x6784;&#x548C;&#x6D88;&#x606F;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#xFF0C;&#x660E;&#x767D; Kafka &#x662F;&#x5982;&#x4F55;&#x901A;&#x8FC7; Partition &#x6765;&#x4FDD;&#x8BC1;&#x5E76;&#x53D1;&#x80FD;&#x529B;&#x4E0E;&#x5197;&#x4F59;&#x707E;&#x5907;&#x7684;&#xFF1B;&#x4E86;&#x89E3;&#x6D88;&#x8D39;&#x7EC4;&#x662F;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A; Consumer &#x5B9E;&#x4F8B;&#x4E0D;&#x4F1A;&#x83B7;&#x53D6;&#x5230;&#x91CD;&#x590D;&#x6D88;&#x606F;&#x7684;&#x3002;</p>
</li>
<li><p>&#x8981;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x7684; ACID &#x7279;&#x6027;&#xFF0C;&#x4E86;&#x89E3;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x8981;&#x7262;&#x7262;&#x638C;&#x63E1;&#x5E38;&#x7528;&#x7684; MySQL &#x8BED;&#x53E5;&#xFF0C;&#x6BD4;&#x5982; WHERE &#x6761;&#x4EF6;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x3001;JOIN &#x5173;&#x8054;&#x8BED;&#x53E5;&#x3001;ORDER BY &#x6392;&#x5E8F;&#x8BED;&#x53E5;&#x7B49;&#x7B49;&#x3002;&#x8FD8;&#x8981;&#x719F;&#x6089;&#x5E38;&#x7528;&#x7684;&#x81EA;&#x5E26;&#x51FD;&#x6570;&#xFF0C;&#x4F8B;&#x5982; SUM&#x3001;COUNT &#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x4E86;&#x89E3; MySQL &#x6570;&#x636E;&#x5E93;&#x4E0D;&#x540C;&#x5F15;&#x64CE;&#x7684;&#x7279;&#x70B9;&#x53CA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7D22;&#x5F15;&#x5B9E;&#x73B0;&#x3002;&#x6BD4;&#x5982;&#x77E5;&#x9053;&#x6700;&#x5E38;&#x4F7F;&#x7528;&#x7684; InnoDB &#x975E;&#x5E38;&#x64C5;&#x957F;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF0C;MyISAM &#x6BD4;&#x8F83;&#x9002;&#x5408;&#x975E;&#x4E8B;&#x52A1;&#x7684;&#x7B80;&#x5355;&#x67E5;&#x8BE2;&#x573A;&#x666F;&#x3002;&#x6BD4;&#x5982;&#x77E5;&#x9053; MySQL &#x7684;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3001;&#x8054;&#x5408;&#x7D22;&#x5F15;&#x3001;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x7B49;&#x4E0D;&#x540C;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x5E38;&#x4F7F;&#x7528;&#x7B49; B+ &#x6811;&#x7D22;&#x5F15;&#x5B9E;&#x73B0;&#x7B49;&#x7B49;&#x3002;</p>
</li>
</ol>
<h4 id="&#x52A0;&#x5206;&#x9879;"><strong>&#x52A0;&#x5206;&#x9879;</strong></h4>
<p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x52A0;&#x5206;&#x9879;&#x3002;</p>
<ol>
<li><p>&#x8981;&#x4E86;&#x89E3;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F; Kafka &#x8FD8;&#x662F; MySQL&#xFF0C;&#x90FD;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x65B0;&#x7248;&#x672C;&#x7279;&#x6027;&#x3002;&#x4F8B;&#x5982; MySQL8.0 &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x7A97;&#x53E3;&#x51FD;&#x6570;&#x6765;&#x652F;&#x6301;&#x65B0;&#x7684;&#x67E5;&#x8BE2;&#x65B9;&#x5F0F;&#xFF1B;&#x652F;&#x6301;&#x901A;&#x7528;&#x8868;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F7F;&#x590D;&#x6742;&#x67E5;&#x8BE2;&#x4E2D;&#x7684;&#x5D4C;&#x5165;&#x8868;&#x8BED;&#x53E5;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x8981;&#x77E5;&#x9053;&#x6570;&#x636E;&#x5E93;&#x8868;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8FC7;&#x7EBF;&#x4E0A;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BBE;&#x8BA1;&#x7ECF;&#x9A8C;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5BF9;&#x5BB9;&#x91CF;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x9002;&#x5F53;&#x5206;&#x5E93;&#x5206;&#x8868;&#x6765;&#x4FDD;&#x8BC1;&#x672A;&#x6765;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BF9;&#x9762;&#x8BD5;&#x8D77;&#x5230;&#x79EF;&#x6781;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
</li>
<li><p>&#x6700;&#x597D;&#x6709;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x8C03;&#x4F18;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F8B;&#x5982;&#x660E;&#x660E;&#x5EFA;&#x7ACB;&#x4E86;&#x7D22;&#x5F15;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x662F;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x8FD8;&#x662F;&#x5F88;&#x6162;&#xFF0C;&#x901A;&#x8FC7; Explain &#x5206;&#x6790;&#x53D1;&#x73B0;&#x8868;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;MySQL &#x7684;&#x4F18;&#x5316;&#x5668;&#x9009;&#x7528;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x5BFC;&#x81F4;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x504F;&#x4F4E;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5728; SQL &#x8BED;&#x53E5;&#x4E2D;&#x4F7F;&#x7528; use index &#x6765;&#x6307;&#x5B9A;&#x7D22;&#x5F15;&#x89E3;&#x51B3;&#x3002;</p>
</li>
<li><p>&#x6709;&#x8FC7; Kafka &#x7B49;&#x4E3B;&#x6D41;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4F7F;&#x7528;&#x7ECF;&#x9A8C;&#xFF0C;&#x5E76;&#x4E14;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5728;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E0B;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#x3002;&#x4F8B;&#x5982;&#x65E5;&#x5FD7;&#x63A8;&#x9001;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5BF9;&#x5C0F;&#x6982;&#x7387;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5F02;&#x6B65;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x800C;&#x5BF9;&#x5E94;&#x91D1;&#x878D;&#x7C7B;&#x4E1A;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x540C;&#x6B65;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x6700;&#x9AD8;&#x7684;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x628A; request.required.acks &#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A; -1&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x771F;&#x9898;&#x6C47;&#x603B;">&#x771F;&#x9898;&#x6C47;&#x603B;</h3>
<p>&#x6700;&#x540E;&#x5C06;&#x9762;&#x8BD5;&#x771F;&#x9898;&#x6C47;&#x603B;&#x5982;&#x4E0B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210510001815.png?imageslim" alt=""></p>
<ul>
<li><p>&#x7B2C; 2 &#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x6D88;&#x606F;&#x7684;&#x53D1;&#x9001;&#x8005;&#x4FDD;&#x8BC1;&#x6295;&#x9012;&#x5230;&#x6D88;&#x606F;&#x961F;&#x5217;&#x3001;&#x6D88;&#x606F;&#x5BF9;&#x8C61;&#x81EA;&#x8EAB;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x6D88;&#x8D39;&#x65B9;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x540E;&#x4FEE;&#x6539; offset &#x8FD9;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x53EF;&#x4EE5;&#x7ED3;&#x5408; Kafka &#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x540C;&#x6B65;&#x3001;&#x5F02;&#x6B65;&#xFF0C;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x6027;&#x914D;&#x7F6E;&#x6765;&#x56DE;&#x7B54;&#x3002;</p>
</li>
<li><p>&#x7B2C; 3 &#x9898;&#x53EF;&#x4EE5;&#x4ECE;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x89E3;&#x51B3;&#x6D88;&#x606F;&#x91CD;&#x590D;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x6D88;&#x606F;&#x5904;&#x7406;&#x5B9E;&#x73B0;&#x5E42;&#x7B49;&#xFF0C;&#x6D88;&#x9664;&#x6D88;&#x606F;&#x91CD;&#x590D;&#x7684;&#x5F71;&#x54CD;&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x4F7F;&#x7528; Redis &#x6765;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x53BB;&#x91CD;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x6D88;&#x606F;&#x7684;&#x5904;&#x7406;&#x3002;</p>
</li>
<li><p>&#x7B2C; 4 &#x9898;&#x53EF;&#x4EE5;&#x4ECE;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x3001;&#x51CF;&#x5C11;&#x5173;&#x8054;&#x67E5;&#x8BE2;&#x3001;&#x4F18;&#x5316; SQL &#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x7B49;&#x65B9;&#x9762;&#x5C55;&#x5F00;&#x3002;</p>
</li>
<li><p>&#x7B2C; 6 &#x9898;&#x53EF;&#x4EE5;&#x4ECE; MySQL &#x8C03;&#x4F18;&#x90E8;&#x5206;&#x8BB2;&#x89E3;&#x7684;&#x76F8;&#x5173;&#x539F;&#x5219;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x56DE;&#x7B54;&#x3002;</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第10节：消息队列Kafka架构与原理.html" class="navigation navigation-prev " aria-label="Previous page: 第10节：消息队列Kafka架构与原理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第12节：架构的演进之路与前言技术.html" class="navigation navigation-next " aria-label="Next page: 第12节：架构的演进之路与前言技术">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第11节：MySQL调优与最佳实践","level":"1.3.12","depth":2,"next":{"title":"第12节：架构的演进之路与前言技术","level":"1.3.13","depth":2,"path":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","ref":"32个Java面试必考点/第12节：架构的演进之路与前言技术.md","articles":[]},"previous":{"title":"第10节：消息队列Kafka架构与原理","level":"1.3.11","depth":2,"path":"32个Java面试必考点/第10节：消息队列Kafka架构与原理.md","ref":"32个Java面试必考点/第10节：消息队列Kafka架构与原理.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第11节：MySQL调优与最佳实践.md","mtime":"2021-05-09T16:19:45.344Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

