
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第3节：Java语言特性与设计模式 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第4节：深入浅出JVM.html" />
    
    
    <link rel="prev" href="第2节：操作系统与计算机网络.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第3节：Java语言特性与设计模式</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[toc]</p>
<h2 id="java&#x8BED;&#x8A00;&#x7279;&#x6027;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">Java&#x8BED;&#x8A00;&#x7279;&#x6027;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h2>
<h3 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x77E5;&#x8BC6;&#x70B9;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x77E5;&#x8BC6;&#x70B9;</h3>
<p>&#x524D;&#x9762;&#x8BF4;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x7F51;&#x7EDC;&#x77E5;&#x8BC6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x8003;&#x5BDF;&#x70B9;&#xFF0C;&#x4E00;&#x822C;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;</p>
<ol>
<li>&#x5E38;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#xFF1B;</li>
<li>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;</li>
</ol>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5206;&#x4E3A; 3 &#x5927;&#x7C7B;&#x578B;&#x5171; 23 &#x79CD;&#xFF1A;</p>
<ol>
<li>&#x521B;&#x5EFA;&#x578B;&#xFF1A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3001;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x7ED3;&#x6784;&#x578B;&#xFF1A;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x88C5;&#x9970;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x3001;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#x3001;&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x3001;&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#x3001;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x884C;&#x4E3A;&#x578B;&#xFF1A;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x3001;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x8FED;&#x4EE3;&#x5B50;&#x6A21;&#x5F0F;&#x3001;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x3001;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x3001;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#x3001;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x3001;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x3002;</li>
</ol>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6709;&#xFF1A;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3001;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x3001;&#x6784;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x3001;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x7B49;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV1412GAIvkDAAIBtlkYfqo038.jpg?imageslim" alt=""></p>
<p>&#x9762;&#x8BD5;&#x4E2D;&#x5BF9;&#x4E8E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x660E;&#x767D;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x80FD;&#x591F;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x3002;&#x4E0B;&#x9762;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<h4 id="&#x5355;&#x4F8B;&#x6A21;&#x5F0F;"><strong>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x9996;&#x5148;&#x662F;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x4E2D;&#x4F1A;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#xFF0C;&#x4E5F;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x8003;&#x5BDF;&#x70B9;&#x3002;&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x79CD;&#x662F;<strong>&#x9759;&#x6001;&#x521D;&#x59CB;&#x5316;</strong>&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EB;&#x4F5C;&#x997F;&#x6C49;&#x65B9;&#x5F0F;&#x3002;&#x5B9E;&#x73B0;&#x7684;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#x5728;&#x7C7B;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x5B8C;&#x6210;&#x5355;&#x4F8B;&#x5B9E;&#x4F8B;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0B;&#x4E0D;&#x7BA1;&#x662F;&#x5426;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x5355;&#x4F8B;&#xFF0C;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5355;&#x4F8B;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;<strong>&#x53CC;&#x91CD;&#x68C0;&#x67E5;</strong>&#xFF0C;&#x4E5F;&#x53EB;&#x4F5C;&#x61D2;&#x6C49;&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x771F;&#x6B63;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x5355;&#x4F8B;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x53BB;&#x521B;&#x5EFA;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x5C31;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x5F0F;&#x5FC5;&#x7136;&#x4F1A;&#x9762;&#x5BF9;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x5B9E;&#x4F8B;&#x65F6;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7; synchronized &#x6216;&#x8005; lock &#x8FDB;&#x884C;&#x53CC;&#x91CD;&#x68C0;&#x67E5;&#xFF0C;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x5F15;&#x8D77;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x5355;&#x4F8B;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x79CD;&#x662F;<strong>&#x5355;&#x4F8B;&#x6CE8;&#x518C;&#x8868;</strong>&#x65B9;&#x5F0F;&#xFF0C;Spring &#x4E2D; Bean &#x7684;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5355;&#x4F8B;&#x6CE8;&#x518C;&#x8868;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#x3002;</li>
</ol>
<p>&#x4E0B;&#x9762;&#x7ED3;&#x5408;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#xFF0C;&#x6765;&#x4ECB;&#x7ECD;&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;&#x5728;&#x9762;&#x8BD5;&#x65F6;&#x9047;&#x5230;&#x7C7B;&#x4F3C;&#x95EE;&#x9898;&#xFF0C;&#x8BB0;&#x5F97;&#x8981;&#x5C06;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x8FDB;&#x884C;&#x7ED3;&#x5408;&#xFF0C;&#x6765;&#x4F53;&#x73B0;&#x5BF9;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x7406;&#x89E3;&#x548C;&#x5E94;&#x7528;&#x80FD;&#x529B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l142ISAAe_XAAISBI_gX4I754.jpg?imageslim" alt=""></p>
</blockquote>
<h4 id="&#x5DE5;&#x5382;&#x6A21;&#x5F0F;"><strong>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x662F;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x65F6;&#x5E38;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982; Spring &#x4E2D;&#x5404;&#x79CD; Bean &#x662F;&#x6709;&#x4E0D;&#x540C; Bean &#x5DE5;&#x5382;&#x7C7B;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x7684;&#x3002;</p>
</blockquote>
<h4 id="&#x4EE3;&#x7406;&#x6A21;&#x5F0F;"><strong>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x5728;&#x4E0D;&#x9002;&#x5408;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x5BF9;&#x88AB;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#x3002;Java &#x7684;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x5206;&#x4E3A;&#x9759;&#x6001;&#x4EE3;&#x7406;&#x548C;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x3002;&#x9759;&#x6001;&#x4EE3;&#x7406;&#x6307;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x5C31;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#x597D;&#x4E86;&#x4EE3;&#x7406;&#x7C7B;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x7F16;&#x5199;&#x7684;&#x7C7B;&#xFF1B;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x6307;&#x5728; JVM &#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#xFF0C;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x6709; JDK &#x52A8;&#x6001;&#x4EE3;&#x7406;&#x3001;CGLIB&#x3001;Javassist &#x7B49;&#x3002;&#x9762;&#x8BD5;&#x65F6;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x4E3E;&#x4E2A;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x5728; Motan RPC &#x4E2D;&#xFF0C;&#x662F;&#x4F7F;&#x7528; JDK &#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#xFF0C;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x628A;&#x8FDC;&#x7A0B;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#xFF0C;&#x4F7F;&#x670D;&#x52A1;&#x770B;&#x4E0A;&#x53BB;&#x5C31;&#x50CF;&#x5728;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<h4 id="&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;"><strong>&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x6709;&#x70B9;&#x50CF;&#x5DE5;&#x5382;&#x7684;<strong>&#x6D41;&#x6C34;&#x7EBF;</strong>&#xFF0C;&#x94FE;&#x4E0A;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5B8C;&#x6210;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E00;&#x79CD;&#x5904;&#x7406;&#xFF0C;&#x4F8B;&#x5982; Netty &#x6846;&#x67B6;&#x5728;&#x5904;&#x7406;&#x6D88;&#x606F;&#x65F6;&#x4F7F;&#x7528;&#x7684; Pipeline &#x5C31;&#x662F;&#x4E00;&#x79CD;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x3002;</p>
</blockquote>
<h4 id="&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;"><strong>&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;<strong>&#x8F6C;&#x63A5;&#x5934;</strong>&#xFF0C;&#x628A;&#x4E24;&#x79CD;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8FDB;&#x884C;&#x9002;&#x914D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x5BF9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x89E3;&#x85D5;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x65E5;&#x5FD7;&#x5904;&#x7406;&#x6846;&#x67B6; SLF4J&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86; SLF4J &#x5C31;&#x53EF;&#x4EE5;&#x8DDF; Log4j &#x6216;&#x8005; Logback &#x7B49;&#x5177;&#x4F53;&#x7684;&#x65E5;&#x5FD7;&#x5B9E;&#x73B0;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x89E3;&#x85D5;&#x3002;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x9002;&#x914D;&#x5668;&#x5C06; SLF4J &#x4E0E; Log4j &#x7B49;&#x5B9E;&#x73B0;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x9002;&#x914D;&#xFF0C;&#x5B8C;&#x6210;&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#x4F7F;&#x7528;&#x3002;</p>
</blockquote>
<h4 id="&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;"><strong>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;<strong>&#x53D1;&#x5E03;&#x8BA2;&#x9605;</strong>&#x6A21;&#x5F0F;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E2A;&#x884C;&#x4E3A;&#x9700;&#x8981;&#x89E6;&#x53D1;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x4EF6;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982; gRPC &#x4E2D;&#x7684; Stream &#x6D41;&#x5F0F;&#x8BF7;&#x6C42;&#x7684;&#x5904;&#x7406;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
</blockquote>
<h4 id="&#x6784;&#x9020;&#x8005;&#x6A21;&#x5F0F;"><strong>&#x6784;&#x9020;&#x8005;&#x6A21;&#x5F0F;</strong></h4>
<blockquote>
<p>&#x6784;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x5F88;&#x591A;&#x590D;&#x6742;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x5177;&#x4F53;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; PB &#x5BF9;&#x8C61;&#x65F6;&#x4F7F;&#x7528;&#x7684; builder &#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<hr>
<h3 id="java-&#x8BED;&#x8A00;&#x7279;&#x6027;&#x77E5;&#x8BC6;&#x70B9;">Java &#x8BED;&#x8A00;&#x7279;&#x6027;&#x77E5;&#x8BC6;&#x70B9;</h3>
<p>Java &#x8BED;&#x8A00;&#x7279;&#x6027;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6C47;&#x603B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV13doqAUZwdAAJtuA27fL4326.jpg?imageslim" alt=""></p>
<p>&#x5E38;&#x7528;&#x96C6;&#x5408;&#x7C7B;&#x5B9E;&#x73B0;&#x4E0E; Java &#x5E76;&#x53D1;&#x5DE5;&#x5177;&#x5305; JUC &#x662F;&#x5E38;&#x89C1;&#x8003;&#x70B9;&#xFF0C;JUC &#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x8BFE;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x3002;</p>
<p>Java &#x7684;&#x96C6;&#x5408;&#x7C7B;&#x4E2D;&#x90E8;&#x5206;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x4E86;&#x89E3;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;HashMap&#x3001;TreeMap &#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x7B49;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x4E0E;&#x53CD;&#x5C04;&#x662F; Java &#x8BED;&#x8A00;&#x7684;&#x7279;&#x8272;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x4E0E;&#x53CD;&#x5C04;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x5728; ORM &#x6846;&#x67B6;&#x4E2D;&#x4F1A;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x7C7B;&#x3002;&#x800C; RPC &#x8C03;&#x7528;&#x65F6;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x8C03;&#x7528;&#x5B9E;&#x73B0;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;</p>
<p>Java &#x57FA;&#x7840;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E5F;&#x5E38;&#x5E38;&#x4F1A;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x88AB;&#x95EE;&#x5230;&#xFF0C;&#x4F8B;&#x5982;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5360;&#x7528;&#x591A;&#x5927;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3001;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x81EA;&#x52A8;&#x8F6C;&#x578B;&#x4E0E;&#x5F3A;&#x5236;&#x8F6C;&#x578B;&#x3001;&#x57FA;&#x7840;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E0E; wrapper &#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x4E0E;&#x62C6;&#x7BB1;&#x7B49;&#x3002;</p>
<p>Java &#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x5206;&#x4E3A;&#x5F3A;&#x5F15;&#x7528;&#x3001;&#x8F6F;&#x5F15;&#x7528;&#x3001;&#x5F31;&#x5F15;&#x7528;&#x3001;&#x865A;&#x5F15;&#x7528;&#x56DB;&#x79CD;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F15;&#x7528;&#x5728; GC &#x65F6;&#x7684;&#x5904;&#x7406;&#x7B56;&#x7565;&#x4E0D;&#x540C;&#xFF0C;&#x5F3A;&#x5F15;&#x7528;&#x4E0D;&#x4F1A;&#x88AB; GC &#x56DE;&#x6536;&#xFF1B;&#x8F6F;&#x5F15;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x65F6;&#x4F1A;&#x88AB; GC &#x56DE;&#x6536;&#xFF1B;&#x5F31;&#x5F15;&#x7528;&#x5219;&#x5728;&#x6BCF;&#x6B21; GC &#x65F6;&#x88AB;&#x56DE;&#x6536;&#xFF1B;&#x865A;&#x5F15;&#x7528;&#x5FC5;&#x987B;&#x548C;&#x5F15;&#x7528;&#x961F;&#x5217;&#x8054;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>Java &#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x673A;&#x5236;&#x5C31;&#x662F; try-catch-finally &#x673A;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5F02;&#x5E38;&#x65F6;&#x5728; try catch &#x4E2D;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#xFF1B;&#x9700;&#x8981;&#x4E86;&#x89E3; Error &#x548C; Exception &#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>&#x6700;&#x540E; Java &#x7684;&#x6CE8;&#x89E3;&#x673A;&#x5236;&#x548C; SPI &#x6269;&#x5C55;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6269;&#x5C55;&#x70B9;&#x9002;&#x5F53;&#x4E86;&#x89E3;&#x3002;</p>
<hr>
<h3 id="&#x8BE6;&#x89E3;map">&#x8BE6;&#x89E3;Map</h3>
<p>&#x5173;&#x4E8E; Java &#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x91CD;&#x70B9;&#x8BB2;&#x89E3;&#x6700;&#x5E38;&#x8003;&#x5BDF;&#x70B9; HashMap &#x548C; ConcurrentHashMap&#xFF0C;&#x4EE5;&#x53CA; Java &#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x65B0;&#x6280;&#x672F;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV1413iANCl1AAG3aLAzQ6M654.png?imageslim" alt=""></p>
<p>&#x9762;&#x8BD5;&#x4E2D;&#xFF0C;Map &#x7684;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x80FD;&#x591F;&#x8003;&#x5BDF;&#x5230;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;Java &#x57FA;&#x7840;&#x5B9E;&#x73B0;&#x4EE5;&#x53CA;&#x5BF9;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x5904;&#x7406;&#x601D;&#x8DEF;&#x7684;&#x638C;&#x63E1;&#x7A0B;&#x5EA6;&#x3002;</p>
<ol>
<li><p>HashMap</p>
<ul>
<li>&#x5148;&#x6765;&#x770B; HashMap &#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;Java &#x7684; HashMap &#x5C31;&#x662F;&#x6570;&#x7EC4;&#x52A0;&#x94FE;&#x8868;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x662F;&#x4E00;&#x4E2A;&#x94FE;&#x8868;&#x3002;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x5B58;&#x5165;&#x5BF9;&#x8C61;&#x7684; HashCode&#xFF0C;&#x6765;&#x8BA1;&#x7B97;&#x5BF9;&#x8C61;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x8981;&#x5B58;&#x5165;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7528;&#x94FE;&#x8868;&#x6765;&#x89E3;&#x51B3;&#x6563;&#x5217;&#x51B2;&#x7A81;&#xFF0C;&#x94FE;&#x8868;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x952E;&#x503C;&#x5BF9;&#x3002;</li>
<li>&#x9664;&#x4E86;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x586B;&#x5145;&#x56E0;&#x5B50;&#x7684;&#x4F5C;&#x7528;&#x4E0E; Map &#x6269;&#x5BB9;&#x65F6;&#x7684; rehash &#x673A;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x77E5;&#x9053; HashMap &#x7684;&#x5BB9;&#x91CF;&#x90FD;&#x662F; 2 &#x7684;&#x5E42;&#x6B21;&#x65B9;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6309;&#x4F4D;&#x4E0E;&#x64CD;&#x4F5C;&#x6765;&#x8BA1;&#x7B97;&#x4F59;&#x6570;&#xFF0C;&#x6BD4;&#x6C42;&#x6A21;&#x8981;&#x5FEB;&#x3002;&#x53E6;&#x5916;&#x9700;&#x8981;&#x77E5;&#x9053; HashMap &#x662F;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x5728;&#x591A;&#x7EBF;&#x7A0B; put &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x5BB9;&#x91CF;&#x8D85;&#x8FC7;&#x586B;&#x5145;&#x56E0;&#x5B50;&#x65F6;&#x8FDB;&#x884C; rehash&#xFF0C;&#x56E0;&#x4E3A; HashMap &#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5C3E;&#x90E8;&#x904D;&#x5386;&#xFF0C;&#x5728;&#x94FE;&#x8868;&#x63D2;&#x5165;&#x5143;&#x7D20;&#x65F6;&#x4F7F;&#x7528;&#x5934;&#x63D2;&#x6CD5;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;</li>
</ul>
</li>
<li><p>ConcurrentHashMap</p>
<p>&#x4ECE; HashMap &#x7684;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5C31;&#x4F1A;&#x95EE;&#x5230;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684; ConcurrentHashMap&#x3002;ConcurrentHashMap &#x91C7;&#x7528;&#x5206;&#x6BB5;&#x9501;&#x7684;&#x601D;&#x60F3;&#x6765;&#x964D;&#x4F4E;&#x5E76;&#x53D1;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x9501;&#x5B9A;&#x53D1;&#x751F;&#x9891;&#x7387;&#xFF0C;&#x5728; JDK1.7 &#x4E0E; 1.8 &#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x5DEE;&#x5F02;&#x975E;&#x5E38;&#x5927;&#xFF0C;1.7 &#x4E2D;&#x4F7F;&#x7528; Segment &#x8FDB;&#x884C;&#x5206;&#x6BB5;&#x52A0;&#x9501;&#xFF0C;&#x964D;&#x4F4E;&#x5E76;&#x53D1;&#x9501;&#x5B9A;&#xFF1B;1.8 &#x4E2D;&#x4F7F;&#x7528; CAS &#x81EA;&#x65CB;&#x9501;&#x7684;&#x4E50;&#x89C2;&#x9501;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5E76;&#x53D1;&#x5EA6;&#x8F83;&#x9AD8;&#x65F6;&#x6027;&#x80FD;&#x4F1A;&#x6BD4;&#x8F83;&#x4E00;&#x822C;&#x3002;&#x53E6;&#x5916; 1.8 &#x4E2D;&#x7684; ConcurrentHashMap &#x5F15;&#x5165;&#x4E86;&#x7EA2;&#x9ED1;&#x6811;&#x6765;&#x89E3;&#x51B3; Hash &#x51B2;&#x7A81;&#x65F6;&#x94FE;&#x8868;&#x987A;&#x5E8F;&#x67E5;&#x627E;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7EA2;&#x9ED1;&#x6811;&#x7684;&#x542F;&#x7528;&#x6761;&#x4EF6;&#x4E0E;&#x94FE;&#x8868;&#x7684;&#x957F;&#x5EA6;&#x548C; Map &#x7684;&#x603B;&#x5BB9;&#x91CF;&#x6709;&#x5173;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F;&#x94FE;&#x8868;&#x5927;&#x4E8E; 8 &#x4E14;&#x5BB9;&#x91CF;&#x5927;&#x4E8E; 64 &#x65F6;&#x8F6C;&#x4E3A;&#x7EA2;&#x9ED1;&#x6811;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x5EFA;&#x8BAE;&#x8BE6;&#x7EC6;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;</p>
</li>
</ol>
<h3 id="&#x8BE6;&#x89E3;java&#x7248;&#x672C;&#x7279;&#x6027;">&#x8BE6;&#x89E3;Java&#x7248;&#x672C;&#x7279;&#x6027;</h3>
<p><img src="https://img.jinguo.tech/blog/CgoB5l1414OAPPHoAAHK9xyeUdE686.png?imageslim" alt=""></p>
<p>Java &#x8FD1;&#x4E9B;&#x5E74;&#x4E00;&#x6539;&#x4EE5;&#x5F80;&#x7684;&#x7248;&#x672C;&#x53D1;&#x5E03;&#x98CE;&#x683C;&#xFF0C;&#x53D1;&#x5E03;&#x9891;&#x7387;&#x63D0;&#x9AD8;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x76EE;&#x524D;&#x5927;&#x90E8;&#x5206;&#x516C;&#x53F8;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#x7684;&#x8FD8;&#x662F; 1.8 &#x7248;&#x672C;&#xFF0C;&#x4E00;&#x5C11;&#x90E8;&#x5206;&#x5347;&#x7EA7;&#x5230; 1.9 &#x6216; 1.10 &#x7248;&#x672C;&#xFF0C;Java &#x7684; 1.8 &#x7248;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x652F;&#x6301;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6700;&#x65B0;&#x53D1;&#x5E03;&#x7684; 1.11 &#x7248;&#x672C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x652F;&#x6301;&#x7684;&#x7248;&#x672C;&#xFF0C;1.11 &#x7248;&#x672C;&#x4E2D;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x4E86; 1.9&#x3001;1.10 &#x7248;&#x672C;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5; 1.8 &#x548C; 1.11 &#x7248;&#x672C;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7248;&#x672C;&#x3002;</p>
<p>&#x5728; 1.8 &#x7248;&#x672C;&#x4E2D; Java &#x589E;&#x52A0;&#x4E86;&#x5BF9; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F7F; Java &#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#x53EF;&#x4EE5;&#x66F4;&#x7B80;&#x6D01;&#xFF0C;&#x4E5F;&#x66F4;&#x65B9;&#x4FBF;&#x652F;&#x6301;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A; Stream &#x6D41;&#x5F0F;&#x5904;&#x7406;&#x7684; API&#x3002;1.8 &#x7248;&#x672C;&#x8FD8;&#x652F;&#x6301;&#x4E86;&#x65B9;&#x6CD5;&#x5F15;&#x7528;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7B80;&#x5316; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5199;&#x6CD5;&#x3002;</p>
<p>&#x5728; 1.8 &#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x3002;&#x6700;&#x540E;&#x5728; 1.8 &#x7248;&#x672C;&#x4E2D;&#x5BF9;&#x65B9;&#x6CD5;&#x533A;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x4F7F;&#x7528; Metaspace &#x66FF;&#x6362;&#x6389;&#x4E86; PermGen &#x7684;&#x6C38;&#x4E45;&#x4EE3;&#x3002;Metaspace &#x4E0E; PermGen &#x4E4B;&#x95F4;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A;Metaspace &#x5E76;&#x4E0D;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x5185;&#x5B58;&#x3002;&#x66FF;&#x6362;&#x7684;&#x76EE;&#x7684;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x5BF9;&#x5143;&#x6570;&#x636E;&#x7684;&#x7BA1;&#x7406;&#x540C;&#x65F6;&#x63D0;&#x5347; GC &#x6548;&#x7387;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x65B9;&#x4FBF;&#x540E;&#x7EED; HotSpot &#x4E0E; JRockit &#x5408;&#x5E76;</p>
<p>&#x5728; 1.9&#x3001;1.10 &#x7248;&#x672C;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x7279;&#x6027;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06; G1 &#x8BBE;&#x4E3A;&#x9ED8;&#x8BA4;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x3001;&#x652F;&#x6301;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x63A8;&#x65AD;&#x7B49;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x90FD;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x5728; 1.11 &#x7248;&#x672C;&#x4E2D;&#x3002;</p>
<p>1.11 &#x7248;&#x672C;&#x662F; Java &#x6700;&#x65B0;&#x7684;&#x957F;&#x671F;&#x652F;&#x6301;&#x7248;&#x672C;&#xFF0C;&#x4E5F;&#x5C06;&#x4F1A;&#x662F;&#x672A;&#x6765;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x4E3B;&#x8981;&#x7248;&#x672C;&#xFF0C;1.11 &#x7248;&#x672C;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x6FC0;&#x52A8;&#x4EBA;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#x662F; ZGC &#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#xFF0C;ZGC &#x4E3A;&#x5927;&#x5185;&#x5B58;&#x5806;&#x8BBE;&#x8BA1;&#xFF0C;&#x6709;&#x7740;&#x975E;&#x5E38;&#x5F3A;&#x608D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x80FD;&#x591F;&#x5B9E;&#x73B0; 10ms &#x4EE5;&#x4E0B;&#x7684; GC &#x6682;&#x505C;&#x65F6;&#x95F4;&#x3002;&#x5173;&#x4E8E; ZGC &#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x8BFE;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x4ECB;&#x7ECD;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;1.11 &#x7248;&#x672C;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406; API &#x8FDB;&#x884C;&#x4E86;&#x589E;&#x5F3A;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5B57;&#x7B26;&#x590D;&#x5236;&#x7B49;&#x529F;&#x80FD;&#x3002;1.11 &#x7248;&#x672C;&#x8FD8;&#x5185;&#x7F6E;&#x4E86; HttpClient&#x3002;</p>
<hr>
<h3 id="&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;">&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;</h3>
<h4 id="&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;"><strong>&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;</strong></h4>
<blockquote>
<p>&#x4ECE;&#x9762;&#x8BD5;&#x5B98;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x603B;&#x7ED3;&#x672C;&#x8BFE;&#x65F6;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x548C; Java &#x8BED;&#x8A00;&#x7279;&#x6027;&#x7684;&#x8003;&#x5BDF;&#x70B9;&#x5982;&#x4E0B;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x8003;&#x5BDF;&#x70B9;&#x5C31;&#x662F;&#x5BF9;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x57FA;&#x672C;&#x539F;&#x7406;&#x7684;&#x8003;&#x5BDF;&#x3002;&#x8981;&#x6C42;&#x5BF9;&#x8FD9;&#x4E24;&#x9879;&#x7684;&#x7406;&#x89E3;&#x5FC5;&#x987B;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6E05;&#x6670;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684; 4/7 &#x5C42;&#x6A21;&#x578B;&#x7684;&#x6982;&#x5FF5;&#xFF0C;TCP &#x534F;&#x8BAE;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x7B49;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x3001;&#x6A21;&#x578B;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x548C;&#x4F7F;&#x7528;&#x59FF;&#x52BF;&#xFF0C;&#x4F8B;&#x5982; HashMap &#x5728; JDK 1.8 &#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x6709;&#x51E0;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF1F;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x4E0B;&#x8BE5;&#x4F7F;&#x7528;&#x61D2;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x5B9E;&#x73B0;&#xFF0C;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x4E0B;&#x4F7F;&#x7528;&#x997F;&#x6C49;&#x5F0F;&#x5355;&#x4F8B;&#x5B9E;&#x73B0;&#x7B49;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x4E2A;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;&#x4F60;&#x5E38;&#x7528;&#x7684; Linux &#x547D;&#x4EE4;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x90FD;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x7B2C;&#x56DB;&#x4E2A;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x5BB9;&#x6613;&#x72AF;&#x9519;&#x7684;&#x70B9;&#xFF0C;&#x4F8B;&#x5982; == &#x4E0E; equals &#x7684;&#x533A;&#x522B;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x8C61;&#x7684;&#x5F3A;&#x5F15;&#x7528;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#xFF0C;&#x4E3B;&#x8981;&#x8003;&#x5BDF;&#x5019;&#x9009;&#x4EBA;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x65B9;&#x5F0F;&#x7684;&#x4F5C;&#x7528;&#x548C;&#x7406;&#x89E3;&#x3002;</li>
<li>&#x7B2C;&#x4E94;&#x4E2A;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x4E0E;&#x9762;&#x8BD5;&#x65B9;&#x5411;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x4F8B;&#x5982;&#x9762;&#x8BD5;&#x7684;&#x5C97;&#x4F4D;&#x662F;&#x4E2D;&#x95F4;&#x4EF6;&#x7814;&#x53D1;&#xFF0C;&#x9762;&#x8BD5;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x6D89;&#x53CA;&#x66F4;&#x591A;&#x7684;&#x5B58;&#x50A8;&#x3001;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x7684;&#x8003;&#x5BDF;&#x3002;</li>
</ol>
</blockquote>
<h4 id="&#x52A0;&#x5206;&#x9879;"><strong>&#x52A0;&#x5206;&#x9879;</strong></h4>
<blockquote>
<p>&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x9762;&#x8BD5;&#x901A;&#x8FC7;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x56DE;&#x7B54;&#x51FA;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x4FDD;&#x8BC1;&#x901A;&#x8FC7;&#x9762;&#x8BD5;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x4F55;&#x505A;&#x5230;&#x6BD4;&#x5176;&#x4ED6;&#x7ADE;&#x4E89;&#x8005;&#x66F4;&#x4F18;&#x79C0;&#xFF0C;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x7559;&#x4E0B;&#x66F4;&#x597D;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x662F;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x3002;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E9B; buff&#x3002;&#x8FD9;&#x4E9B;&#x52A0;&#x5206;&#x80FD;&#x529B;&#x4E0D;&#x4EC5;&#x4EC5;&#x9488;&#x5BF9;&#x8FD9;&#x4E00;&#x8BFE;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x540E;&#x7EED;&#x8BFE;&#x7A0B;&#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x901A;&#x7528;&#x6027;&#x3002;</p>
<ol>
<li>&#x80FD;&#x5C06;&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#x4E0E;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x7ED3;&#x5408;&#xFF0C;&#x6216;&#x8005;&#x4E0E;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7ECF;&#x9A8C;&#x7ED3;&#x5408;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x7684;&#x4F53;&#x73B0;&#x5BF9;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x7A81;&#x51FA;&#x5B9E;&#x8DF5;&#x80FD;&#x529B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56DE;&#x7B54; &#x201C;&#x4F60;&#x77E5;&#x9053;&#x54EA;&#x51E0;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x201D; &#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4E0D;&#x4F46;&#x80FD;&#x8BF4;&#x51FA;&#x51E0;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x9002;&#x5408;&#x54EA;&#x7C7B;&#x573A;&#x666F;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x80FD;&#x6307;&#x51FA;&#x54EA;&#x4E9B;&#x8457;&#x540D;&#x7684;&#x6846;&#x67B6;&#x5728;&#x5904;&#x7406;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x65F6;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x5728;&#x5904;&#x7406;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4EC0;&#x4E48;<strong>&#x573A;&#x666F;</strong>&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53D6;&#x5F97;&#x4E86;&#x4EC0;&#x4E48;<strong>&#x6548;&#x679C;</strong>&#xFF0C;&#x8FD9;&#x6837;&#x80AF;&#x5B9A;&#x4F1A;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x7559;&#x4E0B;&#x975E;&#x5E38;&#x597D;&#x7684;&#x5370;&#x8C61;&#x3002;</p>
<ol>
<li>&#x7528;&#x53CD;&#x4F8B;&#x6765;&#x63CF;&#x8FF0;&#x5728;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x8BEF;&#x7528;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
</ol>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4ECB;&#x7ECD;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x4ECB;&#x7ECD;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3001;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x5230;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x53CD;&#x5C04;&#x4F1A;&#x5BF9;<strong>&#x6027;&#x80FD;</strong>&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#xFF0C;&#x5E94;&#x907F;&#x514D;&#x6EE5;&#x7528;&#x3002;</p>
<ol>
<li>&#x77E5;&#x9053;&#x4E0E;&#x8003;&#x5BDF;&#x77E5;&#x8BC6;&#x70B9;&#x76F8;&#x5173;&#x7684;&#x4F18;&#x5316;&#x70B9;&#x3002;</li>
</ol>
<p>&#x4F8B;&#x5982;&#x5728;&#x4ECB;&#x7ECD; TCP &#x5EFA;&#x8FDE;&#x4E0E;&#x65AD;&#x8FDE;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x80FD;&#x591F;&#x6307;&#x51FA;&#x7EBF;&#x4E0A;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5927;&#x91CF; time_wait &#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<strong>&#x8C03;&#x6574;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;</strong>&#x52A0;&#x5FEB;&#x8FDE;&#x63A5;&#x7684;&#x56DE;&#x6536;&#x4E0E;&#x590D;&#x7528;&#x3002;</p>
<ol>
<li>&#x4E86;&#x89E3;&#x4E0E;&#x77E5;&#x8BC6;&#x70B9;&#x76F8;&#x5173;&#x7684;&#x6700;&#x65B0;&#x6280;&#x672F;&#x8D8B;&#x52BF;&#x3002;</li>
</ol>
<p>&#x4F8B;&#x5982;&#x4ECB;&#x7ECD; ConcurrentHashMap &#x7684;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x77E5;&#x9053; 1.8 &#x7248;&#x672C;&#x7684;&#x6539;&#x8FDB;&#x7EC6;&#x8282;&#x3002;&#x6216;&#x8005;&#x5728;&#x4ECB;&#x7ECD; HTTP &#x65F6;&#x80FD;&#x591F;&#x8BF4;&#x51FA; HTTP2 &#x548C; QUIC &#x7684;&#x7279;&#x70B9;&#x4E0E;&#x5B9E;&#x73B0;&#x7B49;&#x3002;</p>
<ol>
<li>&#x56DE;&#x7B54;&#x9762;&#x8BD5;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5728;&#x6BD4;&#x8F83;&#x4E86;&#x89E3;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5C3D;&#x91CF;&#x589E;&#x52A0;&#x56DE;&#x7B54;&#x5185;&#x5BB9;&#x7684;&#x6DF1;&#x5EA6;&#x3002;</li>
</ol>
<p>&#x4F8B;&#x5982;&#x5728;&#x4ECB;&#x7ECD; TCP &#x7684;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x65F6;&#xFF0C;&#x80FD;&#x8BB2;&#x5230;<strong>&#x6D41;&#x91CF;&#x548C;&#x62E5;&#x585E;&#x63A7;&#x5236;</strong>&#xFF0C;&#x8FD1;&#x4E00;&#x6B65;&#x80FD;&#x6307;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x62E5;&#x585E;&#x7684;&#x7B97;&#x6CD5;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x4E00;&#x822C;&#x4F1A;&#x6CBF;&#x7740;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x56DE;&#x7B54;&#x7EE7;&#x7EED;&#x8FFD;&#x95EE;&#xFF0C;&#x5982;&#x679C;&#x5BF9;<strong>&#x7EC6;&#x8282;</strong>&#x4E0D;&#x592A;&#x4E86;&#x89E3;&#x53EF;&#x80FD;&#x4F1A;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x3002;</p>
</blockquote>
<hr>
<h3 id="&#x771F;&#x9898;&#x6C47;&#x603B;">&#x771F;&#x9898;&#x6C47;&#x603B;</h3>
<p>&#x771F;&#x9898;&#x6C47;&#x603B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV1414uAQSHlAAH_rsNrJqI449.png?imageslim" alt=""></p>
<p>&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x9898;&#xFF1A;&#x7EBF;&#x7A0B;&#x3001;&#x8FDB;&#x7A0B;&#x7684;&#x533A;&#x522B;&#x548C;&#x8054;&#x7CFB;&#xFF0C;&#x4E3B;&#x8981;&#x4ECE;&#x8D44;&#x6E90;&#x5360;&#x7528;&#x3001;&#x5207;&#x6362;&#x6548;&#x7387;&#x3001;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x7B49;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x89E3;&#x7B54;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x9898;&#xFF1A;&#x7EBF;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x8FC7;&#x7A0B;&#x4E3B;&#x8981;&#x8003;&#x5BDF;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x6808;&#x7B49;&#x73B0;&#x573A;&#xFF0C;&#x9700;&#x8981;&#x7531;&#x7528;&#x6237;&#x6001;&#x5207;&#x6362;&#x5230;&#x5185;&#x6838;&#x6001;&#x3002;&#x6700;&#x540E;&#x901A;&#x8FC7; vmstat &#x547D;&#x4EE4;&#x67E5;&#x770B;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x7684;&#x60C5;&#x51B5;&#xFF1B;</li>
<li>&#x7B2C;&#x4E09;&#x9898;&#xFF1A;&#x5E38;&#x7528;&#x7684; Linux &#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x524D;&#x9762;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6C47;&#x603B;&#x63D0;&#x5230;&#x7684;&#x547D;&#x4EE4;&#xFF1B;</li>
<li>&#x7B2C;&#x56DB;&#x9898;&#xFF1A;&#x77E5;&#x8BC6;&#x70B9;&#x8BE6;&#x89E3;&#x4E2D;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#xFF0C;&#x52A1;&#x5FC5;&#x8981;&#x638C;&#x63E1;&#xFF1B;</li>
<li>&#x7B2C;&#x4E94;&#x9898;&#xFF1A;&#x77E5;&#x8BC6;&#x70B9;&#x8BE6;&#x89E3;&#x4E2D;&#x5DF2;&#x7ECF;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#xFF0C;&#x52A1;&#x5FC5;&#x8981;&#x638C;&#x63E1;&#xFF1B;</li>
<li>&#x7B2C;&#x516D;&#x9898;&#xFF1A;&#x5927;&#x81F4;&#x5305;&#x62EC; DNS &#x89E3;&#x6790;&#x3001;TCP &#x5EFA;&#x8FDE;&#x3001;HTTP &#x8BF7;&#x6C42;&#x3001;HTTP &#x54CD;&#x5E94;&#x7B49;&#xFF0C;&#x5B9E;&#x9645;&#x56DE;&#x7B54;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x753B;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4EA4;&#x4E92;&#x56FE;&#x6765;&#x8BF4;&#x660E;&#x3002;</li>
</ol>
<p>&#x518D;&#x6C47;&#x603B;&#x4E00;&#x4E9B;&#x771F;&#x9898;&#xFF0C;&#x5305;&#x62EC;&#x57FA;&#x7840;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x53CA;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l1415GALUZ6AAHoxTPQ0mw023.png?imageslim" alt=""></p>
<p><a href="32&#x4E2A;Java&#x9762;&#x8BD5;&#x5FC5;&#x8003;&#x70B9;/&#x7B2C;3&#x8282;&#xFF1A;Java&#x8BED;&#x8A00;&#x7279;&#x6027;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;.md">&#x7B2C;3&#x8282;&#xFF1A;Java&#x8BED;&#x8A00;&#x7279;&#x6027;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第2节：操作系统与计算机网络.html" class="navigation navigation-prev " aria-label="Previous page: 第2节：操作系统与计算机网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第4节：深入浅出JVM.html" class="navigation navigation-next " aria-label="Next page: 第4节：深入浅出JVM">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第3节：Java语言特性与设计模式","level":"1.3.4","depth":2,"next":{"title":"第4节：深入浅出JVM","level":"1.3.5","depth":2,"path":"32个Java面试必考点/第4节：深入浅出JVM.md","ref":"32个Java面试必考点/第4节：深入浅出JVM.md","articles":[]},"previous":{"title":"第2节：操作系统与计算机网络","level":"1.3.3","depth":2,"path":"32个Java面试必考点/第2节：操作系统与计算机网络.md","ref":"32个Java面试必考点/第2节：操作系统与计算机网络.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第3节：Java语言特性与设计模式.md","mtime":"2021-05-09T16:58:02.873Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

