
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第4节：深入浅出JVM · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第5节：并发与多线程.html" />
    
    
    <link rel="prev" href="第3节：Java语言特性与设计模式.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第4节：深入浅出JVM</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[toc]</p>
<h2 id="&#x6DF1;&#x5165;&#x6D45;&#x51FA;jvm">&#x6DF1;&#x5165;&#x6D45;&#x51FA;JVM</h2>
<p>&#x672C;&#x8282;&#x7684;&#x4E3B;&#x9898;&#x662F; JVM &#x539F;&#x7406;&#x3002;JVM &#x662F; Java &#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x57FA;&#x7840;&#xFF0C;&#x9762;&#x8BD5;&#x65F6;&#x4E00;&#x5B9A;&#x4F1A;&#x9047;&#x5230; JVM &#x76F8;&#x5173;&#x7684;&#x9898;&#x3002;&#x672C;&#x8BFE;&#x65F6;&#x4F1A;&#x5148;&#x5BF9;&#x9762;&#x8BD5;&#x4E2D; JVM &#x7684;&#x8003;&#x5BDF;&#x70B9;&#x8FDB;&#x884C;&#x6C47;&#x603B;&#x4ECB;&#x7ECD;&#x3002;&#x7136;&#x540E;&#x5BF9; JVM &#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;Java &#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x3001;&#x5E38;&#x7528;&#x7684; GC &#x7B97;&#x6CD5;&#x8FD9;&#x4E09;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x3002;&#x6700;&#x540E;&#x6C47;&#x603B; JVM &#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#x7684;&#x9762;&#x8BD5;&#x771F;&#x9898;&#x3002;</p>
<h3 id="jvm-&#x77E5;&#x8BC6;&#x70B9;&#x6C47;&#x603B;">JVM &#x77E5;&#x8BC6;&#x70B9;&#x6C47;&#x603B;</h3>
<p>&#x9996;&#x5148;&#x770B;&#x770B; JVM &#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6C47;&#x603B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14lumAJ5mOAAOz7eKZQb8955.jpg?imageslim" alt=""></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;JVM &#x77E5;&#x8BC6;&#x70B9;&#x6709; 6 &#x4E2A;&#x5927;&#x65B9;&#x5411;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x3001;GC &#x5783;&#x573E;&#x56DE;&#x6536;&#x662F;&#x6BD4;&#x8F83;&#x91CD;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x90E8;&#x5206;&#x504F;&#x91CD;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#xFF0C;&#x91CD;&#x70B9;&#x7A81;&#x51FA;&#x5B9E;&#x8DF5;&#x80FD;&#x529B;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x548C;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#x90E8;&#x5206;&#x504F;&#x91CD;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#xFF0C;&#x4E3B;&#x8981;&#x638C;&#x63E1;&#x77E5;&#x8BC6;&#x70B9;&#x3002;</p>
<p>&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x5982;&#x4E0B;&#x3002;</p>
<ol>
<li>&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF1A;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x3001;&#x65B9;&#x6CD5;&#x533A;&#x3001;&#x5806;&#x3001;&#x6808;&#x3001;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x4FDD;&#x5B58;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x3002;</li>
<li>&#x7C7B;&#x52A0;&#x8F7D;&#xFF1A;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x7684;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x53CA;&#x5E38;&#x7528;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5206;&#x522B;&#x52A0;&#x8F7D;&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x3002;</li>
<li>GC&#xFF1A;&#x5206;&#x4EE3;&#x56DE;&#x6536;&#x7684;&#x601D;&#x60F3;&#x548C;&#x4F9D;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x601D;&#x8DEF;&#x3001;&#x9002;&#x5408;&#x7684;&#x573A;&#x666F;&#x3002;</li>
<li>&#x6027;&#x80FD;&#x8C03;&#x4F18;&#xFF1A;&#x5E38;&#x7528;&#x7684; JVM &#x4F18;&#x5316;&#x53C2;&#x6570;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x53C2;&#x6570;&#x8C03;&#x4F18;&#x7684;&#x4F9D;&#x636E;&#xFF0C;&#x5E38;&#x7528;&#x7684; JVM &#x5206;&#x6790;&#x5DE5;&#x5177;&#x80FD;&#x5206;&#x6790;&#x54EA;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x6267;&#x884C;&#x6A21;&#x5F0F;&#xFF1A;&#x89E3;&#x91CA;&#x3001;&#x7F16;&#x8BD1;&#x3001;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;Java7 &#x63D0;&#x4F9B;&#x7684;&#x5206;&#x5C42;&#x7F16;&#x8BD1;&#x6280;&#x672F;&#x3002;&#x9700;&#x8981;&#x77E5;&#x9053; JIT &#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x6280;&#x672F;&#x548C; OSR&#xFF08;&#x6808;&#x4E0A;&#x66FF;&#x6362;&#xFF09;&#xFF0C;&#x77E5;&#x9053; C1&#x3001;C2 &#x7F16;&#x8BD1;&#x5668;&#x9488;&#x5BF9;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5176;&#x4E2D; C2 &#x9488;&#x5BF9; Server &#x6A21;&#x5F0F;&#xFF0C;&#x4F18;&#x5316;&#x66F4;&#x6FC0;&#x8FDB;&#x3002;&#x5728;&#x65B0;&#x6280;&#x672F;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x4E86;&#x89E3; Java10 &#x63D0;&#x4F9B;&#x7684;&#x7531; Java &#x5B9E;&#x73B0;&#x7684; Graal &#x7F16;&#x8BD1;&#x5668;&#x3002;</li>
<li>&#x7F16;&#x8BD1;&#x4F18;&#x5316;&#xFF1A;&#x524D;&#x7AEF;&#x7F16;&#x8BD1;&#x5668; javac &#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x3001;AST &#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x3001;&#x7F16;&#x8BD1;&#x671F;&#x4F18;&#x5316;&#x548C;&#x8FD0;&#x884C;&#x671F;&#x4F18;&#x5316;&#x3002;&#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x7684;&#x5E38;&#x7528;&#x6280;&#x672F;&#x5305;&#x62EC;&#x516C;&#x5171;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6D88;&#x9664;&#x3001;&#x65B9;&#x6CD5;&#x5185;&#x8054;&#x3001;&#x9003;&#x9038;&#x5206;&#x6790;&#x3001;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x3001;&#x540C;&#x6B65;&#x6D88;&#x9664;&#x7B49;&#x3002;&#x660E;&#x767D;&#x4E86;&#x8FD9;&#x4E9B;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x5BF9;&#x7F16;&#x8BD1;&#x5668;&#x53CB;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;</li>
</ol>
<p>JVM &#x7684;&#x5185;&#x5BB9;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x96C6;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x7684;&#x638C;&#x63E1;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x3002;</p>
<hr>
<h3 id="&#x8BE6;&#x89E3;-jvm-&#x5185;&#x5B58;&#x6A21;&#x578B;">&#x8BE6;&#x89E3; JVM &#x5185;&#x5B58;&#x6A21;&#x578B;</h3>
<p>JVM &#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E3B;&#x8981;&#x6307;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x6570;&#x636E;&#x533A;&#xFF0C;&#x5305;&#x62EC; 5 &#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14lumAchYcAAB51w2Hj9Y736.png?imageslim" alt=""></p>
<ol>
<li><p>&#x6808;&#x4E5F;&#x53EB;&#x65B9;&#x6CD5;&#x6808;&#xFF0C;&#x662F;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x7EBF;&#x7A0B;&#x5728;&#x6267;&#x884C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x65F6;&#x90FD;&#x4F1A;&#x540C;&#x65F6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x51FA;&#x53E3;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65F6;&#x6267;&#x884C;&#x5165;&#x6808;&#xFF0C;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x65F6;&#x6267;&#x884C;&#x51FA;&#x6808;&#x3002;</p>
</li>
<li><p>&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x4E0E;&#x6808;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x662F;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x65B9;&#x6CD5;&#x65F6;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6267;&#x884C; Java &#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x6808;&#xFF0C;&#x800C;&#x6267;&#x884C; native &#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x3002;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4FDD;&#x5B58;&#x7740;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6240;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x4F4D;&#x7F6E;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5DE5;&#x4F5C;&#x65F6;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x3002;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4E3A;&#x6267;&#x884C; Java &#x65B9;&#x6CD5;&#x670D;&#x52A1;&#xFF0C;&#x6267;&#x884C; native &#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4E3A;&#x7A7A;&#x3002;       </p>
<p>&#x6808;&#x3001;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x3001;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x8FD9;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x7EBF;&#x7A0B;&#x72EC;&#x5360;&#x7684;&#x3002;</p>
</li>
<li><p>&#x5806;&#x662F; JVM &#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x4E00;&#x5757;&#xFF0C;&#x5806;&#x88AB;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x3002;&#x5F53;&#x5806;&#x5185;&#x5B58;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x65F6;&#xFF0C;&#x4F1A;&#x629B;&#x51FA; OOM &#x5F02;&#x5E38;&#x3002;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#x7684;&#x5468;&#x671F;&#x4E0D;&#x540C;&#xFF0C;JVM &#x628A;&#x5806;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x5206;&#x4EE3;&#x7BA1;&#x7406;&#xFF0C;&#x7531;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6765;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x7684;&#x56DE;&#x6536;&#x7BA1;&#x7406;&#x3002;</p>
</li>
<li><p>&#x65B9;&#x6CD5;&#x533A;&#x4E5F;&#x662F;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x53C8;&#x53EB;&#x975E;&#x5806;&#x533A;&#x3002;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5DF2;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#xFF0C;JDK 1.7&#x4E2D;&#x7684;&#x6C38;&#x4E45;&#x4EE3;&#x548C;JDK 1.8 &#x4E2D;&#x7684; Metaspace &#x90FD;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x9762;&#x8BD5;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x8981;&#x7B54;&#x51FA;&#x4E24;&#x4E2A;&#x8981;&#x70B9;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x5404;&#x90E8;&#x5206;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x54EA;&#x4E9B;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#xFF0C;&#x54EA;&#x4E9B;&#x72EC;&#x5360;&#x3002;     </p>
</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;-jmm-&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;">&#x8BE6;&#x89E3; JMM &#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;</h3>
<p>JMM &#x662F; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x4E0E;&#x521A;&#x624D;&#x8BB2;&#x5230;&#x7684; JVM &#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x4E24;&#x56DE;&#x4E8B;&#xFF0C;JMM &#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x5B9A;&#x4E49;&#x7A0B;&#x5E8F;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x5171;&#x4EAB;&#x3002;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x662F;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x7EBF;&#x7A0B;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x7B49;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BFB;&#x5199;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14lumATjNyAAB-0Ie_3x8688.png?imageslim" alt=""></p>
<p>&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#x7EBF;&#x7A0B; A &#x7ED9;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x540E;&#xFF0C;&#x7531;&#x7EBF;&#x7A0B; B &#x6765;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;A &#x4FEE;&#x6539;&#x5B8C;&#x53D8;&#x91CF;&#x662F;&#x4FEE;&#x6539;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x533A;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;B &#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x4ECE; A &#x7684;&#x5DE5;&#x4F5C;&#x533A;&#x5199;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;B &#x518D;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x8BFB;&#x53D6;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x533A;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x4E2A;&#x5199;&#x2014;&#x8BFB;&#x7684;&#x987A;&#x5E8F;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x6253;&#x4E71;&#x3002;&#x56E0;&#x6B64;JMM&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<ol>
<li><p>&#x539F;&#x5B50;&#x6027;</p>
<p>JMM &#x4FDD;&#x8BC1;&#x5BF9;&#x9664; long &#x548C; double &#x5916;&#x7684;&#x57FA;&#x7840;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x7684;&#x3002;&#x53E6;&#x5916;&#x5173;&#x952E;&#x5B57; synchronized &#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x539F;&#x5B50;&#x6027;&#x4FDD;&#x8BC1;&#x3002;synchronized &#x7684;&#x539F;&#x5B50;&#x6027;&#x662F;&#x901A;&#x8FC7; Java &#x7684;&#x4E24;&#x4E2A;&#x9AD8;&#x7EA7;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4; monitorenter &#x548C; monitorexit &#x6765;&#x4FDD;&#x8BC1;&#x7684;&#x3002;</p>
</li>
<li><p>&#x53EF;&#x89C1;&#x6027;</p>
<p>JMM &#x53EF;&#x89C1;&#x6027;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x901A;&#x8FC7; synchronized&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5C31;&#x662F; volatile&#x3002;volatile &#x5F3A;&#x5236;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x4F1A;&#x540C;&#x6B65;&#x5237;&#x65B0;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x5F3A;&#x5236;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x53D6;&#x4F1A;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x603B;&#x662F;&#x80FD;&#x591F;&#x770B;&#x5230;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x6700;&#x65B0;&#x503C;&#x3002;</p>
</li>
<li><p>&#x6709;&#x5E8F;&#x6027;</p>
<p>&#x5BF9;&#x6709;&#x5E8F;&#x6027;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7; volatile &#x548C;&#x4E00;&#x7CFB;&#x5217; happens-before &#x539F;&#x5219;&#x3002;volatile &#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x963B;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x53D8;&#x91CF;&#x8BFB;&#x5199;&#x7684;&#x6709;&#x5E8F;&#x6027;&#x3002;</p>
<p>happens-before &#x539F;&#x5219;&#x5305;&#x62EC;&#x4E00;&#x7CFB;&#x5217;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x539F;&#x5219;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x8BED;&#x4E49;&#x4E32;&#x884C;&#x6027;&#xFF1B;</li>
<li>&#x9501;&#x89C4;&#x5219;&#xFF0C;&#x5373;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x7684;&#x89E3;&#x9501;&#x4E00;&#x5B9A;&#x53D1;&#x751F;&#x5728;&#x518D;&#x6B21;&#x52A0;&#x9501;&#x4E4B;&#x524D;&#xFF1B;</li>
<li>happens-before &#x539F;&#x5219;&#x7684;&#x4F20;&#x9012;&#x6027;&#x3001;&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x3001;&#x4E2D;&#x65AD;&#x3001;&#x7EC8;&#x6B62;&#x89C4;&#x5219;&#x7B49;&#x3002;</li>
</ul>
<h3 id="&#x8BE6;&#x89E3;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;">&#x8BE6;&#x89E3;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;</h3>
<p>&#x200B;    &#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x6307;&#x5C06;&#x7F16;&#x8BD1;&#x597D;&#x7684; Class &#x7C7B;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x7801;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5C06;&#x5176;&#x653E;&#x5728;&#x65B9;&#x6CD5;&#x533A;&#x5185;&#x5E76;&#x521B;&#x5EFA;&#x5BF9;&#x5E94;&#x7684; Class &#x5BF9;&#x8C61;&#x3002;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x5206;&#x4E3A;&#x52A0;&#x8F7D;&#x3001;&#x94FE;&#x63A5;&#x3001;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5176;&#x4E2D;&#x94FE;&#x63A5;&#x53C8;&#x5305;&#x62EC;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x3001;&#x89E3;&#x6790;&#x4E09;&#x6B65;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14lumAWI3bAACVhLcSULk171.png?imageslim" alt=""></p>
<ol>
<li>&#x52A0;&#x8F7D;&#x662F;&#x6587;&#x4EF6;&#x5230;&#x5185;&#x5B58;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x901A;&#x8FC7;&#x7C7B;&#x7684;&#x5B8C;&#x5168;&#x9650;&#x5B9A;&#x540D;&#x67E5;&#x627E;&#x6B64;&#x7C7B;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5229;&#x7528;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; Class &#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x9A8C;&#x8BC1;&#x662F;&#x5BF9;&#x7C7B;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x9A8C;&#x8BC1;&#x3002;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x786E;&#x4FDD; Class &#x6587;&#x4EF6;&#x7B26;&#x5408;&#x5F53;&#x524D;&#x865A;&#x62DF;&#x673A;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x4F1A;&#x5371;&#x5BB3;&#x865A;&#x62DF;&#x673A;&#x81EA;&#x8EAB;&#x5B89;&#x5168;&#x3002;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x56DB;&#x79CD;&#xFF1A;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x9A8C;&#x8BC1;&#xFF0C;&#x5143;&#x6570;&#x636E;&#x9A8C;&#x8BC1;&#xFF0C;&#x5B57;&#x8282;&#x7801;&#x9A8C;&#x8BC1;&#xFF0C;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x9A8C;&#x8BC1;&#x3002;</li>
<li>&#x51C6;&#x5907;&#x9636;&#x6BB5;&#x662F;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3002;&#x4E3A;&#x7C7B;&#x53D8;&#x91CF;&#x4E5F;&#x5C31;&#x662F;&#x7C7B;&#x4E2D;&#x7531; static &#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x4E14;&#x8BBE;&#x7F6E;&#x521D;&#x59CB;&#x503C;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x521D;&#x59CB;&#x503C;&#x662F; 0 &#x6216;&#x8005; null&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x5177;&#x4F53;&#x503C;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x503C;&#x662F;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x5305;&#x542B;&#x7528; final &#x4FEE;&#x9970;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;final&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x5206;&#x914D;&#x3002;</li>
<li>&#x89E3;&#x6790;&#x4E3B;&#x8981;&#x662F;&#x89E3;&#x6790;&#x5B57;&#x6BB5;&#x3001;&#x63A5;&#x53E3;&#x3001;&#x65B9;&#x6CD5;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x5C06;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x66FF;&#x6362;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x6307;&#x5411;&#x76EE;&#x6807;&#x7684;&#x6307;&#x9488;&#x3001;&#x76F8;&#x5BF9;&#x504F;&#x79FB;&#x91CF;&#x7B49;&#x3002;</li>
<li><p>&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4E3B;&#x8981;&#x5B8C;&#x6210;&#x9759;&#x6001;&#x5757;&#x6267;&#x884C;&#x4E0E;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x7C7B;&#x52A0;&#x8F7D;&#x6700;&#x540E;&#x9636;&#x6BB5;&#xFF0C;&#x82E5;&#x88AB;&#x52A0;&#x8F7D;&#x7C7B;&#x7684;&#x7236;&#x7C7B;&#x6CA1;&#x6709;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x5148;&#x5BF9;&#x7236;&#x7C7B;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p>&#x53EA;&#x6709;&#x5BF9;&#x7C7B;&#x4E3B;&#x52A8;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x7684;&#x89E6;&#x53D1;&#x6761;&#x4EF6;&#x5305;&#x62EC;&#x5728;&#x521B;&#x5EFA;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x65F6;&#x3001;&#x8BBF;&#x95EE;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x65F6;&#x3001;Class.forName() &#x53CD;&#x5C04;&#x7C7B;&#x65F6;&#x3001;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x5B50;&#x7C7B;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6D45;&#x7EFF;&#x7684;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x8868;&#x793A;&#x7C7B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x5C31;&#x662F;&#x4ECE;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x5230;&#x7C7B;&#x5B9E;&#x4F8B;&#x7684;&#x521B;&#x5EFA;&#x4E0E;&#x4F7F;&#x7528;&#xFF0C;&#x518D;&#x5230;&#x7C7B;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x4F7F;&#x7528;&#x65F6;&#x53EF;&#x4EE5;&#x88AB; GC &#x5378;&#x8F7D;&#x56DE;&#x6536;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x7531; Java &#x865A;&#x62DF;&#x673A;&#x81EA;&#x5E26;&#x7684;&#x4E09;&#x79CD;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x5728;&#x865A;&#x62DF;&#x673A;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x5378;&#x8F7D;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x6240;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x624D;&#x53EF;&#x4EE5;&#x88AB;&#x5378;&#x8F7D;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;">&#x8BE6;&#x89E3;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</h3>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14luqAA8NAAABwXhjZrug069.png?imageslim" alt=""></p>
<p>&#x200B;    &#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;Java &#x81EA;&#x5E26;&#x7684;&#x4E09;&#x79CD;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5206;&#x522B;&#x662F;&#xFF1A;BootStrap &#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3001;&#x6269;&#x5C55;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x548C;&#x5E94;&#x7528;&#x52A0;&#x8F7D;&#x5668;&#xFF08;&#x4E5F;&#x53EB;&#x7CFB;&#x7EDF;&#x52A0;&#x8F7D;&#x5668;&#xFF09;&#x3002;&#x56FE;&#x53F3;&#x8FB9;&#x7684;&#x6854;&#x9EC4;&#x8272;&#x6587;&#x5B57;&#x8868;&#x793A;&#x5404;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5BF9;&#x5E94;&#x7684;&#x52A0;&#x8F7D;&#x76EE;&#x5F55;&#x3002;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D; java home &#x4E2D; lib &#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x7C7B;&#xFF0C;&#x6269;&#x5C55;&#x52A0;&#x8F7D;&#x5668;&#x8D1F;&#x8D23;&#x52A0;&#x8F7D; ext &#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x7C7B;&#xFF0C;&#x5E94;&#x7528;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D; classpath &#x6307;&#x5B9A;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x7C7B;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;</p>
<p>&#x200B;    Java &#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x4F7F;&#x7528;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x5F0F;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5728;&#x52A0;&#x8F7D;&#x7C7B;&#x65F6;&#xFF0C;&#x5148;&#x628A;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x59D4;&#x6258;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8FD8;&#x5B58;&#x5728;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5C31;&#x7EE7;&#x7EED;&#x5411;&#x4E0A;&#x59D4;&#x6258;&#xFF0C;&#x76F4;&#x5230;&#x9876;&#x5C42;&#x7684;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x84DD;&#x8272;&#x5411;&#x4E0A;&#x7684;&#x7BAD;&#x5934;&#x3002;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x7C7B;&#x52A0;&#x8F7D;&#xFF0C;&#x5C31;&#x6210;&#x529F;&#x8FD4;&#x56DE;&#xFF0C;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x52A0;&#x8F7D;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x52A0;&#x8F7D;&#x5668;&#x624D;&#x4F1A;&#x5C1D;&#x8BD5;&#x81EA;&#x5DF1;&#x53BB;&#x52A0;&#x8F7D;&#x3002;&#x5982;&#x56FE;&#x4E2D;&#x7684;&#x6854;&#x9EC4;&#x8272;&#x5411;&#x4E0B;&#x7684;&#x7BAD;&#x5934;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x5F0F;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7C7B;&#x7684;&#x91CD;&#x590D;&#x52A0;&#x8F7D;&#xFF0C;&#x53E6;&#x5916;&#x4E5F;&#x907F;&#x514D;&#x4E86; Java &#x7684;&#x6838;&#x5FC3; API &#x88AB;&#x7BE1;&#x6539;&#x3002;</p>
<hr>
<h3 id="&#x8BE6;&#x89E3;&#x5206;&#x4EE3;&#x56DE;&#x6536;">&#x8BE6;&#x89E3;&#x5206;&#x4EE3;&#x56DE;&#x6536;</h3>
<p>&#x200B;    Java &#x7684;&#x5806;&#x5185;&#x5B58;&#x88AB;&#x5206;&#x4EE3;&#x7BA1;&#x7406;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5206;&#x4EE3;&#x7BA1;&#x7406;&#x5462;&#xFF1F;&#x5206;&#x4EE3;&#x7BA1;&#x7406;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x57FA;&#x4E8E;2&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x5F88;&#x5FEB;&#x5C31;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x65E0;&#x7528;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x4F1A;&#x6301;&#x7EED;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x5212;&#x5206;&#x4E3A;&#x5E74;&#x8F7B;&#x4EE3;&#x3001;&#x8001;&#x5E74;&#x4EE3;&#x3001;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14luqAFGZHAABEqvU94zM441.png?imageslim" alt=""></p>
</li>
<li><p>&#x5E74;&#x8F7B;&#x4EE3;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x5B58;&#x653E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;&#x5206;&#x4E3A; Eden &#x533A;&#x548C;&#x4E24;&#x4E2A; Survivor &#x533A;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x5728; Eden &#x533A;&#x4E2D;&#x751F;&#x6210;&#x3002;&#x5F53;Eden&#x533A;&#x6EE1;&#x65F6;&#xFF0C;&#x8FD8;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x5728;&#x4E24;&#x4E2A;Survivor&#x533A;&#x4EA4;&#x66FF;&#x4FDD;&#x5B58;&#xFF0C;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x6B21;&#x6570;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x664B;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;</p>
</li>
<li><p>&#x8001;&#x5E74;&#x4EE3;&#x7528;&#x6765;&#x5B58;&#x653E;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x664B;&#x5347;&#x800C;&#x6765;&#x7684;&#xFF0C;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
<li><p>&#x6C38;&#x4E45;&#x4EE3;&#xFF0C;&#x4E3B;&#x8981;&#x4FDD;&#x5B58;&#x7C7B;&#x4FE1;&#x606F;&#x7B49;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6C38;&#x4E45;&#x4EE3;&#x662F;&#x6307;&#x5BF9;&#x8C61;&#x5212;&#x5206;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x662F;&#x4E13;&#x6307; 1.7 &#x7684; PermGen&#xFF0C;&#x6216;&#x8005; 1.8 &#x4E4B;&#x540E;&#x7684; Metaspace&#x3002;</p>
<p>&#x200B;    &#x6839;&#x636E;&#x5E74;&#x8F7B;&#x4EE3;&#x4E0E;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x7279;&#x70B9;&#xFF0C;JVM &#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x3002;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x6309;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x3001;&#x590D;&#x5236;&#x6CD5;&#x548C;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x8C61;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x9700;&#x8981; from &#x548C; to &#x4E24;&#x5757;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x65F6;&#x53EA;&#x5728; from &#x5757;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x56DE;&#x6536;&#x65F6;&#x628A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230; to &#x5757;&#x4E2D;&#xFF0C;&#x5E76;&#x6E05;&#x7A7A; from &#x5757;&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x6362;&#x4E24;&#x5757;&#x7684;&#x5206;&#x5DE5;&#xFF0C;&#x5373;&#x628A; from &#x5757;&#x4F5C;&#x4E3A; to &#x5757;&#xFF0C;&#x628A; to &#x5757;&#x4F5C;&#x4E3A; from &#x5757;&#x3002;&#x7F3A;&#x70B9;&#x662F;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x7387;&#x8F83;&#x4F4E;&#x3002;</p>
</li>
<li><p>&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x548C;&#x6E05;&#x9664;&#x4E0D;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x4F1A;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#x3002;</p>
<p>JVM &#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x5E74;&#x8F7B;&#x4EE3;&#x56DE;&#x6536;&#x7B97;&#x6CD5; Serial&#x3001;ParNew&#x3001;Parallel Scavenge &#x90FD;&#x662F;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x800C; CMS&#x3001;G1&#x3001;ZGC &#x90FD;&#x5C5E;&#x4E8E;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;-cms-&#x7B97;&#x6CD5;">&#x8BE6;&#x89E3; CMS &#x7B97;&#x6CD5;</h3>
<p>&#x57FA;&#x4E8E;&#x5206;&#x4EE3;&#x56DE;&#x6536;&#x7406;&#x8BBA;&#xFF0C;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x5148;&#x6765;&#x770B; CMS &#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x3002;CMS &#x5728; JDK1.7 &#x4E4B;&#x524D;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x4E3B;&#x6D41;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x3002;CMS &#x4F7F;&#x7528;&#x6807;&#x8BB0;&#x6E05;&#x9664;&#x7B97;&#x6CD5;&#xFF0C;&#x4F18;&#x70B9;&#x662F;&#x5E76;&#x53D1;&#x6536;&#x96C6;&#xFF0C;&#x505C;&#x987F;&#x5C0F;&#x3002;</p>
<p>CMS &#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14luqAB61oAABezTrv-gg961.png?imageslim" alt=""></p>
<ol>
<li>&#x7B2C;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4F1A; stop the world&#xFF0C;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x53EA;&#x662F;&#x4ECE; root &#x96C6;&#x6700;&#x76F4;&#x63A5;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#xFF0C;&#x8FD9;&#x65F6; GC &#x7EBF;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x6807;&#x8BB0;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;</li>
<li>&#x7B2C;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A; stop the world &#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6BD4;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x8981;&#x5C0F;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x6BD4;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x7A0D;&#x957F;&#xFF0C;&#x4E3B;&#x8981;&#x5BF9;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x626B;&#x63CF;&#x5E76;&#x6807;&#x8BB0;&#xFF1B;</li>
<li>&#x7B2C;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x5E76;&#x53D1;&#x6E05;&#x7406;&#x9636;&#x6BB5;&#xFF0C;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x7684;&#x5783;&#x573E;&#x6E05;&#x7406;&#xFF1B;</li>
<li>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x5E76;&#x53D1;&#x91CD;&#x7F6E;&#x9636;&#x6BB5;&#xFF0C;&#x4E3A;&#x4E0B;&#x4E00;&#x6B21; GC &#x91CD;&#x7F6E;&#x76F8;&#x5173;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;g1&#x7B97;&#x6CD5;">&#x8BE6;&#x89E3;G1&#x7B97;&#x6CD5;</h3>
<p>G1 &#x5728; 1.9 &#x7248;&#x672C;&#x540E;&#x6210;&#x4E3A; JVM &#x7684;&#x9ED8;&#x8BA4;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;G1 &#x7684;&#x7279;&#x70B9;&#x662F;&#x4FDD;&#x6301;&#x9AD8;&#x56DE;&#x6536;&#x7387;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x51CF;&#x5C11;&#x505C;&#x987F;&#x3002;</p>
<p>G1 &#x7B97;&#x6CD5;&#x53D6;&#x6D88;&#x4E86;&#x5806;&#x4E2D;&#x5E74;&#x8F7B;&#x4EE3;&#x4E0E;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x7269;&#x7406;&#x5212;&#x5206;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x7136;&#x5C5E;&#x4E8E;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x5668;&#x3002;G1 &#x7B97;&#x6CD5;&#x5C06;&#x5806;&#x5212;&#x5206;&#x4E3A;&#x82E5;&#x5E72;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x79F0;&#x4F5C; Region&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x4E2D;&#x7684;&#x5C0F;&#x65B9;&#x683C;&#x6240;&#x793A;&#x3002;&#x4E00;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x7528;&#x4F5C;&#x5E74;&#x8F7B;&#x4EE3;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x4F5C;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x5DE8;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x5206;&#x533A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14luqAR5suAAB5tOFWo20859.png?imageslim" alt=""></p>
<p>G1 &#x4E5F;&#x548C;CMS&#x4E00;&#x6837;&#x4F1A;&#x904D;&#x5386;&#x5168;&#x90E8;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x6807;&#x8BB0;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x6E05;&#x9664;&#x5BF9;&#x8C61;&#x540E;&#x4F1A;&#x5BF9;&#x533A;&#x57DF;&#x8FDB;&#x884C;&#x590D;&#x5236;&#x79FB;&#x52A8;&#x6574;&#x5408;&#x788E;&#x7247;&#x7A7A;&#x95F4;&#x3002;</p>
<p>G1 &#x56DE;&#x6536;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x3002;</p>
<ol>
<li><p>G1 &#x7684;&#x5E74;&#x8F7B;&#x4EE3;&#x56DE;&#x6536;&#xFF0C;&#x91C7;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x884C;&#x8FDB;&#x884C;&#x6536;&#x96C6;&#xFF0C;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4F1A; STW&#x3002;</p>
</li>
<li><p>G1 &#x7684;&#x8001;&#x5E74;&#x4EE3;&#x56DE;&#x6536;&#x65F6;&#x4E5F;&#x540C;&#x65F6;&#x4F1A;&#x5BF9;&#x5E74;&#x8F7B;&#x4EE3;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x4F9D;&#x7136;&#x662F;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x5B8C;&#x6210;&#x5BF9;&#x6839;&#x5BF9;&#x8C61;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;STW&#x7684;&#xFF1B;</li>
<li>&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x548C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#xFF1B;</li>
<li>&#x6700;&#x7EC8;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#xFF0C;&#x5B8C;&#x6210;&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x5468;&#x671F;&#xFF1B;</li>
<li>&#x590D;&#x5236;/&#x6E05;&#x9664;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4F1A;&#x4F18;&#x5148;&#x5BF9;&#x53EF;&#x56DE;&#x6536;&#x7A7A;&#x95F4;&#x8F83;&#x5927;&#x7684; Region &#x8FDB;&#x884C;&#x56DE;&#x6536;&#xFF0C;&#x5373; garbage first&#xFF0C;&#x8FD9;&#x4E5F;&#x662F; G1 &#x540D;&#x79F0;&#x7684;&#x7531;&#x6765;&#x3002;</li>
</ul>
<p>G1 &#x91C7;&#x7528;&#x6BCF;&#x6B21;&#x53EA;&#x6E05;&#x7406;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x7684; Region &#x7684;&#x589E;&#x91CF;&#x5F0F;&#x6E05;&#x7406;&#xFF0C;&#x7531;&#x6B64;&#x6765;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21; GC &#x505C;&#x987F;&#x65F6;&#x95F4;&#x4E0D;&#x4F1A;&#x8FC7;&#x957F;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF0C;G1 &#x662F;&#x903B;&#x8F91;&#x5206;&#x4EE3;&#x4E0D;&#x662F;&#x7269;&#x7406;&#x5212;&#x5206;&#xFF0C;&#x9700;&#x8981;&#x77E5;&#x9053;&#x56DE;&#x6536;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x505C;&#x987F;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x6B64;&#x5916;&#x8FD8;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF0C;G1 &#x7B97;&#x6CD5;&#x5141;&#x8BB8;&#x901A;&#x8FC7; JVM &#x53C2;&#x6570;&#x8BBE;&#x7F6E; Region &#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8303;&#x56F4;&#x662F; 1&#xFF5E;32MB&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x671F;&#x671B;&#x7684;&#x6700;&#x5927; GC &#x505C;&#x987F;&#x65F6;&#x95F4;&#x7B49;&#x3002;&#x6709;&#x5174;&#x8DA3;&#x8BFB;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9; CMS &#x548C; G1 &#x4F7F;&#x7528;&#x7684;&#x4E09;&#x8272;&#x6807;&#x8BB0;&#x7B97;&#x6CD5;&#x505A;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;zgc&#x7B97;&#x6CD5;">&#x8BE6;&#x89E3;ZGC&#x7B97;&#x6CD5;</h3>
<h4 id="zgc-&#x7279;&#x70B9;"><strong>ZGC &#x7279;&#x70B9;</strong></h4>
<p>ZGC &#x662F;&#x6700;&#x65B0;&#x7684; JDK1.11 &#x7248;&#x672C;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x9AD8;&#x6548;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;ZGC &#x9488;&#x5BF9;&#x5927;&#x5806;&#x5185;&#x5B58;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x652F;&#x6301; TB &#x7EA7;&#x522B;&#x7684;&#x5806;&#xFF0C;ZGC &#x975E;&#x5E38;&#x9AD8;&#x6548;&#xFF0C;&#x80FD;&#x591F;&#x505A;&#x5230; 10ms &#x4EE5;&#x4E0B;&#x7684;&#x56DE;&#x6536;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8FD9;&#x4E48;&#x5FEB;&#x7684;&#x54CD;&#x5E94;&#xFF0C;ZGC &#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x7684;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x7531;&#x4E8E; ZGC &#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#x3002;</p>
<ol>
<li>ZGC &#x4F7F;&#x7528;&#x4E86;&#x7740;&#x8272;&#x6307;&#x9488;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053; 64 &#x4F4D;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x7684;&#x53EF;&#x7528;&#x4F4D;&#x662F; 64 &#x4F4D;&#xFF0C;ZGC &#x9650;&#x5236;&#x6700;&#x5927;&#x652F;&#x6301; 4TB &#x7684;&#x5806;&#xFF0C;&#x8FD9;&#x6837;&#x5BFB;&#x5740;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528; 42 &#x4F4D;&#xFF0C;&#x90A3;&#x4E48;&#x5269;&#x4E0B; 22 &#x4F4D;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x7740;&#x8272;&#x6307;&#x9488;&#x6280;&#x672F;&#x5C31;&#x662F;&#x5229;&#x7528;&#x6307;&#x9488;&#x7684;&#x989D;&#x5916;&#x4FE1;&#x606F;&#x4F4D;&#xFF0C;&#x5728;&#x6307;&#x9488;&#x4E0A;&#x5BF9;&#x5BF9;&#x8C61;&#x505A;&#x7740;&#x8272;&#x6807;&#x8BB0;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x4F7F;&#x7528;&#x8BFB;&#x5C4F;&#x969C;&#xFF0C;ZGC &#x4F7F;&#x7528;&#x8BFB;&#x5C4F;&#x969C;&#x6765;&#x89E3;&#x51B3; GC &#x7EBF;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x5E76;&#x53D1;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;&#x901A;&#x8FC7; STW &#x6765;&#x8FDB;&#x884C;&#x5168;&#x5C40;&#x7684;&#x9501;&#x5B9A;&#x3002;&#x4F7F;&#x7528;&#x8BFB;&#x5C4F;&#x969C;&#x53EA;&#x4F1A;&#x5728;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5904;&#x7406;&#x4E0A;&#x6709;&#x6982;&#x7387;&#x88AB;&#x51CF;&#x901F;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x8BFB;&#x5C4F;&#x969C;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x4E0D;&#x9700;&#x8981; STW &#x7684;&#xFF0C;&#x56E0;&#x6B64; ZGC &#x7684;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5E76;&#x53D1;&#x5904;&#x7406;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; ZGC &#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x7279;&#x70B9;&#x3002;</li>
<li>&#x7B2C;&#x56DB;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x57FA;&#x4E8E; Region&#xFF0C;&#x8FD9;&#x4E0E; G1 &#x7B97;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8FC7;&#x867D;&#x7136;&#x4E5F;&#x5206;&#x4E86; Region&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x5206;&#x4EE3;&#x3002;ZGC &#x7684; Region &#x4E0D;&#x50CF; G1 &#x90A3;&#x6837;&#x662F;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x662F;&#x52A8;&#x6001;&#x5730;&#x51B3;&#x5B9A; Region &#x7684;&#x5927;&#x5C0F;&#xFF0C;Region &#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x5BF9;&#x5927;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5206;&#x914D;&#x7BA1;&#x7406;&#x3002;</li>
<li>&#x7B2C;&#x4E94;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x538B;&#x7F29;&#x6574;&#x7406;&#x3002;CMS &#x7B97;&#x6CD5;&#x6E05;&#x7406;&#x5BF9;&#x8C61;&#x65F6;&#x539F;&#x5730;&#x56DE;&#x6536;&#xFF0C;&#x4F1A;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x788E;&#x7247;&#x95EE;&#x9898;&#x3002;ZGC &#x548C; G1 &#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x4F1A;&#x5728;&#x56DE;&#x6536;&#x540E;&#x5BF9; Region &#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#x5408;&#x5E76;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x788E;&#x7247;&#x95EE;&#x9898;&#x3002;</li>
</ol>
<p>&#x867D;&#x7136; ZGC &#x7684;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x662F;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x4F1A;&#x6709;&#x77ED;&#x6682;&#x7684;&#x505C;&#x987F;&#x3002;&#x6765;&#x770B;&#x4E00;&#x4E0B; ZGC &#x7684;&#x56DE;&#x6536;&#x8FC7;&#x7A0B;&#x3002;</p>
<hr>
<h4 id="zgc-&#x56DE;&#x6536;&#x8FC7;&#x7A0B;"><strong>ZGC &#x56DE;&#x6536;&#x8FC7;&#x7A0B;</strong></h4>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4F7F;&#x7528; ZGC &#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#xFF0C;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0B;&#x770B;&#x3002;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x5806;&#x7A7A;&#x95F4;&#x88AB;&#x5212;&#x5206;&#x4E3A;&#x5927;&#x5C0F;&#x4E0D;&#x7B49;&#x7684;&#x8BB8;&#x591A; Region&#xFF0C;&#x5373;&#x56FE;&#x4E2D;&#x7EFF;&#x8272;&#x7684;&#x65B9;&#x5757;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14luqAauqUAAB6N4rQvYU477.png?imageslim" alt=""></p>
<p>&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x65F6;&#xFF0C;ZGC &#x9996;&#x5148;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x77ED;&#x6682;&#x7684; STW&#xFF0C;&#x6765;&#x8FDB;&#x884C; roots &#x6807;&#x8BB0;&#x3002;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x975E;&#x5E38;&#x77ED;&#xFF0C;&#x56E0;&#x4E3A; roots &#x7684;&#x603B;&#x6570;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x5C0F;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x5BF9;&#x8C61;&#x6307;&#x9488;&#x8FDB;&#x884C;&#x7740;&#x8272;&#x6765;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x7ED3;&#x5408;&#x8BFB;&#x5C4F;&#x969C;&#x89E3;&#x51B3;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x5728;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x77ED;&#x7684; STW &#x505C;&#x987F;&#xFF0C;&#x7528;&#x6765;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x662F;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x6807;&#x51FA;&#x8FD9;&#x4E2A;&#x505C;&#x987F;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x662F;&#x6E05;&#x7406;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4F1A;&#x628A;&#x6807;&#x8BB0;&#x4E3A;&#x4E0D;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x628A;&#x6A58;&#x8272;&#x7684;&#x4E0D;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x91CD;&#x5B9A;&#x4F4D;&#xFF0C;&#x91CD;&#x5B9A;&#x4F4D;&#x5C31;&#x662F;&#x5BF9; GC &#x540E;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#xFF0C;&#x6765;&#x91CA;&#x653E;&#x5927;&#x5757;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x89E3;&#x51B3;&#x788E;&#x7247;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x91CD;&#x5B9A;&#x4F4D;&#x6700;&#x5F00;&#x59CB;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x77ED;&#x6682;&#x7684; STW&#xFF0C;&#x7528;&#x6765;&#x91CD;&#x5B9A;&#x4F4D;&#x96C6;&#x5408;&#x4E2D;&#x7684; root &#x5BF9;&#x8C61;&#x3002;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E; root &#x7684;&#x6570;&#x91CF;&#x3001;&#x91CD;&#x5B9A;&#x4F4D;&#x96C6;&#x4E0E;&#x5BF9;&#x8C61;&#x7684;&#x603B;&#x6D3B;&#x52A8;&#x96C6;&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
<p>&#x6700;&#x540E;&#x662F;&#x5E76;&#x53D1;&#x91CD;&#x5B9A;&#x4F4D;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x8BFB;&#x5C4F;&#x969C;&#xFF0C;&#x4E0E;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#x3002;</p>
<h3 id="&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;">&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;</h3>
<h4 id="&#x8003;&#x5BDF;&#x70B9;"><strong>&#x8003;&#x5BDF;&#x70B9;</strong></h4>
<p>&#x603B;&#x7ED3; JVM &#x76F8;&#x5173;&#x7684;&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x6DF1;&#x5165;&#x4E86;&#x89E3; JVM &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x548C; Java &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF1B;</li>
<li>&#x8981;&#x4E86;&#x89E3;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E86;&#x89E3;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x673A;&#x5236;&#xFF1B;</li>
<li>&#x8981;&#x7406;&#x89E3;&#x5185;&#x5B58;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x4E0E; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x5BF9;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x6709;&#x5E8F;&#x6027;&#x7684;&#x4FDD;&#x8BC1;&#x673A;&#x5236;&#xFF1B;</li>
<li>&#x8981;&#x4E86;&#x89E3;&#x5E38;&#x7528;&#x7684; GC &#x7B97;&#x6CD5;&#x7684;&#x7279;&#x70B9;&#x3001;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#xFF0C;&#x548C;&#x9002;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982; G1 &#x9002;&#x5408;&#x5BF9;&#x6700;&#x5927;&#x5EF6;&#x8FDF;&#x6709;&#x8981;&#x6C42;&#x7684;&#x573A;&#x5408;&#xFF0C;ZGC &#x9002;&#x7528;&#x4E8E; 64 &#x4F4D;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x5185;&#x5B58;&#x670D;&#x52A1;&#x4E2D;&#xFF1B;</li>
<li>&#x8981;&#x4E86;&#x89E3;&#x5E38;&#x7528;&#x7684; JVM &#x53C2;&#x6570;&#xFF0C;&#x660E;&#x767D;&#x5BF9;&#x4E0D;&#x540C;&#x53C2;&#x6570;&#x7684;&#x8C03;&#x6574;&#x4F1A;&#x6709;&#x600E;&#x6837;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x9002;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5E76;&#x53D1;&#x6570;&#x3001;&#x504F;&#x5411;&#x9501;&#x8BBE;&#x7F6E;&#x7B49;&#x3002;</li>
</ol>
<h4 id="&#x52A0;&#x5206;&#x9879;"><strong>&#x52A0;&#x5206;&#x9879;</strong></h4>
<p>&#x5982;&#x679C;&#x60F3;&#x8981;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x7559;&#x4E0B;&#x66F4;&#x597D;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x4E9B;&#x52A0;&#x5206;&#x9879;&#x3002;</p>
<ol>
<li>&#x5982;&#x679C;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x65B9;&#x9762;&#x6709;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x89C9;&#x5F97;&#x4F60;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x6DF1;&#x5EA6;&#x6BD4;&#x8F83;&#x6709;&#x8FFD;&#x6C42;&#x3002;&#x4F8B;&#x5982;&#x77E5;&#x9053;&#x5728;&#x7F16;&#x7A0B;&#x65F6;&#x5982;&#x4F55;&#x5408;&#x7406;&#x5229;&#x7528;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x964D;&#x4F4E; GC &#x538B;&#x529B;&#x3001;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x9002;&#x5408;&#x5185;&#x8054;&#x4F18;&#x5316;&#x7B49;&#x4EE3;&#x7801;&#x7B49;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x80FD;&#x6709;&#x7EBF;&#x4E0A;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x7684;&#x6392;&#x67E5;&#x7ECF;&#x9A8C;&#x6216;&#x601D;&#x8DEF;&#x90A3;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x90FD;&#x559C;&#x6B22;&#x52A8;&#x624B;&#x80FD;&#x529B;&#x5F3A;&#x7684;&#x540C;&#x5B66;&#x3002;&#x4F8B;&#x5982;&#x89E3;&#x51B3;&#x8FC7;&#x7EBF;&#x4E0A;&#x7ECF;&#x5E38; FullGC &#x95EE;&#x9898;&#xFF0C;&#x6392;&#x67E5;&#x8FC7;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x95EE;&#x9898;&#x7B49;&#x3002;</li>
<li>&#x5982;&#x679C;&#x80FD;&#x6709;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x7684; JVM &#x4F18;&#x5316;&#x5B9E;&#x8DF5;&#x6216;&#x8005;&#x4F18;&#x5316;&#x601D;&#x8DEF;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x6548;&#x679C;&#x3002;&#x4F8B;&#x5982;&#x9488;&#x5BF9;&#x9AD8;&#x5E76;&#x53D1;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5982;&#x4F55;&#x8C03;&#x6574; GC &#x53C2;&#x6570;&#x5C3D;&#x91CF;&#x964D;&#x4F4E; GC &#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF0C;&#x9488;&#x5BF9;&#x961F;&#x5217;&#x5904;&#x7406;&#x673A;&#x5982;&#x4F55;&#x5C3D;&#x53EF;&#x80FD;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x7387;&#x7B49;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x5BF9;&#x6700;&#x65B0;&#x7684; JVM &#x6280;&#x672F;&#x8D8B;&#x52BF;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x4F1A;&#x7ED9;&#x9762;&#x8BD5;&#x5B98;&#x7559;&#x4E0B;&#x6BD4;&#x8F83;&#x6DF1;&#x523B;&#x7684;&#x5370;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#x4E86;&#x89E3; ZGC &#x9AD8;&#x6548;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF0C;&#x4E86;&#x89E3; Graalvm &#x7684;&#x7279;&#x70B9;&#x7B49;&#x3002;</li>
</ol>
<h3 id="&#x771F;&#x9898;&#x6C47;&#x603B;">&#x771F;&#x9898;&#x6C47;&#x603B;</h3>
<p>&#x603B;&#x7ED3; JVM &#x76F8;&#x5173;&#x7684;&#x9762;&#x8BD5;&#x771F;&#x9898;&#xFF0C;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x771F;&#x9898;&#x5982;&#x4E0B;&#xFF0C;&#x8BFE;&#x540E;&#x53EF;&#x4EE5;&#x91CD;&#x70B9;&#x7EC3;&#x4E60;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14luqALq0IAACqj_5S_nw868.png?imageslim" alt=""></p>
<p>&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<ul>
<li>&#x7B2C; 1 &#x9898; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x524D;&#x9762;&#x8BB2;&#x8FC7;&#xFF0C;&#x9762;&#x8BD5;&#x65F6;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#x8BB0;&#x5F97;&#x548C;&#x9762;&#x8BD5;&#x5B98;&#x786E;&#x8BA4;&#x662F;&#x5E0C;&#x671B;&#x56DE;&#x7B54; JVM &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x8FD8;&#x662F; Java &#x5BF9;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E0D;&#x8981;&#x7B54;&#x8DD1;&#x504F;&#x3002;</li>
<li>&#x7B2C; 2 &#x9898;&#x8981;&#x590D;&#x4E60;&#x4E0B;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x4E0B;&#x4F1A;&#x89E6;&#x53D1; FullGC&#xFF0C;&#x4F8B;&#x5982;&#x5E74;&#x8F7B;&#x4EE3;&#x664B;&#x5347;&#x65F6;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#xFF0C;&#x4F8B;&#x5982;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x7B49;&#x3002;</li>
<li>&#x7B2C; 3&#xFF5E;6 &#x9898;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x6709;&#x8FC7;&#x8BB2;&#x89E3;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x518D;&#x91CD;&#x590D;&#x3002;</li>
</ul>
<p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x771F;&#x9898;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14luuAJqWRAACFJ6QM8Tg783.png?imageslim" alt=""></p>
<p>&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<ul>
<li>&#x7B2C; 7 &#x9898; volatile &#x8981;&#x91CD;&#x70B9;&#x56DE;&#x7B54;&#x5F3A;&#x5236;&#x4E3B;&#x5185;&#x5B58;&#x8BFB;&#x5199;&#x540C;&#x6B65;&#x4EE5;&#x53CA;&#x9632;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x4E24;&#x70B9;&#x3002;</li>
<li>&#x7B2C; 8&#x3001;9 &#x9898;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x8BB2;&#x8FC7;&#x3002;</li>
<li>&#x7B2C; 10 &#x9898;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x51FA;&#x5F3A;&#x3001;&#x5F31;&#x3001;&#x8F6F;&#x3001;&#x865A;&#x56DB;&#x79CD;&#x5F15;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5728; GC &#x4E2D;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x7B2C; 11 &#x9898;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x4E00;&#x4E0B; Java &#x81EA;&#x5E26;&#x7684;&#x51E0;&#x79CD;&#x5DE5;&#x5177;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982; JMC &#x4E2D;&#x7684;&#x98DE;&#x884C;&#x8BB0;&#x5F55;&#x5668;&#xFF0C;&#x5806;&#x5206;&#x6790;&#x5DE5;&#x5177; MAT&#xFF0C;&#x7EBF;&#x7A0B;&#x5206;&#x6790;&#x5DE5;&#x5177; jstack &#x548C;&#x83B7;&#x53D6;&#x5806;&#x4FE1;&#x606F;&#x7684; jmap &#x7B49;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第3节：Java语言特性与设计模式.html" class="navigation navigation-prev " aria-label="Previous page: 第3节：Java语言特性与设计模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第5节：并发与多线程.html" class="navigation navigation-next " aria-label="Next page: 第5节：并发与多线程">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第4节：深入浅出JVM","level":"1.3.5","depth":2,"next":{"title":"第5节：并发与多线程","level":"1.3.6","depth":2,"path":"32个Java面试必考点/第5节：并发与多线程.md","ref":"32个Java面试必考点/第5节：并发与多线程.md","articles":[]},"previous":{"title":"第3节：Java语言特性与设计模式","level":"1.3.4","depth":2,"path":"32个Java面试必考点/第3节：Java语言特性与设计模式.md","ref":"32个Java面试必考点/第3节：Java语言特性与设计模式.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第4节：深入浅出JVM.md","mtime":"2021-05-09T13:31:18.208Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

