
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第6节：数据结构与算法 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第7节：常用工具集.html" />
    
    
    <link rel="prev" href="第5节：并发与多线程.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="第1节：技术人职业发展路径.html">
            
                <a href="第1节：技术人职业发展路径.html">
            
                    
                    第1节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第2节：操作系统与计算机网络.html">
            
                <a href="第2节：操作系统与计算机网络.html">
            
                    
                    第2节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="第3节：Java语言特性与设计模式.html">
            
                <a href="第3节：Java语言特性与设计模式.html">
            
                    
                    第3节：Java语言特性与设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="第4节：深入浅出JVM.html">
            
                <a href="第4节：深入浅出JVM.html">
            
                    
                    第4节：深入浅出JVM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="第5节：并发与多线程.html">
            
                <a href="第5节：并发与多线程.html">
            
                    
                    第5节：并发与多线程
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.7" data-path="第6节：数据结构与算法.html">
            
                <a href="第6节：数据结构与算法.html">
            
                    
                    第6节：数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="第7节：常用工具集.html">
            
                <a href="第7节：常用工具集.html">
            
                    
                    第7节：常用工具集
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="第8节：必会框架--Spring全家桶.html">
            
                <a href="第8节：必会框架--Spring全家桶.html">
            
                    
                    第8节：必会框架--Spring全家桶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="第9节：必会框架--RPC与ORM.html">
            
                <a href="第9节：必会框架--RPC与ORM.html">
            
                    
                    第9节：必会框架--RPC与ORM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="第10节：消息队列Kafka架构与原理.html">
            
                <a href="第10节：消息队列Kafka架构与原理.html">
            
                    
                    第10节：消息队列Kafka架构与原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="第11节：MySQL调优与最佳实践.html">
            
                <a href="第11节：MySQL调优与最佳实践.html">
            
                    
                    第11节：MySQL调优与最佳实践
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="第12节：架构的演进之路与前言技术.html">
            
                <a href="第12节：架构的演进之路与前言技术.html">
            
                    
                    第12节：架构的演进之路与前言技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="彩蛋：技术人行走职场的建议.html">
            
                <a href="彩蛋：技术人行走职场的建议.html">
            
                    
                    彩蛋：技术人行走职场的建议
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第6节：数据结构与算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[toc]</p>
<h2 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;</h2>
<p>&#x672C;&#x8282;&#x7684;&#x4E3B;&#x9898;&#x4E3A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x3002;&#x884C;&#x4E1A;&#x91CC;&#x6D41;&#x884C;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF1A;&#x7A0B;&#x5E8F; = &#x6570;&#x636E;&#x7ED3;&#x6784; + &#x7B97;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x6709;&#x4E9B;&#x5938;&#x5F20;&#xFF0C;&#x4F46;&#x8DB3;&#x4EE5;&#x8BF4;&#x660E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x672C;&#x8BFE;&#x65F6;&#x91CD;&#x70B9;&#x8BB2;&#x89E3;&#x56DB;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x4ECE;&#x641C;&#x7D22;&#x6811;&#x5230; B+ &#x6811;&#xFF0C;&#x8BB2;&#x89E3;&#x4E0E;&#x6811;&#x6709;&#x5173;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1B;</li>
<li>&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x76F8;&#x5173;&#x7684;&#x9898;&#x76EE;&#xFF1B;</li>
<li>&#x7B97;&#x6CD5;&#x9762;&#x8BD5;&#x7ECF;&#x5E38;&#x8003;&#x5BDF;&#x7684; TopK &#x95EE;&#x9898;&#xFF1B;</li>
<li>&#x7B97;&#x6CD5;&#x9898;&#x7684;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<hr>
<h3 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x77E5;&#x8BC6;&#x70B9;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x77E5;&#x8BC6;&#x70B9;</h3>
<p>&#x9996;&#x5148;&#x770B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgotOV14oT6AJUiFAACk7j7acPA736.jpg?imageslim" alt=""></p>
<ol>
<li>&#x961F;&#x5217;&#x548C;&#x6808;&#x662F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x7684;&#x7279;&#x70B9;&#x3002;&#x961F;&#x5217;&#x662F;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF0C;&#x6808;&#x662F;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#x3002;</li>
<li>&#x8868;&#xFF0C;&#x5305;&#x62EC;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x6709;&#x5360;&#x7528;&#x8FDE;&#x7EED;&#x7A7A;&#x95F4;&#x7684;&#x6570;&#x7EC4;&#x3001;&#x7528;&#x6307;&#x9488;&#x94FE;&#x63A5;&#x7684;&#x5355;&#x5411;&#x548C;&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x9996;&#x5C3E;&#x76F8;&#x63A5;&#x7684;&#x5FAA;&#x73AF;&#x94FE;&#x8868;&#x3001;&#x4EE5;&#x53CA;&#x6563;&#x5217;&#x8868;&#xFF0C;&#x4E5F;&#x53EB;&#x54C8;&#x5E0C;&#x8868;&#x3002;</li>
<li>&#x56FE;&#xFF0C;&#x5728;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x4F7F;&#x7528;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x4E2D;&#x4F1A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#xFF0C;&#x56FE;&#x5206;&#x4E3A;&#x6709;&#x5411;&#x56FE;&#x3001;&#x65E0;&#x5411;&#x56FE;&#x53CA;&#x5E26;&#x6743;&#x56FE;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x9700;&#x8981;&#x638C;&#x63E1;&#x56FE;&#x7684;&#x6DF1;&#x5EA6;&#x904D;&#x5386;&#x548C;&#x5E7F;&#x5EA6;&#x904D;&#x5386;&#x7B97;&#x6CD5;&#xFF0C;&#x4E86;&#x89E3;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x7B97;&#x6CD5;&#x3002;</li>
<li>&#x6811;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6811;&#x4E00;&#x822C;&#x7528;&#x4F5C;&#x67E5;&#x627E;&#x4E0E;&#x6392;&#x5E8F;&#x7684;&#x8F85;&#x52A9;&#x7ED3;&#x6784;&#xFF0C;&#x5269;&#x4E0B;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x548C;&#x6811;&#x6709;&#x5173;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x591A;&#x53C9;&#x6811;&#x3002;<pre><code>- &#x591A;&#x53C9;&#x6811;&#x5305;&#x62EC; B &#x6811;&#x65CF;&#xFF0C;&#x6709; B &#x6811;&#x3001;B+ &#x6811;&#x3001;B* &#x6811;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7528;&#x6765;&#x505A;&#x6587;&#x4EF6;&#x68C0;&#x7D22;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x5B57;&#x5178;&#x6811;&#xFF0C;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x591A;&#x6A21;&#x5339;&#x914D;&#x3002;
- &#x4E8C;&#x53C9;&#x6811;&#x5305;&#x62EC;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x7EA2;&#x9ED1;&#x6811;&#x3001;&#x54C8;&#x592B;&#x66FC;&#x6811;&#xFF0C;&#x4EE5;&#x53CA;&#x5806;&#xFF0C;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x67E5;&#x627E;&#x548C;&#x6392;&#x5E8F;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x6784;&#x5EFA;&#x3001;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x524D;&#x5E8F;&#x3001;&#x4E2D;&#x5E8F;&#x3001;&#x540E;&#x5E8F;&#x904D;&#x5386;&#x3002;
</code></pre></li>
</ol>
<hr>
<h3 id="&#x7B97;&#x6CD5;&#x77E5;&#x8BC6;&#x70B9;">&#x7B97;&#x6CD5;&#x77E5;&#x8BC6;&#x70B9;</h3>
<p>&#x6765;&#x770B;&#x7B97;&#x6CD5;&#x90E8;&#x5206;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6C47;&#x603B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l14oT6ARislAAIosv-_rkU883%20(1" alt="">.png?imageslim)</p>
<ol>
<li>&#x7B97;&#x6CD5;&#x9898;&#x7684;&#x5E38;&#x7528;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x590D;&#x6742;&#x5EA6;&#x662F;&#x8861;&#x91CF;&#x7B97;&#x6CD5;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;&#x4E4B;&#x4E00;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x638C;&#x63E1;&#x8BA1;&#x7B97;&#x7B97;&#x6CD5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x4E00;&#x822C;&#x662F;&#x627E;&#x5230;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8BED;&#x53E5;&#x6267;&#x884C;&#x6B21;&#x6570;&#x7684;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x6700;&#x540E;&#x7528;&#x5927;&#x5199; O &#x6765;&#x8868;&#x793A;&#x7ED3;&#x679C;&#x3002;</li>
<li>&#x5E38;&#x7528;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x7B97;&#x6CD5;&#xFF0C;&#x4E86;&#x89E3;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#x7684;&#x5339;&#x914D;&#x601D;&#x8DEF;&#x3002;</li>
<li>&#x6392;&#x5E8F;&#x4E5F;&#x662F;&#x7ECF;&#x5E38;&#x8003;&#x5BDF;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x5206;&#x4E3A;&#x63D2;&#x5165;&#x3001;&#x4EA4;&#x6362;&#x3001;&#x9009;&#x62E9;&#x3001;&#x5F52;&#x5E76;&#x3001;&#x57FA;&#x6570;&#x4E94;&#x7C7B;&#xFF0C;&#x5176;&#x4E2D;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x548C;&#x5806;&#x6392;&#x5E8F;&#x8003;&#x5BDF;&#x7684;&#x9891;&#x7387;&#x6700;&#x9AD8;&#xFF0C;&#x8981;&#x91CD;&#x70B9;&#x638C;&#x63E1;&#xFF0C;&#x9700;&#x8981;&#x80FD;&#x591F;&#x624B;&#x5199;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x5E38;&#x7528;&#x7684;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x3001;&#x4E8C;&#x53C9;&#x6392;&#x5E8F;&#x6811;&#x3001;B &#x6811;&#x3001;Hash&#x3001;BloomFilter &#x7B49;&#xFF0C;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x7684;&#x9002;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x9002;&#x5408;&#x5C0F;&#x6570;&#x91CF;&#x96C6;&#x5185;&#x5B58;&#x67E5;&#x627E;&#xFF0C;B &#x6811;&#x9002;&#x5408;&#x6587;&#x4EF6;&#x7D22;&#x5F15;&#xFF0C;Hash &#x5E38;&#x6570;&#x7EA7;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x66F4;&#x9002;&#x5408;&#x5BF9;&#x67E5;&#x627E;&#x6548;&#x7387;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x7684;&#x573A;&#x5408;&#xFF0C;BloomFilter &#x9002;&#x5408;&#x5BF9;&#x5927;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5B58;&#x5728;&#x6027;&#x8FC7;&#x6EE4;&#x3002;</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;">&#x8BE6;&#x89E3;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;</h3>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;&#x6EE1;&#x8DB3;&#x8FD9;&#x6837;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x81F3;&#x591A;&#x6709;&#x4E24;&#x4E2A;&#x5B50;&#x6811;&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5DE6;&#x5B50;&#x6811;&#x8282;&#x70B9;&#x7684;&#x503C;&#x90FD;&#x5C0F;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x503C;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x53F3;&#x5B50;&#x6811;&#x8282;&#x70B9;&#x7684;&#x503C;&#x90FD;&#x5927;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x503C;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509210245.png?imageslim" alt=""></p>
<p>&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x67E5;&#x8BE2;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; log(N)&#xFF0C;&#x4F46;&#x662F;&#x968F;&#x7740;&#x4E0D;&#x65AD;&#x7684;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x8282;&#x70B9;&#xFF0C;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x6811;&#x9AD8;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x65AD;&#x53D8;&#x5927;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x53EA;&#x6709;&#x5DE6;&#x5B50;&#x6811;&#x6216;&#x8005;&#x90FD;&#x53EA;&#x6709;&#x53F3;&#x5B50;&#x6811;&#x65F6;&#xFF0C;&#x5176;&#x67E5;&#x627E;&#x6027;&#x80FD;&#x5C31;&#x9000;&#x5316;&#x6210;&#x7EBF;&#x6027;&#x7684;&#x4E86;&#x3002;</p>
<h4 id="&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;"><strong>&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;</strong></h4>
<p>&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x7684;&#x9AD8;&#x5EA6;&#x5DEE;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x4E0D;&#x8D85;&#x8FC7; 1&#xFF0C;&#x4F8B;&#x5982; AVL &#x6811;&#x3002;AVL &#x6811;&#x662F;&#x4E25;&#x683C;&#x7684;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x6570;&#x636E;&#x65F6;&#x53EF;&#x80FD;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x65CB;&#x8F6C;&#x6765;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x63D2;&#x5165;&#x3001;&#x5220;&#x9664;&#x6BD4;&#x8F83;&#x5C11;&#x7684;&#x573A;&#x666F;&#x3002;</p>
<h4 id="&#x7EA2;&#x9ED1;&#x6811;"><strong>&#x7EA2;&#x9ED1;&#x6811;</strong></h4>
<p>&#x7EA2;&#x9ED1;&#x6811;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x5B9E;&#x7528;&#x7684;&#x975E;&#x4E25;&#x683C;&#x7684;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x6811;&#x3002;&#x7EA2;&#x9ED1;&#x6811;&#x66F4;&#x5173;&#x6CE8;&#x5C40;&#x90E8;&#x5E73;&#x8861;&#x800C;&#x975E;&#x6574;&#x4F53;&#x5E73;&#x8861;&#xFF0C;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#x4F1A;&#x6BD4;&#x5176;&#x4ED6;&#x8DEF;&#x5F84;&#x957F;&#x51FA; 2 &#x500D;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x63A5;&#x8FD1;&#x5E73;&#x8861;&#x7684;&#xFF0C;&#x4F46;&#x51CF;&#x5C11;&#x4E86;&#x8BB8;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x65CB;&#x8F6C;&#x64CD;&#x4F5C;&#xFF0C;&#x66F4;&#x52A0;&#x5B9E;&#x7528;&#x3002;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;Java 8 &#x7684; HashMap &#x4E2D;&#x5C31;&#x5E94;&#x7528;&#x4E86;&#x7EA2;&#x9ED1;&#x6811;&#x6765;&#x89E3;&#x51B3;&#x6563;&#x5217;&#x51B2;&#x7A81;&#x65F6;&#x7684;&#x67E5;&#x627E;&#x95EE;&#x9898;&#x3002;TreeMap &#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x7EA2;&#x9ED1;&#x6811;&#x6765;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#x7684;&#x3002;</p>
<p>&#x7EA2;&#x9ED1;&#x6811;&#x9664;&#x4E86;&#x62E5;&#x6709;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;&#x7684;&#x7279;&#x70B9;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4EE5;&#x4E0B;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509210623.png?imageslim" alt=""></p>
<ol>
<li>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0D;&#x662F;&#x7EA2;&#x8272;&#x5C31;&#x662F;&#x9ED1;&#x8272;&#x3002;</li>
<li>&#x6839;&#x8282;&#x70B9;&#x662F;&#x9ED1;&#x8272;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x9ED1;&#x8272;&#x7684;&#x7A7A;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x56FE;&#x4E2D;&#x7684;&#x9ED1;&#x8272;&#x4E09;&#x89D2;&#x3002;</li>
<li>&#x7EA2;&#x8272;&#x8282;&#x70B9;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x9ED1;&#x8272;&#x7684;&#x3002;</li>
<li>&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x5230;&#x5176;&#x53F6;&#x8282;&#x70B9;&#x7684;&#x6BCF;&#x6761;&#x8DEF;&#x5F84;&#x4E0A;&#xFF0C;&#x5305;&#x542B;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x9ED1;&#x8272;&#x8282;&#x70B9;&#x3002;</li>
</ol>
<hr>
<h3 id="&#x8BE6;&#x89E3;-b-&#x6811;">&#x8BE6;&#x89E3; B &#x6811;</h3>
<h4 id="b&#x6811;"><strong>B&#x6811;</strong></h4>
<p>B &#x6811;&#x662F;&#x4E00;&#x79CD;&#x591A;&#x53C9;&#x6811;&#xFF0C;&#x4E5F;&#x53EB;&#x591A;&#x8DEF;&#x641C;&#x7D22;&#x6811;&#x3002;B &#x6811;&#x4E2D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x7528;&#x5728;&#x6587;&#x4EF6;&#x7D22;&#x5F15;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x51CF;&#x5C11;&#x78C1;&#x76D8; IO &#x6B21;&#x6570;&#x3002;B &#x6811;&#x4E2D;&#x6240;&#x6709;&#x7ED3;&#x70B9;&#x7684;&#x6700;&#x5927;&#x5B50;&#x8282;&#x70B9;&#x6570;&#x79F0;&#x4E3A; B &#x6811;&#x7684;&#x9636;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x662F;&#x4E00;&#x68F5; 3 &#x9636; B &#x6811;&#xFF0C;&#x4E5F;&#x53EB; 2-3 &#x6811;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509210728.png?imageslim" alt=""></p>
<p>&#x4E00;&#x4E2A; m &#x9636; B &#x6811;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x975E;&#x53F6;&#x8282;&#x70B9;&#x6700;&#x591A;&#x6709; m &#x68F5;&#x5B50;&#x6811;&#xFF1B;</li>
<li>&#x6839;&#x8282;&#x70B9;&#x6700;&#x5C11;&#x6709;&#x4E24;&#x4E2A;&#x5B50;&#x6811;&#xFF0C;&#x975E;&#x6839;&#x3001;&#x975E;&#x53F6;&#x8282;&#x70B9;&#x6700;&#x5C11;&#x6709; m/2 &#x68F5;&#x5B50;&#x6811;&#xFF1B;</li>
<li>&#x975E;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E2A;&#x6570;&#xFF0C;&#x7B49;&#x4E8E;&#x8BE5;&#x8282;&#x70B9;&#x5B50;&#x6811;&#x4E2A;&#x6570;&#x2212;1&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5982;&#x679C;&#x6709; 3&#x68F5;&#x5B50;&#x6811;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4E2D;&#x5FC5;&#x5B9A;&#x5305;&#x542B; 2 &#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF1B;</li>
<li>&#x975E;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5927;&#x5C0F;&#x6709;&#x5E8F;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x5DE6;&#x8FB9;&#x7684;&#x8282;&#x70B9;&#x4E2D; 37&#x3001;51 &#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x5C31;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF1B;</li>
<li>&#x8282;&#x70B9;&#x4E2D;&#x6BCF;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x7684;&#x5DE6;&#x5B50;&#x6811;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x5C0F;&#x4E8E;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x53F3;&#x5B50;&#x6811;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x5927;&#x4E8E;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#x3002;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x5173;&#x952E;&#x5B57; 51 &#x7684;&#x5DE6;&#x5B50;&#x6811;&#x6709; 42&#x3001;49&#xFF0C;&#x90FD;&#x5C0F;&#x4E8E; 51&#xFF0C;&#x53F3;&#x5B50;&#x6811;&#x7684;&#x8282;&#x70B9;&#x6709; 59&#xFF0C;&#x5927;&#x4E8E;51&#xFF1B;</li>
<li>&#x6240;&#x6709;&#x53F6;&#x8282;&#x70B9;&#x90FD;&#x5728;&#x540C;&#x4E00;&#x5C42;&#x3002;</li>
</ol>
<p>B &#x6811;&#x5728;&#x67E5;&#x627E;&#x65F6;&#xFF0C;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x5BF9;&#x7ED3;&#x70B9;&#x5185;&#x7684;&#x6709;&#x5E8F;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5E8F;&#x5217;&#x8FDB;&#x884C;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x627E;&#x5230;&#x5C31;&#x7ED3;&#x675F;&#xFF0C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5C31;&#x8FDB;&#x5165;&#x67E5;&#x8BE2;&#x5173;&#x952E;&#x5B57;&#x6240;&#x5C5E;&#x8303;&#x56F4;&#x7684;&#x5B50;&#x6811;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#xFF0C;&#x76F4;&#x5230;&#x53F6;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>B &#x6811;&#x7684;&#x5173;&#x952E;&#x5B57;&#x5206;&#x5E03;&#x5728;&#x6574;&#x9897;&#x6811;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x53EA;&#x51FA;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#xFF1B;</li>
<li>&#x641C;&#x7D22;&#x53EF;&#x80FD;&#x5728;&#x975E;&#x53F6;&#x8282;&#x70B9;&#x505C;&#x6B62;&#xFF1B;</li>
<li>B &#x6811;&#x4E00;&#x822C;&#x5E94;&#x7528;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;</li>
</ul>
<hr>
<h4 id="b&#x6811;"><strong>B+&#x6811;</strong></h4>
<p>&#x4E0B;&#x56FE;&#x662F; B &#x6811;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x79CD;&#xFF0C;&#x53EB;&#x4F5C; B+ &#x6811;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509210924.png?imageslim" alt=""></p>
<p>B+ &#x6811;&#x7684;&#x5B9A;&#x4E49;&#x4E0E; B &#x6811;&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x9664;&#x4E86;&#x4E0B;&#x9762;&#x8FD9;&#x51E0;&#x4E2A;&#x7279;&#x70B9;&#x3002;</p>
<ol>
<li>&#x8282;&#x70B9;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#x4E0E;&#x5B50;&#x6811;&#x6570;&#x76EE;&#x76F8;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#x8282;&#x70B9;&#x4E2D;&#x6709; 3 &#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6709; 3 &#x68F5;&#x5B50;&#x6811;&#xFF1B;</li>
<li>&#x5173;&#x952E;&#x5B57;&#x5BF9;&#x5E94;&#x7684;&#x5B50;&#x6811;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5B50;&#x6811;&#x4E2D;&#x5305;&#x62EC;&#x5173;&#x952E;&#x5B57;&#x81EA;&#x8EAB;&#xFF1B;</li>
<li>&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x90FD;&#x51FA;&#x73B0;&#x5728;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E2D;&#xFF1B;</li>
<li>&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6307;&#x9488;&#x3002;</li>
</ol>
<p>&#x4E0E; B &#x6811;&#x4E0D;&#x540C;&#xFF0C;B+ &#x6811;&#x5728;&#x641C;&#x7D22;&#x65F6;&#x4E0D;&#x4F1A;&#x5728;&#x975E;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x547D;&#x4E2D;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x67E5;&#x8BE2;&#x5230;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#xFF0C;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x76F8;&#x5F53;&#x4E8E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5C42;&#xFF0C;&#x4FDD;&#x5B58;&#x5173;&#x952E;&#x5B57;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x975E;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x53EA;&#x4FDD;&#x5B58;&#x5173;&#x952E;&#x5B57;&#x548C;&#x6307;&#x5411;&#x53F6;&#x8282;&#x70B9;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4E0D;&#x4FDD;&#x5B58;&#x5173;&#x952E;&#x5B57;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x540C;&#x6837;&#x6570;&#x91CF;&#x5173;&#x952E;&#x5B57;&#x7684;&#x975E;&#x53F6;&#x8282;&#x70B9;&#xFF0C;B+ &#x6811;&#x6BD4; B &#x6811;&#x8981;&#x5C0F;&#x5F88;&#x591A;&#x3002;</p>
<p>B+ &#x6811;&#x66F4;&#x9002;&#x5408;&#x7D22;&#x5F15;&#x7CFB;&#x7EDF;&#xFF0C;MySQL &#x6570;&#x636E;&#x5E93;&#x7684;&#x7D22;&#x5F15;&#x5C31;&#x63D0;&#x4F9B;&#x4E86; B+ &#x6811;&#x5B9E;&#x73B0;&#x3002;&#x539F;&#x56E0;&#x6709;&#x4E09;&#x4E2A;&#xFF1A;</p>
<ol>
<li>&#x7531;&#x4E8E;&#x53F6;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x6709;&#x6307;&#x9488;&#x76F8;&#x8FDE;&#xFF0C;B+ &#x6811;&#x66F4;&#x9002;&#x5408;&#x8303;&#x56F4;&#x68C0;&#x7D22;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x975E;&#x9875;&#x8282;&#x70B9;&#x53EA;&#x4FDD;&#x5B58;&#x5173;&#x952E;&#x5B57;&#x548C;&#x6307;&#x9488;&#xFF0C;&#x540C;&#x6837;&#x5927;&#x5C0F;&#x975E;&#x53F6;&#x8282;&#x70B9;&#xFF0C;B+ &#x6811;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x66F4;&#x591A;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x6811;&#x9AD8;&#xFF0C;&#x67E5;&#x8BE2;&#x65F6;&#x78C1;&#x76D8;&#x8BFB;&#x5199;&#x4EE3;&#x4EF7;&#x66F4;&#x4F4E;&#xFF1B;</li>
<li>B+ &#x6811;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x3002;&#x4EFB;&#x4F55;&#x5173;&#x952E;&#x5B57;&#x7684;&#x67E5;&#x627E;&#x5FC5;&#x987B;&#x8D70;&#x4E00;&#x6761;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x8DEF;&#xFF0C;&#x6240;&#x6709;&#x5173;&#x952E;&#x5B57;&#x67E5;&#x8BE2;&#x7684;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x6548;&#x7387;&#x76F8;&#x5F53;&#x3002;</li>
</ol>
<p>&#x6700;&#x540E;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD; B* &#x6811;&#x7684;&#x53D8;&#x79CD;&#xFF0C;&#x5728;B+&#x6811;&#x7684;&#x975E;&#x53F6;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x6307;&#x5411;&#x540C;&#x4E00;&#x5C42;&#x4E0B;&#x4E00;&#x4E2A;&#x975E;&#x53F6;&#x8282;&#x70B9;&#x7684;&#x6307;&#x9488;&#x3002;</p>
<hr>
<h3 id="&#x8BE6;&#x89E3;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;">&#x8BE6;&#x89E3;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;</h3>
<h4 id="&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x95EE;&#x9898;"><strong>&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x95EE;&#x9898;</strong></h4>
<p>&#x5728;&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x7ECF;&#x5E38;&#x4F5C;&#x4E3A;&#x7B97;&#x6CD5;&#x8003;&#x5BDF;&#x9898;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x770B;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5148;&#x6765;&#x4E86;&#x89E3;&#x4E00;&#x9053;&#x5E38;&#x8003;&#x7684;&#x9762;&#x8BD5;&#x9898;&#xFF1A;&#x201C;&#x5224;&#x65AD;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x62EC;&#x53F7;&#x662F;&#x5426;&#x5339;&#x914D;&#x201D;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x9762;&#x8BD5;&#x9898;&#x76EE;&#x7684;&#x63CF;&#x8FF0;&#x90FD;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5728;&#x89E3;&#x7B54;&#x524D;&#xFF0C;&#x53EF;&#x4EE5;&#x8DDF;&#x9762;&#x8BD5;&#x5B98;&#x8FDB;&#x4E00;&#x6B65;&#x6C9F;&#x901A;&#x4E00;&#x4E0B;&#x9898;&#x76EE;&#x8981;&#x6C42;&#x548C;&#x7EC6;&#x8282;&#x3002;&#x4EE5;&#x8FD9;&#x9053;&#x9898;&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x4EE5;&#x8DDF;&#x9762;&#x8BD5;&#x5B98;&#x786E;&#x8BA4;&#x62EC;&#x53F7;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x53EA;&#x8003;&#x8651;&#x5927;&#x4E2D;&#x5C0F;&#x62EC;&#x53F7;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x5305;&#x4E0D;&#x5305;&#x62EC;&#x5C16;&#x62EC;&#x53F7;&#xFF1B;&#x5BF9;&#x51FD;&#x6570;&#x7684;&#x5165;&#x53C2;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x6709;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8981;&#x6C42;&#xFF1B;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x9488;&#x5BF9;&#x5927;&#x6587;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;&#x7B49;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x7EC6;&#x5316;&#x540E;&#x672C;&#x9898;&#x7684;&#x8981;&#x6C42;&#x4E3A;&#xFF1A;&#x53EA;&#x8003;&#x8651;&#x5927;&#x4E2D;&#x5C0F;&#x62EC;&#x53F7;&#xFF1B;&#x4E0D;&#x8003;&#x8651;&#x9488;&#x5BF9;&#x5927;&#x6587;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x5165;&#x53C2;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#xFF1B;&#x672A;&#x51FA;&#x73B0;&#x62EC;&#x53F7;&#x4E5F;&#x7B97;&#x4F5C;&#x5339;&#x914D;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x3002;</p>
<ul>
<li>&#x5B57;&#x7B26;&#x5339;&#x914D;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x6808;&#x7684;&#x7279;&#x6027;&#x6765;&#x5904;&#x7406;&#x3002;</li>
<li>&#x9047;&#x5230;&#x5DE6;&#x62EC;&#x53F7;&#x65F6;&#x5165;&#x6808;&#xFF0C;&#x9047;&#x5230;&#x53F3;&#x62EC;&#x53F7;&#x65F6;&#x51FA;&#x6808;&#x5BF9;&#x6BD4;&#xFF0C;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x6210;&#x5BF9;&#x7684;&#x62EC;&#x53F7;&#x3002;</li>
<li>&#x5F53;&#x5339;&#x914D;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6808;&#x5185;&#x4E3A;&#x7A7A;&#x8BF4;&#x660E;&#x5339;&#x914D;&#xFF0C;&#x5426;&#x5219;&#x8BF4;&#x660E;&#x5DE6;&#x62EC;&#x53F7;&#x591A;&#x4E8E;&#x53F3;&#x62EC;&#x53F7;&#x3002;</li>
</ul>
<p><strong>&#x5B57;&#x7B26;&#x4E32;&#x4EE3;&#x7801;</strong></p>
<p>&#x6765;&#x770B;&#x5B9E;&#x9645;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code class="lang-java">    <span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">final</span> Map&lt;Character,Character&gt; brackets = <span class="hljs-keyword">new</span> HashMap&lt;&gt;();
    <span class="hljs-keyword">static</span> {
        brackets.put(<span class="hljs-string">&apos;)&apos;</span>,<span class="hljs-string">&apos;(&apos;</span>);
        brackets.put(<span class="hljs-string">&apos;]&apos;</span>,<span class="hljs-string">&apos;[&apos;</span>);
        brackets.put(<span class="hljs-string">&apos;}&apos;</span>,<span class="hljs-string">&apos;{&apos;</span>);
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">boolean</span> <span class="hljs-title">isMatch</span><span class="hljs-params">(String str)</span></span>{
        <span class="hljs-keyword">if</span>(str == <span class="hljs-keyword">null</span>){
            <span class="hljs-keyword">return</span> <span class="hljs-keyword">false</span>;
        }
        Stack&lt;Character&gt; stack = <span class="hljs-keyword">new</span> Stack&lt;&gt;();
        <span class="hljs-keyword">for</span>(<span class="hljs-keyword">char</span> ch: str.toCharArray()){
            <span class="hljs-keyword">if</span>(brackets.containsValue(ch)){
                stack.push(ch);
            }<span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span>(brackets.containsKey(ch)){
                <span class="hljs-keyword">if</span>(stack.empty() || !stack.pop().equals(brackets.get(ch))){
                    <span class="hljs-keyword">return</span> <span class="hljs-keyword">false</span>;
                }
            }
        }
        <span class="hljs-keyword">return</span> stack.empty();
    }
</code></pre>
<p>&#x6309;&#x7167;&#x4E0A;&#x9762;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x6240;&#x4EE5;&#x9996;&#x5148;&#x8981;&#x80FD;&#x786E;&#x5B9A;&#x6808;&#x64CD;&#x4F5C;&#x7684;&#x89E6;&#x53D1;&#x6761;&#x4EF6;&#xFF0C;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x597D;&#x62EC;&#x53F7;&#x5BF9;&#xFF0C;&#x65B9;&#x4FBF;&#x5165;&#x6808;&#x548C;&#x51FA;&#x6808;&#x5339;&#x914D;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x7F16;&#x7801;&#x5B9E;&#x73B0;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#x7F16;&#x7801;&#x98CE;&#x683C;&#x4E0E;&#x89C4;&#x8303;&#xFF0C;&#x4F8B;&#x5982;&#x53D8;&#x91CF;&#x547D;&#x540D;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x660E;&#x786E;&#x610F;&#x4E49;&#xFF0C;&#x4E0D;&#x8981;&#x7B80;&#x5355;&#x4F7F;&#x7528; a&#x3001;b &#x8FD9;&#x79CD;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x610F;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x540D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E86; brackets &#x7684; map&#xFF0C;key &#x662F;&#x6240;&#x6709;&#x53F3;&#x62EC;&#x53F7;&#xFF0C;value &#x662F;&#x5BF9;&#x5E94;&#x7684;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x65B9;&#x4FBF;&#x51FA;&#x6808;&#x65F6;&#x5BF9;&#x6BD4;&#x62EC;&#x53F7;&#x662F;&#x5426;&#x662F;&#x6210;&#x5BF9;&#x3002;</p>
<p>&#x518D;&#x770B;&#x4E00;&#x4E0B;&#x5339;&#x914D;&#x51FD;&#x6570;&#x7684;&#x903B;&#x8F91;&#x3002;&#x8FD9;&#x91CC;&#x4E5F;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4F5C;&#x4E3A;&#x5DE5;&#x5177;&#x7C7B;&#x51FD;&#x6570;&#xFF0C;&#x8981;&#x505A;&#x597D;&#x5065;&#x58EE;&#x6027;&#x9632;&#x5FA1;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x5BF9;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x9A8C;&#x7A7A;&#x3002;</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x7684;&#x6808;&#xFF0C;&#x5F00;&#x59CB;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B57;&#x7B26;&#x662F; brackets &#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;&#x5219;&#x5165;&#x6808;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;map &#x7684;&#x503C;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#x662F; O(N) &#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x672C;&#x9898;&#x4E2D;&#x62EC;&#x53F7;&#x79CD;&#x7C7B;&#x5F88;&#x5C11;&#xFF0C;&#x624D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x6D01;&#x4E00;&#x4E9B;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5B57;&#x7B26;&#x4E0D;&#x662F;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;&#x5728;&#x4F7F;&#x7528; containskey &#x6765;&#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x53F3;&#x62EC;&#x53F7;&#x3002;&#x5982;&#x679C;&#x662F;&#x53F3;&#x62EC;&#x53F7;&#xFF0C;&#x9700;&#x8981;&#x68C0;&#x9A8C;&#x662F;&#x5426;&#x5339;&#x914D;&#xFF0C;&#x5982;&#x679C;&#x6808;&#x4E3A;&#x7A7A;&#x8868;&#x793A;&#x53F3;&#x62EC;&#x53F7;&#x591A;&#x4E8E;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;&#x5982;&#x679C;&#x6808;&#x4E0D;&#x7A7A;&#xFF0C;&#x4F46;&#x51FA;&#x6808;&#x7684;&#x5DE6;&#x62EC;&#x53F7;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x8BF4;&#x660E;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x62EC;&#x53F7;&#x662F;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x904D;&#x5386;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6808;&#x4E2D;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;&#x5DE6;&#x62EC;&#x53F7;&#xFF0C;&#x5219;&#x5339;&#x914D;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5F3A;&#x8C03;&#x4E00;&#x4E0B;&#xFF1A;&#x7F16;&#x7801;&#x9898;&#x9664;&#x4E86;&#x7F16;&#x7A0B;&#x601D;&#x8DEF;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x548C;&#x7EC6;&#x8282;&#x70B9;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<h4 id="&#x5B57;&#x7B26;&#x4E32;&#x89E3;&#x9898;&#x601D;&#x8DEF;"><strong>&#x5B57;&#x7B26;&#x4E32;&#x89E3;&#x9898;&#x601D;&#x8DEF;</strong></h4>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x9898;&#x6280;&#x5DE7;&#x3002;</p>
<ul>
<li>&#x9996;&#x5148;&#x8981;&#x8BA4;&#x771F;&#x5BA1;&#x9898;&#xFF0C;&#x907F;&#x514D;&#x7B54;&#x504F;&#x3002;&#x53EF;&#x4EE5;&#x5148;&#x786E;&#x5B9A;&#x662F;&#x5355;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x591A;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x547D;&#x4E2D;&#x6761;&#x4EF6;&#x662F;&#x5426;&#x6709;&#x591A;&#x4E2A;&#x3002;</li>
<li>&#x7136;&#x540E;&#x786E;&#x5B9A;&#x5BF9;&#x7B97;&#x6CD5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x6216;&#x8005;&#x5185;&#x5B58;&#x5360;&#x7528;&#x662F;&#x5426;&#x6709;&#x989D;&#x5916;&#x8981;&#x6C42;&#x3002;</li>
<li>&#x6700;&#x540E;&#x8981;&#x660E;&#x786E;&#x671F;&#x671B;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6BD4;&#x5982;&#x5B58;&#x5728;&#x6709;&#x591A;&#x4E2A;&#x547D;&#x4E2D;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x662F;&#x8FD4;&#x56DE;&#x7B2C;&#x4E00;&#x4E2A;&#x547D;&#x4E2D;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x5168;&#x90E8;&#x8FD4;&#x56DE;&#x3002;</li>
</ul>
<p>&#x5173;&#x4E8E;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x3002;</p>
<ul>
<li>&#x5982;&#x679C;&#x662F;&#x5355;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; BM &#x6216;&#x8005; KMP &#x7B97;&#x6CD5;&#x3002;</li>
<li>&#x5982;&#x679C;&#x662F;&#x5355;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; BM &#x6216;&#x8005; KMP &#x7B97;&#x6CD5;&#x3002;</li>
<li>&#x5728;&#x5B9E;&#x73B0;&#x5339;&#x914D;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x7528;&#x524D;&#x7F00;&#x6216;&#x8005;&#x540E;&#x7F00;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x3002;</li>
<li>&#x6700;&#x540E;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x662F;&#x5426;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6808;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x6216;&#x8005;&#x591A;&#x53C9;&#x6811;&#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8F85;&#x52A9;&#x89E3;&#x51B3;&#x3002;</li>
</ul>
<p>&#x5EFA;&#x8BAE;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x5E38;&#x89C1;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5355;&#x6A21;&#x3001;&#x591A;&#x6A21;&#x5339;&#x914D;&#x7B97;&#x6CD5;&#x7684;&#x5904;&#x7406;&#x601D;&#x8DEF;&#x3002;</p>
<hr>
<h3 id="&#x8BE6;&#x89E3;-topk">&#x8BE6;&#x89E3; TopK</h3>
<h4 id="topk-&#x95EE;&#x9898;"><strong>TopK &#x95EE;&#x9898;</strong></h4>
<p>TopK &#x95EE;&#x9898;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x4E2D;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x7684;&#x5178;&#x578B;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x5FAE;&#x535A;&#x7684;&#x70ED;&#x95E8;&#x6392;&#x884C;&#x5C31;&#x5C5E;&#x4E8E; TopK &#x95EE;&#x9898;&#x3002;</p>
<p>TopK &#x4E00;&#x822C;&#x662F;&#x8981;&#x6C42;&#x5728; N &#x4E2A;&#x6570;&#x7684;&#x96C6;&#x5408;&#x4E2D;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x6216;&#x8005;&#x6700;&#x5927;&#x7684; K &#x4E2A;&#x503C;&#xFF0C;&#x901A;&#x5E38; N &#x90FD;&#x975E;&#x5E38;&#x5F97;&#x5927;&#x3002;TopK &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6392;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x8F83;&#x9AD8;&#xFF0C;&#x4E00;&#x822C;&#x662F; O(nk)&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x9996;&#x5148;&#x53D6;&#x524D; K &#x4E2A;&#x5143;&#x7D20;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5927;&#x6839;&#x5806;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5269;&#x4E0B;&#x7684; N-K &#x4E2A;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x904D;&#x5386;&#xFF0C;&#x5982;&#x679C;&#x5C0F;&#x4E8E;&#x5806;&#x9876;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x66FF;&#x6362;&#x6389;&#x5806;&#x9876;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x6574;&#x5806;&#x3002;&#x5F53;&#x5168;&#x90E8;&#x904D;&#x5386;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5806;&#x4E2D;&#x7684; K &#x4E2A;&#x5143;&#x7D20;&#x5C31;&#x662F;&#x6700;&#x5C0F;&#x7684; K &#x4E2A;&#x503C;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509212250.png?imageslim" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; N*logK&#x3002;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x4E0D;&#x7528;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x5165;&#x5168;&#x90E8;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x80FD;&#x591F;&#x9002;&#x7528;&#x4E8E;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;</p>
<h4 id="topk-&#x53D8;&#x79CD;&#x95EE;&#x9898;"><strong>TopK &#x53D8;&#x79CD;&#x95EE;&#x9898;</strong></h4>
<p>TopK &#x53D8;&#x79CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x4ECE; N &#x4E2A;&#x6709;&#x5E8F;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x6216;&#x8005;&#x6700;&#x5927;&#x7684; K &#x4E2A;&#x503C;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x662F;&#x5BF9;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;&#x7531;&#x4E8E;&#x521D;&#x59CB;&#x7684;&#x6570;&#x636E;&#x96C6;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x904D;&#x5386;&#x5B8C; N &#x4E2A;&#x961F;&#x5217;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5143;&#x7D20;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x662F;&#x5982;&#x4F55;&#x51CF;&#x5C11;&#x8981;&#x904D;&#x5386;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509212327.png?imageslim" alt=""></p>
<ol>
<li>&#x7B2C;&#x4E00;&#x6B65;&#x5148;&#x7528; N &#x4E2A;&#x961F;&#x5217;&#x7684;&#x961F;&#x5934;&#x5143;&#x7D20;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x6700;&#x5C0F;&#x5143;&#x7D20;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x6709; K &#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5C0F;&#x6839;&#x5806;&#x3002;&#x65B9;&#x5F0F;&#x540C; TopK &#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x6B65;&#x83B7;&#x53D6;&#x5806;&#x9876;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x6709;&#x961F;&#x5217;&#x4E2D;&#x6700;&#x5C0F;&#x7684;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x6B65;&#x7528;&#x8FD9;&#x4E2A;&#x5806;&#x9876;&#x5143;&#x7D20;&#x6240;&#x5728;&#x961F;&#x5217;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#x653E;&#x5165;&#x5806;&#x9876;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x6574;&#x5806;&#x3002;</li>
<li>&#x6700;&#x540E;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#x76F4;&#x5230;&#x83B7;&#x53D6;&#x591F; K &#x4E2A;&#x6570;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x8FD8;&#x53EF;&#x4EE5;&#x6709;&#x4E2A;&#x5C0F;&#x4F18;&#x5316;&#x5C31;&#x662F;&#x7B2C;&#x4E09;&#x6B65;&#x5F80;&#x5806;&#x9876;&#x653E;&#x5165;&#x65B0;&#x503C;&#x65F6;&#xFF0C;&#x8DDF;&#x5806;&#x7684;&#x6700;&#x5927;&#x503C;&#x8FDB;&#x884C;&#x4E00;&#x4E0B;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x5927;&#x4E8E;&#x5806;&#x4E2D;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x7EC8;&#x6B62;&#x5FAA;&#x73AF;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; (N+K-1)*logK&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x4E0E;&#x961F;&#x5217;&#x7684;&#x957F;&#x5EA6;&#x65E0;&#x5173;&#x3002;</p>
<h3 id="&#x8BE6;&#x89E3;&#x5E38;&#x7528;&#x7B97;&#x6CD5;">&#x8BE6;&#x89E3;&#x5E38;&#x7528;&#x7B97;&#x6CD5;</h3>
<p>&#x7B97;&#x6CD5;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x89E3;&#x9898;&#x80FD;&#x529B;&#x9700;&#x8981;&#x9002;&#x5F53;&#x5237;&#x9898;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5355;&#x7EAF;&#x4F9D;&#x9760;&#x5237;&#x9898;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x9700;&#x8981;&#x638C;&#x63E1;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x4E0E;&#x65B9;&#x6CD5;&#xFF0C;&#x624D;&#x80FD;&#x4EE5;&#x4E0D;&#x53D8;&#x5E94;&#x4E07;&#x53D8;&#x3002;&#x8FD9;&#x91CC;&#x8BB2;&#x4E00;&#x4E0B;&#xFF1A;&#x5206;&#x6CBB;&#x3001;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x3001;&#x8D2A;&#x5FC3;&#x3001;&#x56DE;&#x6EAF;&#x548C;&#x5206;&#x652F;&#x754C;&#x5B9A;&#x8FD9;&#x4E94;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x9898;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#xFF0C;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x3002;</p>
<h4 id="&#x5206;&#x6CBB;&#x6CD5;"><strong>&#x5206;&#x6CBB;&#x6CD5;</strong></h4>
<p>&#x5206;&#x6CBB;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x96BE;&#x4EE5;&#x76F4;&#x63A5;&#x89E3;&#x51B3;&#x7684;&#x590D;&#x6742;&#x95EE;&#x9898;&#x6216;&#x8005;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x5272;&#x6210;&#x4E00;&#x4E9B;&#x89C4;&#x6A21;&#x8F83;&#x5C0F;&#x7684;&#x76F8;&#x540C;&#x95EE;&#x9898;&#xFF0C;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x3002;&#x6BD4;&#x5982;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x3001;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x7B49;&#x90FD;&#x662F;&#x5E94;&#x7528;&#x4E86;&#x5206;&#x6CBB;&#x6CD5;&#x3002;</p>
<p>&#x9002;&#x5408;&#x4F7F;&#x7528;&#x5206;&#x6CBB;&#x6CD5;&#x7684;&#x573A;&#x666F;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x4E09;&#x70B9;&#x8981;&#x6C42;&#xFF1A;</p>
<ol>
<li>&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x95EE;&#x9898;&#xFF1B;</li>
<li>&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x4E3A;&#x539F;&#x95EE;&#x9898;&#x7684;&#x89E3;&#xFF1B;</li>
<li>&#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5173;&#x8054;&#x3002;</li>
</ol>
<p>&#x4F7F;&#x7528;&#x5206;&#x6CBB;&#x6CD5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x822C;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#x56FE;&#x8868;&#x683C;&#x6240;&#x793A;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:center">&#x7B97;&#x6CD5;</th>
<th>&#x9002;&#x7528;&#x573A;&#x666F;</th>
<th>&#x4F7F;&#x7528;&#x65B9;&#x6CD5;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x5206;&#x6CBB;</td>
<td>1. &#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x95EE;&#x9898;<br>2. &#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x4E3A;&#x539F;&#x95EE;&#x9898;&#x7684;&#x89E3;<br>3. &#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5173;&#x8054;</td>
<td>1. &#x627E;&#x5230;&#x6700;&#x5C0F;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;<br>2. &#x627E;&#x5230;&#x5408;&#x5E76;&#x65B9;&#x6CD5;<br>3. &#x627E;&#x5230;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;</td>
</tr>
<tr>
<td style="text-align:center">&#x52A8;&#x6001;&#x89C4;&#x5212;</td>
<td>1. &#x6309;&#x987A;&#x5E8F;&#x6C42;&#x89E3;&#x5B50;&#x95EE;&#x9898;<br>2. &#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x6709;&#x5173;&#x8054;&#x5173;&#x7CFB;<br>3. &#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x4E3A;&#x539F;&#x95EE;&#x9898;&#x7684;&#x89E3;</td>
<td>1. &#x5206;&#x6790;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x6027;&#x8D28;<br>2. &#x9012;&#x5F52;&#x7684;&#x5B9A;&#x4E49;&#x6700;&#x4F18;&#x89E3;<br>3. &#x8BB0;&#x5F55;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x7684;&#x6700;&#x4F18;&#x503C;<br>4. &#x6839;&#x636E;&#x9636;&#x6BB5;&#x6700;&#x4F18;&#x89E3;&#x9009;&#x62E9;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;</td>
</tr>
</tbody>
</table>
<ol>
<li>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8981;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x8981;&#x627E;&#x5230;&#x5408;&#x5E76;&#x5B50;&#x95EE;&#x9898;&#x89E3;&#x7684;&#x65B9;&#x6CD5;&#xFF1B;</li>
<li>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x8981;&#x627E;&#x5230;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x3002;</li>
</ol>
<h4 id="&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7B97;&#x6CD5;"><strong>&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7B97;&#x6CD5;</strong></h4>
<p>&#x52A8;&#x6001;&#x89C4;&#x5212;&#x6CD5;&#xFF0C;&#x4E0E;&#x5206;&#x6CBB;&#x6CD5;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x662F;&#x5C06;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x4E3A;&#x591A;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x3002;&#x4E0E;&#x5206;&#x6CBB;&#x6CD5;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x5173;&#x8054;&#x7684;&#x3002;&#x524D;&#x4E00;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#xFF0C;&#x4E3A;&#x540E;&#x4E00;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x6CD5;&#x4F9D;&#x6B21;&#x89E3;&#x51B3;&#x5404;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x6C42;&#x89E3;&#x6BCF;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5217;&#x51FA;&#x6240;&#x6709;&#x5C40;&#x90E8;&#x89E3;&#xFF0C;&#x901A;&#x8FC7;&#x51B3;&#x7B56;&#x4FDD;&#x7559;&#x90A3;&#x4E9B;&#x6709;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x7684;&#x5C40;&#x90E8;&#x89E3;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x5C31;&#x662F;&#x521D;&#x59CB;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7684;&#x573A;&#x666F;&#x9700;&#x8981;&#x4E5F;&#x6EE1;&#x8DB3;&#x4E09;&#x70B9;&#x6761;&#x4EF6;&#xFF1A;</p>
<ol>
<li>&#x5B50;&#x95EE;&#x9898;&#x7684;&#x6C42;&#x89E3;&#x5FC5;&#x987B;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x7684;&#xFF1B;</li>
<li>&#x76F8;&#x90BB;&#x7684;&#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x6709;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF1B;</li>
<li>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x5C31;&#x662F;&#x521D;&#x59CB;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x3002;</li>
</ol>
<p>&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x8868;&#x683C;&#x7B2C;&#x4E8C;&#x884C;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5148;&#x8981;&#x5206;&#x6790;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x6027;&#x8D28;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x9012;&#x5F52;&#x7684;&#x5B9A;&#x4E49;&#x6700;&#x4F18;&#x89E3;&#xFF1B;</li>
<li>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x7684;&#x6700;&#x4F18;&#x503C;&#xFF1B;</li>
<li>&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x6839;&#x636E;&#x9636;&#x6BB5;&#x6700;&#x4F18;&#x89E3;&#x9009;&#x62E9;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;</li>
</ol>
<h4 id="&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;"><strong>&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;</strong></h4>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8003;&#x8651;&#x7684;&#x662F;&#x5C40;&#x90E8;&#x7684;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x6240;&#x4EE5;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x4E0D;&#x662F;&#x5BF9;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x6574;&#x4F53;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x952E;&#x662F;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x7684;&#x9009;&#x62E9;&#x3002;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x65E0;&#x540E;&#x6548;&#x6027;&#xFF0C;&#x5373;&#x67D0;&#x4E2A;&#x72B6;&#x6001;&#x4EE5;&#x540E;&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x4EE5;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x4E0E;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x6709;&#x5173;&#x3002;</p>
<p>&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x573A;&#x666F;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4E24;&#x70B9;&#xFF1A;</p>
<ol>
<li><p>&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x80FD;&#x4EA7;&#x751F;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;&#xFF1B;</p>
</li>
<li><p>&#x5C31;&#x662F;&#x521A;&#x624D;&#x8BF4;&#x7684;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x65E0;&#x540E;&#x6548;&#x6027;&#x3002;</p>
</li>
</ol>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4F7F;&#x7528;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x89E3;&#x9898;&#x7684;&#x4E00;&#x822C;&#x6B65;&#x9AA4;&#x4E3A;&#xFF1A;</p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5148;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x95EE;&#x9898;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x6B65;&#x3001;&#x6309;&#x8D2A;&#x5FC3;&#x7B56;&#x7565;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x5408;&#x5E76;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
</li>
</ol>
<table>
<thead>
<tr>
<th style="text-align:center">&#x7B97;&#x6CD5;</th>
<th>&#x9002;&#x7528;&#x573A;&#x666F;</th>
<th>&#x4F7F;&#x7528;&#x65B9;&#x6CD5;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">&#x8D2A;&#x5FC3;</td>
<td>1. &#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x80FD;&#x4EA7;&#x751F;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;<br>2. &#x5177;&#x5907;&#x540E;&#x65E0;&#x6548;&#x6027;</td>
<td>1. &#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x95EE;&#x9898;<br>2. &#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;<br>3. &#x5408;&#x5E76;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;</td>
</tr>
<tr>
<td style="text-align:center">&#x56DE;&#x6EAF;</td>
<td>1. &#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;<br>2. &#x83B7;&#x53D6;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x6240;&#x6709;&#x89E3;</td>
<td>1. &#x5B9A;&#x4E49;&#x89E3;&#x7A7A;&#x95F4;<br>2. &#x786E;&#x5B9A;&#x662F;&#x5426;&#x8FDB;&#x884C;&#x62D3;&#x5C55;&#x641C;&#x7D22;&#x7684;&#x89C4;&#x5219;<br>3. &#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x904D;&#x5386;</td>
</tr>
<tr>
<td style="text-align:center">&#x5206;&#x652F;&#x754C;&#x5B9A;</td>
<td>1. &#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;<br>2. &#x83B7;&#x53D6;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x4EFB;&#x610F;&#x89E3;</td>
<td>1. &#x786E;&#x5B9A;&#x89E3;&#x7279;&#x5F81;<br>2. &#x786E;&#x5B9A;&#x5B50;&#x8282;&#x70B9;&#x641C;&#x7D22;&#x7B56;&#x7565;&#xFF08;FIFO&#x3001;LIFO&#xFF09;<br>3. &#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x904D;&#x5386;</td>
</tr>
</tbody>
</table>
<h4 id="&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;"><strong>&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;</strong></h4>
<p>&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x7684;&#x641C;&#x7D22;&#x7B97;&#x6CD5;&#xFF0C;&#x6309;&#x9009;&#x4F18;&#x7684;&#x6761;&#x4EF6;&#x5411;&#x524D;&#x641C;&#x7D22;&#xFF0C;&#x5F53;&#x63A2;&#x7D22;&#x5230;&#x67D0;&#x4E00;&#x6B65;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x539F;&#x5148;&#x9009;&#x62E9;&#x5E76;&#x4E0D;&#x4F18;&#x6216;&#x8FBE;&#x4E0D;&#x5230;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x9000;&#x56DE;&#x4E0A;&#x4E00;&#x6B65;&#x91CD;&#x65B0;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x79CD;&#x8D70;&#x4E0D;&#x901A;&#x5C31;&#x9000;&#x56DE;&#x518D;&#x8D70;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x56DE;&#x6EAF;&#x6CD5;&#x3002;</p>
<p>&#x56DE;&#x6EAF;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x80FD;&#x591F;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x6240;&#x6709;&#x89E3;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x8FF7;&#x5BAB;&#x95EE;&#x9898;&#x7B49;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x56DE;&#x6EAF;&#x6CD5;&#x4E00;&#x822C;&#x7684;&#x89E3;&#x9898;&#x6B65;&#x9AA4;&#x4E3A;&#xFF1A;</p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x6B65;&#x5148;&#x9488;&#x5BF9;&#x6240;&#x7ED9;&#x95EE;&#x9898;&#xFF0C;&#x786E;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x7A7A;&#x95F4;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x6B65;&#x3001;&#x786E;&#x5B9A;&#x7ED3;&#x70B9;&#x7684;&#x6269;&#x5C55;&#x641C;&#x7D22;&#x89C4;&#x5219;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x4EE5;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x65B9;&#x5F0F;&#x641C;&#x7D22;&#x89E3;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x5728;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#x4E2D;&#x7528;&#x526A;&#x679D;&#x51FD;&#x6570;&#x907F;&#x514D;&#x65E0;&#x6548;&#x641C;&#x7D22;&#x3002;</p>
</li>
</ol>
<h4 id="&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;"><strong>&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;</strong></h4>
<p>&#x6700;&#x540E;&#x662F;&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;&#xFF0C;&#x4E0E;&#x56DE;&#x6EAF;&#x6CD5;&#x7684;&#x6C42;&#x89E3;&#x76EE;&#x6807;&#x4E0D;&#x540C;&#x3002;&#x56DE;&#x6EAF;&#x6CD5;&#x7684;&#x6C42;&#x89E3;&#x76EE;&#x6807;&#x662F;&#x627E;&#x51FA;&#x6EE1;&#x8DB3;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x89E3;&#xFF0C;&#x800C;&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;&#x7684;&#x6C42;&#x89E3;&#x76EE;&#x6807;&#x5219;&#x662F;&#x627E;&#x51FA;&#x6EE1;&#x8DB3;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x3002;</p>
<p>&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#xFF0C;&#x5E76;&#x4E14;&#x83B7;&#x53D6;&#x89E3;&#x7A7A;&#x95F4;&#x7684;&#x4EFB;&#x610F;&#x89E3;&#x5C31;&#x53EF;&#x4EE5;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x6C42;&#x89E3;&#x6574;&#x6570;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5206;&#x652F;&#x754C;&#x5B9A;&#x6CD5;&#x4E00;&#x822C;&#x7684;&#x89E3;&#x9898;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x7B2C;&#x4E00;&#x6B65;&#x5148;&#x786E;&#x5B9A;&#x89E3;&#x7684;&#x7279;&#x5F81;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#x6B65;&#x5728;&#x786E;&#x5B9A;&#x5B50;&#x8282;&#x70B9;&#x641C;&#x7D22;&#x7B56;&#x7565;&#xFF0C;&#x4F8B;&#x5982;&#x662F;&#x5148;&#x5165;&#x5148;&#x51FA;&#xFF0C;&#x8FD8;&#x662F;&#x5148;&#x5165;&#x540E;&#x51FA;&#xFF1B;</p>
</li>
<li><p>&#x7B2C;&#x4E09;&#x6B65;&#x901A;&#x8FC7;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x904D;&#x5386;&#x5BFB;&#x627E;&#x89E3;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;">&#x8003;&#x5BDF;&#x70B9;&#x548C;&#x52A0;&#x5206;&#x9879;</h3>
<h4 id="&#x8003;&#x5BDF;&#x70B9;"><strong>&#x8003;&#x5BDF;&#x70B9;</strong></h4>
<ol>
<li><p>&#x4EE5;&#x4E0A;&#x662F;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x5185;&#x5BB9;&#x5212;&#x7684;&#x91CD;&#x70B9;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4ECE;&#x9762;&#x8BD5;&#x5B98;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x603B;&#x7ED3;&#x76F8;&#x5173;&#x7684;&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#xFF1A;</p>
</li>
<li><p>&#x4E86;&#x89E3;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53CA;&#x7279;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x8FD9;&#x4E9B;&#x6811;&#x6709;&#x54EA;&#x4E9B;&#x7279;&#x70B9;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x8868;&#x3001;&#x6808;&#x3001;&#x961F;&#x5217;&#x3001;&#x6811;&#xFF0C;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x5B9E;&#x73B0;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x7EA2;&#x9ED1;&#x6811;&#x9002;&#x5408;&#x7528;&#x6765;&#x505A;&#x641C;&#x7D22;&#xFF0C;B+ &#x6811;&#x9002;&#x5408;&#x7528;&#x6765;&#x505A;&#x7D22;&#x5F15;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x4E86;&#x89E3;&#x5E38;&#x7528;&#x7684;&#x641C;&#x7D22;&#x3001;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x53CA;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x7279;&#x522B;&#x662F;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x548C;&#x5806;&#x6392;&#x5E8F;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8981;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x4E86;&#x89E3;&#x5E38;&#x7528;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#x7B97;&#x6CD5;&#xFF0C;&#x548C;&#x5904;&#x7406;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x4F8B;&#x5982;BM&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x540E;&#x7F00;&#x5339;&#x914D;&#x8FDB;&#x884C;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x80FD;&#x591F;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4F8B;&#x5982;TopK&#x95EE;&#x9898;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x8BA1;&#x7B97;&#xFF1B;</p>
</li>
<li><p>&#x8981;&#x4E86;&#x89E3;&#x4E94;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#x548C;&#x89E3;&#x51B3;&#x54EA;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x89E3;&#x9898;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>
</li>
</ol>
<h4 id="&#x52A0;&#x5206;&#x9879;"><strong>&#x52A0;&#x5206;&#x9879;</strong></h4>
<ol>
<li><p>&#x8981;&#x60F3;&#x5728;&#x7B97;&#x6CD5;&#x9762;&#x8BD5;&#x7684;&#x76F8;&#x5173;&#x9898;&#x76EE;&#x83B7;&#x5F97;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x52A0;&#x5206;&#xFF0C;&#x7262;&#x8BB0;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#xFF1A;</p>
</li>
<li><p>&#x80FD;&#x591F;&#x5C06;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x7ED3;&#x5408;&#xFF0C;&#x4F8B;&#x5982;&#x4ECB;&#x7ECD;&#x7EA2;&#x9ED1;&#x6811;&#x65F6;&#x7ED3;&#x5408; TreeMap &#x7684;&#x5B9E;&#x73B0;&#xFF1B;&#x4ECB;&#x7ECD; B+ &#x6811;&#x65F6;&#x7ED3;&#x5408; MySQL &#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x5B9E;&#x73B0;&#x7B49;&#x7B49;&#xFF1B;</p>
</li>
<li><p>&#x80FD;&#x77E5;&#x9053;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#x5728;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x4F8B;&#x5982; TopK &#x7B97;&#x6CD5;&#x5728;&#x70ED;&#x95E8;&#x6392;&#x5E8F;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#xFF1B;</p>
</li>
<li><p>&#x9762;&#x5BF9;&#x6A21;&#x7CCA;&#x7684;&#x9898;&#x76EE;&#x80FD;&#x4E3B;&#x52A8;&#x6C9F;&#x901A;&#x786E;&#x8BA4;&#x6761;&#x4EF6;&#x548C;&#x8FB9;&#x754C;&#xFF0C;&#x4F8B;&#x5982;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x62EC;&#x53F7;&#x5339;&#x914D;&#x95EE;&#x9898;&#x65F6;&#x5217;&#x4E3E;&#x7684;&#x90A3;&#x4E9B;&#x7EC6;&#x8282;&#x70B9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8DDF;&#x9762;&#x8BD5;&#x5B98;&#x518D;&#x6B21;&#x786E;&#x8BA4;&#xFF1B;</p>
</li>
<li><p>&#x5728;&#x4E66;&#x5199;&#x7B97;&#x6CD5;&#x4EE3;&#x7801;&#x524D;&#xFF0C;&#x5148;&#x8BB2;&#x4E00;&#x4E0B;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#xFF0C;&#x4E0D;&#x8981;&#x4E00;&#x4E0A;&#x6765;&#x57CB;&#x5934;&#x5C31;&#x5199;&#x3002;&#x4E00;&#x822C;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x90FD;&#x4F1A;&#x9002;&#x5F53;&#x8FDB;&#x884C;&#x5F15;&#x5BFC;&#xFF1B;</p>
</li>
<li><p>&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x89E3;&#x7B54;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x7ED9;&#x51FA;&#x6539;&#x8FDB;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x6BD4;&#x5982;&#x9762;&#x8BD5;&#x65F6;&#x7531;&#x4E8E;&#x65F6;&#x95F4;&#x5173;&#x7CFB;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x6BD4;&#x8F83;&#x4FDD;&#x5B88;&#x7684;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x8FD9;&#x65F6;&#x53EF;&#x4EE5;&#x5728;&#x89E3;&#x7B54;&#x540E;&#xFF0C;&#x6307;&#x51FA;&#x5F53;&#x524D;&#x7B97;&#x6CD5;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x6539;&#x8FDB;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x63D0;&#x9AD8;&#x6C42;&#x89E3;&#x6027;&#x80FD;&#x3002;</p>
</li>
</ol>
<hr>
<h3 id="&#x771F;&#x9898;&#x6C47;&#x603B;">&#x771F;&#x9898;&#x6C47;&#x603B;</h3>
<p>&#x6700;&#x540E;&#x6765;&#x770B;&#x4E0B;&#x5E38;&#x89C1;&#x7684;&#x9762;&#x8BD5;&#x771F;&#x9898;&#xFF0C;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509215452.png?imageslim" alt=""></p>
<ul>
<li><p>&#x7B2C; 1&#x3001;2 &#x9898;&#x90FD;&#x662F;&#x57FA;&#x7840;&#x7B97;&#x6CD5;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x7262;&#x7262;&#x638C;&#x63E1;&#xFF0C;&#x4E00;&#x4E9B;&#x9898;&#x76EE;&#x8981;&#x8BB0;&#x4F4F;&#x9012;&#x5F52;&#x4E0E;&#x975E;&#x9012;&#x5F52;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x6811;&#x7684;&#x904D;&#x5386;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7B49;&#xFF1B;</p>
</li>
<li><p>&#x7C7B;&#x4F3C;&#x7B2C; 5 &#x9898;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x9650;&#x5236;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x8981;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5206;&#x6CBB;&#x601D;&#x60F3;&#x8FDB;&#x884C;&#x5206;&#x89E3;&#x5904;&#x7406;&#xFF1B;</p>
</li>
<li><p>&#x7B2C; 6 &#x9898;&#x6570;&#x7EC4;&#x53BB;&#x91CD;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6392;&#x5E8F;&#x548C; Hash &#x4E24;&#x79CD;&#x601D;&#x8DEF;&#x3002;</p>
</li>
</ul>
<p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x771F;&#x9898;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210509215526.png?imageslim" alt=""></p>
<ul>
<li><p>&#x7B2C; 9 &#x9898;&#x6210;&#x8BED;&#x63A5;&#x9F99;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x89E3;&#x51B3;&#xFF1B;</p>
</li>
<li><p>&#x7B2C; 10 &#x9898;&#x5BFB;&#x627E;&#x4E24;&#x8282;&#x70B9;&#x516C;&#x5171;&#x7956;&#x5148;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x901A;&#x8FC7;&#x9012;&#x5F52;&#x4E0E;&#x975E;&#x9012;&#x5F52;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x3002;</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第5节：并发与多线程.html" class="navigation navigation-prev " aria-label="Previous page: 第5节：并发与多线程">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第7节：常用工具集.html" class="navigation navigation-next " aria-label="Next page: 第7节：常用工具集">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第6节：数据结构与算法","level":"1.3.7","depth":2,"next":{"title":"第7节：常用工具集","level":"1.3.8","depth":2,"path":"32个Java面试必考点/第7节：常用工具集.md","ref":"32个Java面试必考点/第7节：常用工具集.md","articles":[]},"previous":{"title":"第5节：并发与多线程","level":"1.3.6","depth":2,"path":"32个Java面试必考点/第5节：并发与多线程.md","ref":"32个Java面试必考点/第5节：并发与多线程.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第6节：数据结构与算法.md","mtime":"2021-05-09T13:55:47.116Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-09T17:48:27.126Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

