
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一节：技术人职业发展路径 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第二节：操作系统与计算机网络.html" />
    
    
    <link rel="prev" href="开篇：建立年薪50万的能力框架.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../前言.html">
            
                <a href="../前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="概述.html">
            
                <a href="概述.html">
            
                    
                    32个Java面试必考点
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="开篇：建立年薪50万的能力框架.html">
            
                <a href="开篇：建立年薪50万的能力框架.html">
            
                    
                    开篇：建立年薪50万的能力框架
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="第一节：技术人职业发展路径.html">
            
                <a href="第一节：技术人职业发展路径.html">
            
                    
                    第一节：技术人职业发展路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="第二节：操作系统与计算机网络.html">
            
                <a href="第二节：操作系统与计算机网络.html">
            
                    
                    第二节：操作系统与计算机网络
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第一节：技术人职业发展路径</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6280;&#x672F;&#x4EBA;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;">&#x6280;&#x672F;&#x4EBA;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;</h2>
<p>&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#x5E94;&#x8BE5;&#x5BF9;&#x76EE;&#x6807;&#x516C;&#x53F8;&#x3001;&#x5C97;&#x4F4D;&#x8981;&#x6C42;&#x53CA;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x53EF;&#x4EE5;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x7A81;&#x7834;&#x3002;</p>
<hr>
<h3 id="&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;">&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;</h3>
<p>&#x5148;&#x4ECE;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x804C;&#x4E1A;&#x4E0A;&#x5347;&#x7A7A;&#x95F4;&#x5F00;&#x59CB;&#x8BB2;&#x89E3;&#x3002;&#x201C;&#x80FD;&#x8C08;&#x8C08;&#x4F60;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x5417;&#xFF1F;&#x201D;&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x4EBA;&#x9762;&#x8BD5;&#x90FD;&#x4F1A;&#x88AB;&#x95EE;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6280;&#x672F;&#x5C97;&#x548C;&#x5176;&#x4ED6;&#x5C97;&#x4F4D;&#x4E00;&#x6837;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x6709;&#x89C4;&#x5212;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5BF9;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x6709;&#x4E24;&#x4E2A;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6280;&#x672F;&#x65B9;&#x5411;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x7BA1;&#x7406;&#x65B9;&#x5411;&#xFF0C;&#x8FD9;&#x4E24;&#x6761;&#x8DEF;&#x5F84;&#x4FA7;&#x91CD;&#x7684;&#x80FD;&#x529B;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x5174;&#x8DA3;&#x3001;&#x80FD;&#x529B;&#x4F18;&#x52BF;&#x6709;&#x4FA7;&#x91CD;&#x7684;&#x8FDB;&#x884C;&#x80FD;&#x529B;&#x57F9;&#x517B;&#xFF0C;&#x6210;&#x957F;&#x8DEF;&#x5F84;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210506220442.png?imageslim" alt="&#x53D1;&#x5C55;&#x8DEF;&#x5F84;"></p>
<p>&#x5728;&#x521A;&#x5165;&#x804C;&#x7684; 1&#xFF5E;3 &#x5E74;&#x5185;&#xFF0C;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;&#x6BD4;&#x8F83;&#x5355;&#x4E00;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4ECE;&#x5DE5;&#x7A0B;&#x5E08;&#x5F80;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x79EF;&#x7D2F;&#xFF0C;&#x592F;&#x5B9E;&#x540E;&#x7EED;&#x53D1;&#x5C55;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x91CD;&#x70B9;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x57FA;&#x7840;&#x80FD;&#x529B;&#xFF0C;&#x57F9;&#x517B;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#x548C;&#x5E7F;&#x5EA6;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x65B9;&#x5411;&#x7684;&#x65B0;&#x6280;&#x672F;&#x4FDD;&#x6301;&#x5F3A;&#x70C8;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x548C;&#x5B66;&#x4E60;&#x5FC3;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x8DEF;&#x6253;&#x602A;&#x5347;&#x7EA7;&#x4E3A;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x9762;&#x4E34;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x7684;&#x9009;&#x62E9;&#xFF1A;&#x6280;&#x672F; or &#x7BA1;&#x7406;&#x3002;</p>
<ol>
<li>&#x5982;&#x679C;&#x6253;&#x7B97;&#x5F80;&#x6280;&#x672F;&#x65B9;&#x5411;&#x6DF1;&#x6316;&#xFF0C;&#x4E0A;&#x5347;&#x901A;&#x9053;&#x6709;&#xFF1A;&#x8D44;&#x6DF1;&#x5DE5;&#x7A0B;&#x5E08;&#x3001;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x3001;&#x9AD8;&#x7EA7;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x3001;&#x7814;&#x7A76;&#x5458;&#x3001;&#x79D1;&#x5B66;&#x5BB6;&#x7B49;&#x3002;&#x9700;&#x8981;&#x4F60;&#x91CD;&#x70B9;&#x57F9;&#x517B;&#x6280;&#x672F;&#x653B;&#x575A;&#x80FD;&#x529B;&#xFF0C;&#x5305;&#x62EC;&#x7591;&#x96BE;&#x95EE;&#x9898;&#x7684;&#x6392;&#x67E5;&#x3001;&#x5927;&#x578B;&#x9879;&#x76EE;&#x7684;&#x529F;&#x80FD;&#x62C6;&#x5206;&#x3001;&#x6280;&#x672F;&#x54C1;&#x724C;&#x7684;&#x5851;&#x9020;&#x7B49;&#x3002;&#x5177;&#x4F53;&#x7684;&#x5DE5;&#x4F5C;&#x5305;&#x62EC;&#xFF1A;&#x539F;&#x7406;&#x3001;&#x5B9E;&#x73B0;&#x3001;&#x6CE8;&#x91CD;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x7684;&#x57F9;&#x517B;&#xFF0C;&#x66F4;&#x6DF1;&#x4E00;&#x5C42;&#x8FD8;&#x6709;&#xFF1A;&#x5927;&#x89C4;&#x6A21;&#x3001;&#x9AD8;&#x5E76;&#x53D1;&#x573A;&#x666F;&#xFF0C;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x63AA;&#x65BD;&#x548C;&#x65B9;&#x6848;&#x3001;&#x4E1A;&#x52A1;&#x7684;&#x62BD;&#x8C61;&#x3001;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x7406;&#x89E3;&#x7B49;&#x3002;</li>
<li>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x5C31;&#x662F;&#x7BA1;&#x7406;&#x3002;&#x7BA1;&#x7406;&#x5E8F;&#x5217;&#x504F;&#x91CD;&#x4E8E;&#x56E2;&#x961F;&#x628A;&#x63A7;&#xFF0C;&#x9700;&#x8981;&#x8BA9;&#x56E2;&#x961F;&#x5F62;&#x6210;&#x6280;&#x672F;&#x6218;&#x6597;&#x529B;&#xFF0C;&#x5229;&#x7528;&#x4E00;&#x5207;&#x8D44;&#x6E90;&#x63A8;&#x8FDB;&#x9879;&#x76EE;&#xFF0C;&#x8BA9;&#x56E2;&#x961F;&#x5B8C;&#x6210;&#x4F5C;&#x6218;&#x76EE;&#x6807;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x505A;&#x597D;&#x56E2;&#x961F;&#x5185;&#x548C;&#x8DE8;&#x56E2;&#x961F;&#x7684;&#x6C9F;&#x901A;&#x3001;&#x534F;&#x4F5C;&#x4E5F;&#x662F;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x73AF;&#x3002;</li>
</ol>
<p>&#x5728;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5E8F;&#x5217;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x660E;&#x663E;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x4F8B;&#x5982;&#x505A;&#x7BA1;&#x7406;&#x4E0D;&#x8868;&#x793A;&#x8FDC;&#x79BB;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF1B;&#x800C;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x4E5F;&#x4E0D;&#x662F;&#x5355;&#x5175;&#x4F5C;&#x6218;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5E26;&#x9886;&#x56E2;&#x961F;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x533A;&#x5206;&#x70B9;&#x5728;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#xFF1A;&#x5230;&#x5E95;&#x662F;&#x66F4;&#x504F;&#x6280;&#x672F;&#x67B6;&#x6784;&#xFF0C;&#x8FD8;&#x662F;&#x66F4;&#x504F;&#x7BA1;&#x7406;&#x4E0E;&#x9879;&#x76EE;&#x63A8;&#x8FDB;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x9762;&#x8BD5;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#xFF0C;&#x7B54;&#x6848;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x9762;&#x8BD5;&#x524D;&#x6253;&#x4E2A;&#x8179;&#x7A3F;&#x5C31;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4F60;&#x8FDB;&#x5165;&#x804C;&#x573A;&#xFF0C;&#x51C6;&#x5907;&#x6210;&#x4E3A;&#x4E00;&#x4F4D;&#x5DE5;&#x7A0B;&#x5E08;&#x65F6;&#xFF0C;&#x5FC3;&#x91CC;&#x5C31;&#x8BE5;&#x6709;&#x4E2A;&#x8C31;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7ED9;&#x6709;&#x4E2A;&#x9762;&#x8BD5;&#x5C0F;&#x8BC0;&#x7A8D;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E48;&#x56DE;&#x7B54;&#x80FD;&#x52A0;&#x5206;&#x5F88;&#x591A;&#xFF1A;&#x201C;&#x4ECE;&#x8FC7;&#x5F80;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x6574;&#x4F53;&#x89C4;&#x5212;&#x3001;&#x7BA1;&#x7406;&#x63A8;&#x8FDB;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5728;&#x4EFB;&#x52A1;&#x63A8;&#x8FDB;&#x3001;&#x534F;&#x8C03;&#x6C9F;&#x901A;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x6BD4;&#x8F83;&#x7A81;&#x51FA;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x6280;&#x672F;&#x7ECF;&#x7406;&#xFF0C;&#x5E76;&#x4EE5;&#x7BA1;&#x7406;&#x65B9;&#x5411;&#x4E3A;&#x53D1;&#x5C55;&#x76EE;&#x6807;&#x3002;&#x201C;&#x8FD9;&#x4E48;&#x63A5;&#x4E0B;&#x53BB;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x4F60;&#x7684;&#x76F8;&#x5173;&#x7ECF;&#x5386;&#x5F00;&#x59CB;&#x8BE2;&#x95EE;&#x3002;</p>
<hr>
<h3 id="&#x5E38;&#x89C1;&#x6280;&#x672F;&#x5C97;&#x4F4D;&#x5212;&#x5206;">&#x5E38;&#x89C1;&#x6280;&#x672F;&#x5C97;&#x4F4D;&#x5212;&#x5206;</h3>
<p>&#x9664;&#x4E86;&#x6709;&#x660E;&#x786E;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x5916;&#xFF0C;&#x60F3;&#x8981;&#x5F80;&#x9AD8;&#x5904;&#x8D70;&#x8FD8;&#x5F97;&#x4E86;&#x89E3;&#x804C;&#x7EA7;&#x5212;&#x5206;&#x4E0E;&#x5BF9;&#x5E94;&#x7684;&#x8F6F;&#x3001;&#x786C;&#x6280;&#x80FD;&#x8981;&#x6C42;&#x3002;&#x8FD9;&#x6837;&#x4F60;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x6709;&#x610F;&#x8BC6;&#x5F97;&#x8865;&#x8DB3;&#x6B20;&#x7F3A;&#xFF0C;&#x63D0;&#x9AD8;&#x6C34;&#x5E73;&#x3002;</p>
<p>&#x5E94;&#x8058;&#x4E0D;&#x540C;&#x516C;&#x53F8;&#x3001;&#x4E0D;&#x540C;&#x7EA7;&#x522B;&#x7684;&#x5C97;&#x4F4D;&#x65F6;&#xFF0C;&#x8981;&#x91CD;&#x70B9;&#x63D0;&#x5347;&#x54EA;&#x65B9;&#x9762;&#x7684;&#x6280;&#x80FD;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5BF9;&#x7167;&#x4E0B;&#x56FE;&#xFF0C;&#x7B80;&#x5355;&#x4ECB;&#x7ECD; BAT &#x7684;&#x6280;&#x672F;&#x5E8F;&#x5217;&#x7684;&#x5C97;&#x4F4D;&#x5212;&#x5206;&#x3001;&#x5BF9;&#x5E94;&#x7684;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x53CA;&#x804C;&#x7EA7;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210506220823.png?imageslim" alt="&#x5C97;&#x4F4D;&#x5212;&#x5206;"></p>
<ul>
<li>1&#xFF5E;3 &#x5E74;&#x7684;&#x521D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x5C97;&#x4F4D;&#x5728;&#x963F;&#x91CC;&#x3001;&#x767E;&#x5EA6;&#x3001;&#x817E;&#x8BAF;&#x7B49;&#x5927;&#x5382;&#x5F88;&#x5C11;&#x8FDB;&#x884C;&#x793E;&#x62DB;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x4ECE;&#x6821;&#x62DB;&#x751F;&#x5185;&#x90E8;&#x664B;&#x5347;&#x3002;</li>
<li>&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x4E00;&#x822C;&#x9700;&#x8981;&#x6709; 2&#xFF5E;5 &#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x5BF9;&#x5E94;&#x767E;&#x5EA6;&#x4E2D;&#x7684; T4&#x3001;&#x963F;&#x91CC;&#x7684; P5&#xFF0C;&#x4EE5;&#x53CA;&#x817E;&#x8BAF;&#x7684; T2-2&#xFF08;&#x5BF9;&#x5E94;&#x817E;&#x8BAF;&#x6700;&#x65B0;&#x804C;&#x7EA7;&#x4F53;&#x7CFB; T7&#xFF09;&#x3002;</li>
<li>&#x8D44;&#x6DF1;&#x5DE5;&#x7A0B;&#x5E08;&#x4E00;&#x822C;&#x8981;&#x6C42; 3&#xFF5E;6 &#x5E74;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C97;&#x4F4D;&#x4E00;&#x822C;&#x5BF9;&#x5E94;&#x767E;&#x5EA6;&#x4E2D;&#x7684; T5&#x3001;&#x963F;&#x91CC;&#x7684; P6&#xFF0C;&#x4EE5;&#x53CA;&#x817E;&#x8BAF;&#x7684; T2-3&#xFF08;&#x5BF9;&#x5E94;&#x817E;&#x8BAF;&#x6700;&#x65B0;&#x804C;&#x7EA7;&#x4F53;&#x7CFB; T8&#xFF09;&#x3002;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x8D44;&#x6DF1;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x5404;&#x4E2A;&#x516C;&#x53F8;&#x4E2D;&#x7684;&#x7EDD;&#x5BF9;&#x6280;&#x672F;&#x4E3B;&#x529B;&#xFF0C;&#x516C;&#x53F8;&#x975E;&#x5E38;&#x770B;&#x91CD;&#x8FD9;&#x90E8;&#x5206;&#x4EBA;&#x624D;&#x7684;&#x6210;&#x957F;&#x548C;&#x57F9;&#x517B;&#x3002;</li>
<li>&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x3001;&#x9AD8;&#x7EA7;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x81F3;&#x5C11;&#x9700;&#x8981; 5 &#x5E74;&#x4EE5;&#x4E0A;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4ECE;&#x4E1A;&#x7ECF;&#x9A8C;&#x3002;</li>
</ul>
<hr>
<h3 id="&#x9762;&#x8BD5;&#x5C97;&#x4F4D;&#x9009;&#x62E9;">&#x9762;&#x8BD5;&#x5C97;&#x4F4D;&#x9009;&#x62E9;</h3>
<p>&#x5728;&#x660E;&#x786E;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x548C;&#x5C97;&#x4F4D;&#x7EA7;&#x522B;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x9009;&#x516C;&#x53F8;&#x548C;&#x5C97;&#x4F4D;&#x4E86;&#x3002;&#x6362;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4E5F;&#x8BB8;&#x9047;&#x5230;&#x8FC7;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6709;&#x597D;&#x51E0;&#x4E2A;&#x6280;&#x672F;&#x5C97;&#x4F4D;&#xFF0C;&#x8981;&#x5168;&#x90FD;&#x6295;&#x4E00;&#x904D;&#x5417;&#xFF1F;&#x624B;&#x91CC;&#x6709;&#x591A;&#x4E2A; Offer&#xFF0C;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x9009;&#xFF0C;&#x662F;&#x6311;&#x94B1;&#x591A;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x5927;&#x5E73;&#x53F0;&#x3001;&#x798F;&#x5229;&#x5F85;&#x9047;&#x597D;&#x7684;&#xFF1F;</p>
<p>&#x5EFA;&#x8BAE;&#xFF1A;&#x6311;&#x9009;&#x5C97;&#x4F4D;&#x4E00;&#x822C;&#x4ECE;&#x516C;&#x53F8;&#x89C4;&#x6A21;&#x3001;&#x4E1A;&#x52A1;&#x7EBF;&#x6216;&#x56E2;&#x961F;&#x7684;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x4EE5;&#x53CA;&#x4E2A;&#x4EBA;&#x6761;&#x4EF6;&#x7684;&#x5339;&#x914D;&#x5EA6;&#xFF0C;&#x8FD9;&#x51E0;&#x65B9;&#x9762;&#x6765;&#x5165;&#x624B;&#x3002;</p>
<blockquote>
<p><strong>&#x516C;&#x53F8;&#x548C;&#x56E2;&#x961F;</strong></p>
<p>&#x5148;&#x6765;&#x770B;&#x516C;&#x53F8;&#x548C;&#x56E2;&#x961F;&#x3002;&#x8981;&#x6709;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x73B0;&#x5728;&#x7684;&#x6BCF;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x4E3A;&#x4E0B;&#x4E00;&#x4EFD;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x4F5C;<strong>&#x84C4;&#x52BF;</strong>&#x3002;</p>
<p>&#x5927;&#x5382;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x9540;&#x91D1;&#x63D0;&#x9AD8;&#x8EAB;&#x4EF7;&#xFF0C;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x66F4;&#x9002;&#x5408;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x53D1;&#x5C55;&#xFF0C;&#x8FDB;&#x5165;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x5728;&#x80FD;&#x529B;&#x3001;&#x7ECF;&#x9A8C;&#x4E0A;&#x90FD;&#x80FD;&#x83B7;&#x5F97;&#x8F83;&#x5927;&#x7684;&#x6210;&#x957F;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7B2C;&#x4E00;&#x8C61;&#x9650;&#x662F;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x65E0;&#x7591;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x4E5F;&#x662F;&#x7ADE;&#x4E89;&#x6700;&#x6FC0;&#x70C8;&#x7684;&#xFF0C;&#x5C3D;&#x91CF;&#x627E;&#x548C;&#x81EA;&#x5DF1;&#x80FD;&#x529B;<strong>&#x5339;&#x914D;</strong>&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x548C;&#x4F17;&#x591A;&#x9AD8;&#x624B;&#x7ADE;&#x4E89;&#xFF0C;&#x803D;&#x8BEF;&#x5B9D;&#x8D35;&#x7684;&#x6C42;&#x804C;&#x65F6;&#x95F4;&#x548C;&#x673A;&#x4F1A;&#x3002;&#x7B2C;&#x4E09;&#x8C61;&#x9650;&#xFF0C;&#x5C0F;&#x516C;&#x53F8;&#x7684;&#x8FB9;&#x7F18;&#x4E1A;&#x52A1;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x4E0B;&#x4E0B;&#x7B56;&#xFF0C;&#x5907;&#x9009;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210506221229.png?imageslim" alt="&#x8C61;&#x9650;"></p>
<p>&#x5269;&#x4E0B;&#x7684;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x4E00;&#x662F;&#x5927;&#x516C;&#x53F8;&#x7684;&#x8FB9;&#x7F18;&#x4E1A;&#x52A1;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x5C0F;&#x516C;&#x53F8;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x6700;&#x8BA9;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5EFA;&#x8BAE;&#xFF1A;&#x5BF9;&#x4E8E;&#x5DE5;&#x4F5C; 1&#xFF5E;3 &#x5E74;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x6211;&#x66F4;&#x63A8;&#x8350;&#x4F18;&#x5148;&#x9009;&#x62E9;<strong>&#x6838;&#x5FC3;&#x4E1A;&#x52A1;</strong>&#x3002;&#x4E4B;&#x524D;&#x6211;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x524D;&#x671F;&#x4EE5;&#x79EF;&#x7D2F;&#x77E5;&#x8BC6;&#x3001;&#x7ECF;&#x9A8C;&#x4E3A;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#xFF0C;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;<strong>&#x5386;&#x7EC3;&#x573A;&#x666F;</strong>&#xFF0C;&#x65E0;&#x8BBA;&#x662F;<strong>&#x5E94;&#x7528;&#x7ECF;&#x9A8C;</strong>&#x8FD8;&#x662F;<strong>&#x67B6;&#x6784;&#x7ECF;&#x9A8C;</strong>&#x90FD;&#x80FD;&#x83B7;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x6536;&#x83B7;&#x3002;</p>
<p><strong>&#x4E2A;&#x4EBA;&#x5339;&#x914D;&#x5EA6;</strong></p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x56E0;&#x7D20;&#xFF1A;&#x4E2A;&#x4EBA;&#x5339;&#x914D;&#x5EA6;&#x3002;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x5929;&#x751F;&#x5C31;&#x80FD;&#x8003;&#x4E0A;&#x6E05;&#x534E;&#x5317;&#x5927;&#xFF0C;&#x8003;&#x5927;&#x5B66;&#x5927;&#x5BB6;&#x90FD;&#x8981;&#x4F30;&#x5206;&#x518D;&#x62A5;&#x5FD7;&#x613F;&#xFF0C;&#x804C;&#x573A;&#x4E5F;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x6761;&#x4EF6;&#x6709;&#x5BA2;&#x89C2;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x518D;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#x3002;&#x8BC4;&#x4F30;&#x8303;&#x56F4;&#x5305;&#x62EC;&#x5C97;&#x4F4D;&#x8981;&#x6C42;&#x3001;&#x4E1A;&#x52A1;&#x65B9;&#x5411;&#xFF0C;&#x8FD8;&#x6709;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x3001;&#x5174;&#x8DA3;&#x3001;&#x7ECF;&#x9A8C;&#x7B49;&#x7684;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#x3002;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#x8D8A;&#x9AD8;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x6210;&#x529F;&#x7387;&#x5C31;&#x4F1A;&#x66F4;&#x9AD8;&#xFF0C;&#x4E5F;&#x66F4;&#x6709;&#x5229;&#x4E8E;&#x5165;&#x804C;&#x540E;&#x4E2A;&#x4EBA;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#x5C31;&#x662F;&#xFF1A;<strong>&#x4F18;&#x5148;&#x9009;&#x62E9;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;</strong>&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x81EA;&#x5DF1;&#x6761;&#x4EF6;<strong>&#x9AD8;&#x5EA6;&#x5339;&#x914D;</strong>&#x7684;&#x5C97;&#x4F4D;&#x3002;</p>
<p><strong>&#x5E38;&#x89C1;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;</strong></p>
<p>&#x5728;&#x641E;&#x6E05;&#x695A;&#x524D;&#x9762;&#x51E0;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;&#x4E5F;&#x662F;&#x627E;&#x5DE5;&#x4F5C;&#x524D;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x7684;&#x3002;&#x6211;&#x89C1;&#x8FC7;&#x4E00;&#x4E9B;&#x5019;&#x9009;&#x4EBA;&#x5BF9;&#x9762;&#x8BD5;&#x7684;&#x8981;&#x6C42;&#x90FD;&#x4E0D;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x5BF9;&#x5E94;&#x8F6E;&#x6B21;&#x7684;&#x9762;&#x8BD5;&#x51C6;&#x5907;&#x5C31;&#x76F4;&#x63A5;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6D6A;&#x8D39;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x5C97;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;&#x57FA;&#x672C;&#x76F8;&#x540C;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5206;&#x4E3A; 6 &#x4E2A;&#x73AF;&#x8282;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210506230829.png?imageslim" alt="&#x5E38;&#x89C1;&#x9762;&#x8BD5;&#x6D41;&#x7A0B;"></p>
<ol>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x524D;&#x7F6E;&#x7684;&#x9762;&#x8BD5;&#xFF0C;&#x5047;&#x5982;&#x5E94;&#x8058;&#x7684;&#x662F;&#x5F02;&#x5730;&#x7684;&#x804C;&#x4F4D;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5148;&#x5B89;&#x6392;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#xFF0C;&#x5927;&#x6982;&#x4E86;&#x89E3;&#x5019;&#x9009;&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#x548C;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x4F1A;&#x5728;&#x6B63;&#x5F0F;&#x9762;&#x8BD5;&#x524D;&#x5148;&#x8FDB;&#x884C;&#x7B14;&#x8BD5;&#xFF0C;&#x6216;&#x8005;&#x4E0A;&#x673A;&#x7F16;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#x521D;&#x6B21;&#x9762;&#x8BD5;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x8DDF;&#x9762;&#x8BD5;&#x5B98;&#x6C9F;&#x901A;&#x662F;&#x5426;&#x4F1A;&#x5148;&#x8FDB;&#x884C;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x7B14;&#x8BD5;&#x6216;&#x4E0A;&#x673A;&#x7F16;&#x7A0B;&#xFF0C;&#x662F;&#x5426;&#x9700;&#x8981;&#x81EA;&#x5E26;&#x7535;&#x8111;&#x7B49;&#x7EC6;&#x8282;&#x3002;</p>
</li>
<li><p>&#x6B63;&#x5F0F;&#x9762;&#x8BD5;&#x662F;&#x4ECE;&#x6280;&#x672F;&#x4E00;&#x9762;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709; 1~2 &#x4F4D;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x4F60;&#x5165;&#x804C;&#x540E;&#x7684;&#x540C;&#x7EC4;&#x540C;&#x4E8B;&#x3002;&#x4E00;&#x9762;&#x4EE5;&#x8003;&#x5BDF;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x4E0E;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x80FD;&#x529B;&#x4E3A;&#x4E3B;&#xFF0C;&#x65F6;&#x957F;&#x5927;&#x6982; 1 &#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#xFF0C;&#x662F;&#x7EAF;&#x6280;&#x672F;&#x9762;&#x8BD5;&#x3002;&#x53EF;&#x80FD;&#x4F1A;&#x8981;&#x6C42;&#x624B;&#x5199;&#x4E00;&#x4E9B;&#x5C0F;&#x7B97;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x6392;&#x5E8F;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x5177;&#x4F53;&#x8003;&#x70B9;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x540E;&#x9762;&#x7684;&#x7B97;&#x6CD5;&#x9762;&#x8BD5;&#x8BFE;&#x3002;</p>
</li>
<li><p>&#x6280;&#x672F;&#x4E8C;&#x9762;&#x4E5F;&#x662F;&#x4EE5;&#x6280;&#x672F;&#x9762;&#x4E3A;&#x4E3B;&#xFF0C;&#x504F;&#x91CD;&#x6280;&#x672F;&#x6DF1;&#x5EA6;&#x7684;&#x8003;&#x5BDF;&#xFF0C;&#x4F8B;&#x5982;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x3001;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x3001;&#x7B97;&#x6CD5;&#x7B49;&#xFF0C;&#x9762;&#x8BD5;&#x65F6;&#x957F; 1 &#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x8981;&#x6C42;&#x753B;&#x51FA;&#x9879;&#x76EE;&#x7684;&#x67B6;&#x6784;&#x56FE;&#xFF0C;&#x4EA4;&#x4E92;&#x6D41;&#x7A0B;&#x56FE;&#x7B49;&#xFF0C;&#x5E76;&#x5BF9;&#x9879;&#x76EE;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x548C;&#x6539;&#x8FDB;&#x65B9;&#x6848;&#x7B49;&#x8FDB;&#x884C;&#x8BE2;&#x95EE;&#x3002;&#x4E00;&#x822C;&#x6280;&#x672F;&#x4E8C;&#x9762;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x5C31;&#x662F;&#x4F60;&#x5165;&#x804C;&#x540E;&#x7684;&#x76F4;&#x5C5E;&#x9886;&#x5BFC;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x4E9B;&#x89C4;&#x6A21;&#x8F83;&#x5C0F;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x5230;&#x4E8C;&#x9762;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x800C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x516C;&#x53F8;&#x4F1A;&#x6709;&#x6280;&#x672F;&#x4E09;&#x9762;&#x3002;&#x6280;&#x672F;&#x4E09;&#x9762;&#x4E00;&#x822C;&#x662F;&#x534A;&#x6280;&#x672F;&#x9762;&#x8BD5;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x3001;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x4F1A;&#x6D89;&#x53CA;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x3001;&#x804C;&#x4E1A;&#x5174;&#x8DA3;&#x3001;&#x6280;&#x672F;&#x89C6;&#x91CE;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x3001;&#x6280;&#x672F;&#x654F;&#x611F;&#x5EA6;&#x3001;&#x53D1;&#x5C55;&#x6F5C;&#x529B;&#x4E3A;&#x4E3B;&#x3002;&#x4E09;&#x9762;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x4E00;&#x822C;&#x662F;&#x90E8;&#x95E8;&#x7684; leader&#x3002;&#x8FD8;&#x6709;&#x5C11;&#x90E8;&#x5206;&#x516C;&#x53F8;&#x4F1A;&#x5B58;&#x5728;&#x6280;&#x672F;&#x56DB;&#x9762;&#xFF0C;&#x4F8B;&#x5982;&#x817E;&#x8BAF;&#x5728;&#x8F83;&#x9AD8;&#x7EA7;&#x522B;&#x5C97;&#x4F4D;&#x9762;&#x8BD5;&#x65F6;&#xFF0C;&#x4F1A;&#x6709;&#x8DE8;&#x90E8;&#x95E8;&#x7684;&#x4EA4;&#x53C9;&#x9762;&#x8BD5;&#xFF0C;&#x9762;&#x8BD5;&#x5185;&#x5BB9;&#x4E0E;&#x4E09;&#x9762;&#x57FA;&#x672C;&#x76F8;&#x540C;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x4F60;&#x5F88;&#x5E78;&#x8FD0;&#x901A;&#x8FC7;&#x4E86;&#x524D;&#x9762;&#x7684;&#x51E0;&#x8F6E;&#x6280;&#x672F;&#x9762;&#x8BD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8FDB;&#x5165; HR &#x9762;&#x8BD5;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4E4B;&#x540E;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x518D;&#x51FA;&#x73B0;&#x6280;&#x672F;&#x9762;&#x8BD5;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x6C9F;&#x901A;&#x4E2A;&#x4EBA;&#x7684;&#x53D1;&#x5C55;&#x89C4;&#x5212;&#x3001;&#x4E0A;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x79BB;&#x804C;&#x539F;&#x56E0;&#x3001;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x85AA;&#x8D44;&#x5F85;&#x9047;&#x7B49;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x7279;&#x522B;&#x671F;&#x5F85;&#xFF0C;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x73AF;&#x8282;&#x56E0;&#x4E3A;&#x7EA0;&#x7ED3; 1&#xFF5E;2k &#x7684;&#x5DE5;&#x8D44;&#x800C;&#x9519;&#x5931;&#x673A;&#x4F1A;&#x3002;&#x5DE5;&#x4F5C;&#x524D;&#x671F;&#x4EE5;&#x79EF;&#x7D2F;&#x80FD;&#x529B;&#x4E3A;&#x4E3B;&#xFF0C;3 &#x5E74;&#x540E;&#x6211;&#x4EEC;&#x518D;&#x8C08;&#x5F85;&#x9047;&#x3002;</p>
</li>
<li><p>HR &#x9762;&#x8BD5;&#x540E;&#x662F;&#x516C;&#x53F8;&#x7EA7;&#x9AD8;&#x7BA1;&#x9762;&#x8BD5;&#xFF0C;&#x5177;&#x4F53;&#x8F6E;&#x6B21;&#x770B;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x822C;&#x4E00;&#x3001;&#x4E8C; &#x9762;&#xFF0C;&#x975E;&#x6280;&#x672F;&#x9762;&#x4E3A;&#x4E3B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7B80;&#x5355;&#x8BE2;&#x95EE;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x3001;&#x5BF9;&#x516C;&#x53F8;&#x7684;&#x770B;&#x6CD5;&#x3001;&#x5BF9;&#x884C;&#x4E1A;&#x7684;&#x770B;&#x6CD5;&#x3001;&#x672A;&#x6765;&#x89C4;&#x5212;&#x7B49;&#xFF0C;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x539F;&#x5219;&#x6027;&#x9519;&#x8BEF;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x3002;</p>
</li>
</ol>
<p>  <strong>&#x6574;&#x4F53;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF1A;</strong></p>
<ul>
<li>&#x9762;&#x8BD5;&#x524D;&#x8BE2;&#x95EE;&#x662F;&#x5426;&#x6709;&#x7535;&#x8BDD;&#x9762;&#x8BD5;&#x3001;&#x7B14;&#x8BD5;&#x3001;&#x4E0A;&#x673A;&#x7B49;&#x524D;&#x7F6E;&#x9762;&#x8BD5;&#xFF1B;</li>
<li>&#x6280;&#x672F;&#x4E00;&#x9762;&#x3001;&#x4E8C;&#x9762;&#x5173;&#x6CE8;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#xFF1B;</li>
<li>&#x4E8C;&#x9762;&#x3001;&#x4E09;&#x9762;&#x504F;&#x91CD;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x4E0E;&#x53D1;&#x5C55;&#x6F5C;&#x529B;&#xFF0C;&#x4E8C;&#x9762;&#x4E0E;&#x4E09;&#x9762;&#x4E00;&#x822C;&#x51B3;&#x5B9A;&#x4F60;&#x7684;&#x5165;&#x804C;&#x804C;&#x7EA7;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x597D;&#x597D;&#x8868;&#x73B0;&#x3002;</li>
</ul>
<p><strong>&#x9762;&#x8BD5;&#x524D;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;</strong></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x660E;&#x5929;&#x5C31;&#x6709;&#x4E2A;&#x9762;&#x8BD5;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x524D;&#x671F;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x5BF9;&#x9762;&#x8BD5;&#x6210;&#x8D25;&#x8D77;&#x5230;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5F71;&#x54CD;&#x9762;&#x8BD5;&#x6210;&#x529F;&#x7684;&#x4E09;&#x5927;&#x57FA;&#x77F3;&#x662F;&#xFF1A;&#x80FD;&#x529B;&#x3001;&#x5FC3;&#x6001;&#x548C;&#x6C9F;&#x901A;&#x3002;</p>
<ol>
<li><p>&#x80FD;&#x529B;&#x3002;&#x4F18;&#x79C0;&#x7684;&#x6280;&#x672F;&#x57FA;&#x672C;&#x529F;&#x662F;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x6BD5;&#x7ADF;&#x516C;&#x53F8;&#x662F;&#x62DB;&#x4F60;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x80FD;&#x529B;&#x5176;&#x4ED6;&#x7684;&#x90FD;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#xFF1B;</p>
</li>
<li><p>&#x5FC3;&#x6001;&#x3002;&#x6CE8;&#x610F;&#x5E73;&#x8861;&#x5FC3;&#x6001;&#xFF0C;&#x8FC7;&#x4E8E;&#x7D27;&#x5F20;&#x4F1A;&#x5BFC;&#x81F4;&#x5E73;&#x65F6;&#x4F1A;&#x7684;&#x5185;&#x5BB9;&#x6CA1;&#x6709;&#x56DE;&#x7B54;&#x4E0A;&#x6765;&#xFF1B;</p>
</li>
<li><p>&#x6C9F;&#x901A;&#x3002;&#x4E0E;&#x9762;&#x8BD5;&#x5B98;&#x4EA4;&#x6D41;&#x987A;&#x7545;&#xFF0C;&#x4F1A;&#x7ED9;&#x4F60;&#x7684;&#x9762;&#x8BD5;&#x52A0;&#x5206;&#xFF1B;&#x53CD;&#x8FC7;&#x6765;&#x5982;&#x679C;&#x6C9F;&#x901A;&#x4E0D;&#x987A;&#x7545;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x53D8;&#x6210;&#x81F4;&#x547D;&#x4E00;&#x5200;&#xFF0C;&#x76F4;&#x63A5;&#x88AB; Pass&#x3002;</p>
</li>
</ol>
<p>  &#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x9762;&#x8BD5;&#x65F6;<strong>&#x7A33;&#x5B9A;&#x53D1;&#x6325;</strong>&#xFF1F;</p>
<ul>
<li><p>&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x77ED;&#x671F;&#x5185;&#x7A81;&#x51FB;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x9762;&#x8BD5;&#x524D;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x51C6;&#x5907;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>a &#x7CFB;&#x7EDF;&#x5730;&#x590D;&#x4E60;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;</p>
<p>b &#x5BF9;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x8FDB;&#x884C;&#x63D0;&#x70BC;&#xFF0C;&#x5BF9;&#x539F;&#x6765;&#x8D1F;&#x8D23;&#x7684;&#x9879;&#x76EE;&#x4ECE;&#x67B6;&#x6784;&#x65B9;&#x9762;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x3001;&#x68B3;&#x7406;&#x3001;&#x603B;&#x7ED3;&#x3002;</p>
<p>c &#x5BF9;&#x4E00;&#x4E9B;&#x5178;&#x578B;&#x6846;&#x67B6;&#x7684;&#x539F;&#x7406;&#x3001;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x53CA;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3001;&#x5BF9;&#x5E38;&#x8003;&#x7684;&#x8003;&#x70B9;&#x8FDB;&#x884C;&#x4E13;&#x9879;&#x7A81;&#x51FB;&#x3002;</p>
<p>d &#x9605;&#x8BFB;&#x5E38;&#x8003;&#x8003;&#x70B9;&#x6E90;&#x7801;&#x3002;</p>
<p>e &#x6839;&#x636E;&#x9762;&#x8BD5;&#x5C97;&#x4F4D;&#x4E1A;&#x52A1;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x9762;&#x8BD5;&#x4E2D;&#x95F4;&#x4EF6;&#x65B9;&#x5411;&#x7684;&#x5C97;&#x4F4D;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x7A81;&#x51FA;&#x81EA;&#x5DF1;&#x6709;&#x8FC7;&#x5B58;&#x50A8;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x7ECF;&#x5386;&#x3001;&#x6709;&#x8FC7;&#x94FE;&#x8DEF;&#x534F;&#x8BAE;&#x5C42;&#x8BBE;&#x8BA1;&#x7ECF;&#x5386;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x5173;&#x4E8E;&#x5FC3;&#x6001;&#xFF0C;&#x9762;&#x8BD5;&#x524D;&#x591A;&#x65B9;&#x9762;&#x641C;&#x96C6;&#x9762;&#x8BD5;&#x516C;&#x53F8;&#x3001;&#x5C97;&#x4F4D;&#x6240;&#x5C5E;&#x56E2;&#x961F;&#x3001;&#x5E73;&#x5747;&#x798F;&#x5229;&#x7B49;&#x8D44;&#x6599;&#x4FE1;&#x606F;&#xFF0C;&#x77E5;&#x5DF1;&#x77E5;&#x5F7C;&#x6709;&#x52A9;&#x4E8E;&#x589E;&#x52A0;&#x81EA;&#x4FE1;&#x3002;&#x63D0;&#x793A;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x4E9B;&#x516C;&#x53F8;&#x559C;&#x6B22;&#x538B;&#x529B;&#x9762;&#x8BD5;&#xFF0C;&#x7279;&#x522B;&#x5728;&#x9762;&#x8BD5;&#x5B98;&#x5C42;&#x7EA7;&#x8F83;&#x9AD8;&#x65F6;&#x53D1;&#x751F;&#x3002;&#x5728;&#x4E0D;&#x5229;&#x573A;&#x666F;&#x4E0B;&#x591A;&#x7ED9;&#x81EA;&#x5DF1;&#x5FC3;&#x7406;&#x6697;&#x793A;&#xFF0C;&#x63A7;&#x5236;&#x60C5;&#x7EEA;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x6536;&#x83B7;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x4E2A;&#x9762;&#x8BD5;&#x5B98;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#xFF0C;&#x5C31;&#x7B97;&#x5931;&#x8D25;&#x4E86;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x6C9F;&#x901A;&#x65B9;&#x9762;&#xFF0C;&#x51E0;&#x70B9;&#x5EFA;&#x8BAE;</p>
<p>a &#x63D0;&#x524D;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x6709;&#x7279;&#x8272;&#x7684;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#xFF0C;&#x4E3B;&#x8981;&#x63CF;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x7279;&#x957F;&#x548C;&#x804C;&#x4E1A;&#x4F18;&#x52BF;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x804A;&#x5174;&#x8DA3;&#x7231;&#x597D;&#x3001;&#x5BB6;&#x4E61;&#x3001;&#x661F;&#x5EA7;&#x7B49;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>b &#x907F;&#x514D;&#x51B7;&#x573A;&#xFF0C;&#x5BF9;&#x4E8E;&#x56DE;&#x7B54;&#x4E0D;&#x4E0A;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3B;&#x52A8;&#x5766;&#x767D;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x89E3;&#x9898;&#x601D;&#x8DEF;&#xFF0C;&#x6216;&#x8005;&#x8BE2;&#x95EE;&#x9762;&#x8BD5;&#x5B98;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x6362;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>c &#x5F53;&#x6CA1;&#x6709;&#x542C;&#x6E05;&#xFF0C;&#x6216;&#x662F;&#x4E0D;&#x7406;&#x89E3;&#x95EE;&#x9898;&#x65F6;&#x4E0D;&#x8981;&#x5F3A;&#x884C;&#x56DE;&#x7B54;&#xFF0C;&#x53EF;&#x4EE5;&#x8DDF;&#x9762;&#x8BD5;&#x5B98;&#x518D;&#x6B21;&#x786E;&#x8BA4;&#x95EE;&#x9898;&#x3002;</p>
<p>d &#x6CE8;&#x610F;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x4F60;&#x7684;&#x9762;&#x8BD5;&#x5FAE;&#x8868;&#x60C5;&#xFF0C;&#x4E0D;&#x8981;&#x76B1;&#x7709;&#x3001;&#x63A7;&#x5236;&#x5750;&#x59FF;&#x548C;&#x624B;&#x52BF;&#x3001;&#x8BF4;&#x8BDD;&#x8BED;&#x901F;&#x4E0D;&#x8981;&#x8FC7;&#x5FEB;&#x6216;&#x8FC7;&#x6162;&#x3001;&#x8868;&#x8FBE;&#x903B;&#x8F91;&#x6E05;&#x6670;&#xFF0C;&#x89C2;&#x70B9;&#x660E;&#x786E;&#xFF1B;&#x4E0D;&#x8981;&#x968F;&#x610F;&#x6253;&#x65AD;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x8C26;&#x865A;&#x6709;&#x793C;&#x7684;&#x6001;&#x5EA6;&#x7B49;&#x3002;</p>
<p>e &#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x6280;&#x5DE7;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x89C2;&#x5BDF;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x53CD;&#x5E94;&#x3002;&#x5982;&#x679C;&#x9762;&#x8BD5;&#x5B98;&#x7A81;&#x7136;&#x5728;&#x7B80;&#x5386;&#x4E0A;&#x594B;&#x7B14;&#x75BE;&#x4E66;&#xFF0C;&#x8BF4;&#x660E;&#x4F60;&#x63D0;&#x4F9B;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x505C;&#x4E0B;&#x6765;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x4E0D;&#x5199;&#x4E86;&#xFF0C;&#x4F60;&#x8981;&#x60F3;&#x60F3;&#x662F;&#x4E0D;&#x662F;&#x8DD1;&#x9898;&#x4E86;&#xFF1B;&#x5982;&#x679C;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x8868;&#x60C5;&#x663E;&#x793A;&#x51FA;&#x4E0D;&#x8010;&#x70E6;&#xFF0C;&#x6216;&#x8005;&#x6DF1;&#x547C;&#x5438;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x6CA1;&#x6709;&#x9886;&#x4F1A;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x8003;&#x5BDF;&#x610F;&#x56FE;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x8BE2;&#x95EE;&#x3002;</p>
</li>
</ul>
<p><strong>&#x9762;&#x8BD5;&#x8003;&#x5BDF;&#x70B9;</strong></p>
<p>&#x9762;&#x8BD5;&#x7684;&#x8003;&#x5BDF;&#x70B9;&#x975E;&#x5E38;&#x7EFC;&#x5408;&#xFF0C;&#x4E00;&#x822C;&#x5206;&#x4E3A;&#x786C;&#x6280;&#x80FD;&#x548C;&#x8F6F;&#x5B9E;&#x529B;&#x3002;</p>
<ol>
<li>&#x786C;&#x6280;&#x80FD;&#x5305;&#x62EC;&#xFF1A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x638C;&#x63E1;&#x3001;&#x4EE5;&#x5F80;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x3001;&#x5BF9;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x80FD;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x4E0D;&#x540C;&#x6846;&#x67B6;&#x3001;&#x5DE5;&#x5177;&#x7684;&#x7EFC;&#x5408;&#x5E94;&#x7528;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x8F6F;&#x5B9E;&#x529B;&#x4E00;&#x822C;&#x5305;&#x62EC;&#xFF1A;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x662F;&#x5426;&#x7075;&#x6D3B;&#x3001;&#x6C9F;&#x901A;&#x3001;&#x8868;&#x8FF0;&#x3001;&#x534F;&#x4F5C;&#x80FD;&#x529B;&#x662F;&#x5426;&#x4F18;&#x79C0;&#x3001;&#x662F;&#x5426;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0E;&#x63A8;&#x8FDB;&#x80FD;&#x529B;&#x3001;&#x65B0;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#x3001;&#x603B;&#x7ED3;&#x4E0E;&#x601D;&#x8003;&#x80FD;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x57F9;&#x517B;&#x6F5C;&#x529B;&#x8FD9;&#x51E0;&#x65B9;&#x9762;&#x3002;</li>
</ol>
<p>&#x524D;&#x9762; BAT &#x7684;&#x804C;&#x7EA7;&#x56FE;&#x4E2D;&#x63D0;&#x5230;&#xFF0C;&#x4E0D;&#x540C;&#x7B49;&#x7EA7;&#x7684;&#x5C97;&#x4F4D;&#xFF0C;&#x80FD;&#x529B;&#x8981;&#x6C42;&#x80AF;&#x5B9A;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x91CC;&#x7528;&#x96F7;&#x8FBE;&#x56FE;&#x6765;&#x5C55;&#x793A;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/20210506222826.png?imageslim" alt=""></p>
<p>&#x9996;&#x5148;&#x5BF9;&#x4E8E;&#x521D;&#x3001;&#x4E2D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x8981;&#x6C42;&#x662F;&#x80FD;&#x5B8C;&#x6210;&#x5206;&#x914D;&#x7684;&#x7814;&#x53D1;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x9762;&#x8BD5;&#x5B98;&#x66F4;&#x770B;&#x91CD;<strong>&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x638C;&#x63E1;</strong>&#x3001;<strong>&#x903B;&#x8F91;&#x601D;&#x7EF4;</strong>&#x662F;&#x5426;&#x7075;&#x6D3B;&#xFF0C;&#x6709;&#x6CA1;&#x6709;<strong>&#x57F9;&#x517B;&#x6F5C;&#x529B;</strong>&#x3002;&#x5176;&#x6B21;&#x662F;<strong>&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x4E0E;&#x5B66;&#x4E60;&#x601D;&#x8003;&#x80FD;&#x529B;</strong>&#xFF0C;&#x800C;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x3001;&#x7BA1;&#x7406;&#x63A8;&#x8FDB;&#xFF0C;&#x4EE5;&#x53CA;&#x6C9F;&#x901A;&#x534F;&#x4F5C;&#x7B49;&#x80FD;&#x529B;&#xFF0C;&#x53D7;&#x9650;&#x4E8E;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4E00;&#x822C;&#x9700;&#x8981;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x6216;&#x8005;&#x5B50;&#x9879;&#x76EE;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x9664;&#x4E86;&#x521D;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x7684;&#x80FD;&#x529B;&#x5916;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x3001;&#x6C9F;&#x901A;&#x534F;&#x4F5C;&#x3001;&#x67B6;&#x6784;&#x80FD;&#x529B;&#x3001;&#x5B66;&#x4E60;&#x601D;&#x8003;&#x3001;&#x7BA1;&#x7406;&#x63A8;&#x8FDB;&#x90FD;&#x6709;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x7279;&#x522B;&#x662F;<strong>&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x548C;&#x5B66;&#x4E60;&#x601D;&#x8003;&#x80FD;&#x529B;</strong>&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x6765;&#x8BF4;&#xFF0C;&#x8981;&#x5177;&#x5907;<strong>&#x9879;&#x76EE;&#x67B6;&#x6784;&#x3001;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x3001;&#x7BA1;&#x7406;&#x63A8;&#x8FDB;&#x4E0E;&#x6C9F;&#x901A;&#x534F;&#x4F5C;&#x80FD;&#x529B;</strong>&#xFF0C;&#x80FD;&#x591F;&#x72EC;&#x7ACB;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x505A;&#x597D;&#x9879;&#x76EE;&#x67B6;&#x6784;&#xFF0C;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x7684;&#x62C6;&#x89E3;&#x4E0E;&#x4EFB;&#x52A1;&#x5206;&#x914D;&#xFF0C;&#x63A8;&#x8FDB;&#x56E2;&#x961F;&#x5185;&#x3001;&#x5916;&#x90E8;&#x7684;&#x4E8B;&#x52A1;&#x3001;&#x534F;&#x8C03;&#x8D44;&#x6E90;&#xFF0C;&#x7BA1;&#x7406;&#x8FDB;&#x5EA6;&#xFF0C;&#x5E26;&#x9886;&#x6280;&#x672F;&#x56E2;&#x961F;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x6E29;&#x99A8;&#x63D0;&#x793A;&#xFF0C;<strong>&#x8F6F;&#x5B9E;&#x529B;</strong>&#x529F;&#x592B;&#x505A;&#x7684;&#x597D;&#xFF0C;&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x6765;&#x8BF4;&#x7EDD;&#x5BF9;&#x662F;<strong>&#x52A0;&#x5206;&#x9879;</strong>&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x786C;&#x6280;&#x80FD;&#x8003;&#x5BDF;&#x70B9;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4EFD;&#x7CFB;&#x7EDF;&#x5316;&#x68B3;&#x7406;&#xFF0C;&#x4E5F;&#x662F;&#x63A5;&#x4E0B;&#x6765;&#x91CD;&#x70B9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="https://img.jinguo.tech/blog/CgoB5l12QGeAX1jpAADXc8NHFMU588.jpg?imageslim" alt="&#x786C;&#x6280;&#x80FD;&#x7CFB;&#x8C31;&#x56FE;"></p>
<ol>
<li>&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5206;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x4E0E; Java &#x4F53;&#x7CFB;&#x4E24;&#x5927;&#x90E8;&#x5206;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x8FDB;&#x7A0B;&#x3001;&#x7EBF;&#x7A0B;&#x7BA1;&#x7406;&#xFF1B;TCP&#x3001;HTTP &#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF1B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x7ECF;&#x5178;&#x7B97;&#x6CD5;&#xFF1B;&#x5E38;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7B49;&#x3002;&#x9762;&#x8BD5;&#x52A0;&#x5206;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x65B0;&#x6280;&#x672F;&#x65B9;&#x9762;&#xFF1A;Java 8~11 &#x65B0;&#x7279;&#x6027;&#xFF0C;G1&#x3001;ZGC &#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x3001;&#x6700;&#x65B0;&#x7F51;&#x7EDC;&#x534F;&#x8BAE; HTTP2&#x3001;QUIC&#xFF1B;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x65B9;&#x9762;&#xFF1A;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x3001;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#xFF0C;JIT &#x7F16;&#x8BD1;&#x5668;&#x3001;&#x9003;&#x9038;&#x5206;&#x6790;&#x7B49;&#x3002;</li>
<li>&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x90E8;&#x5206;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x5C55;&#x73B0;&#x81EA;&#x8EAB;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x5305;&#x62EC;&#x9879;&#x76EE;&#x7684;&#x63CF;&#x8FF0;&#x3001;&#x6D41;&#x7A0B;&#x56FE;&#x3001;&#x9879;&#x76EE;&#x96BE;&#x70B9;&#x3001;&#x9879;&#x76EE;&#x95EE;&#x9898;&#x5206;&#x6790;&#x4E0E;&#x6539;&#x8FDB;&#x7B49;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x77E5;&#x8BC6;&#x90E8;&#x5206;&#x517C;&#x987E;&#x77E5;&#x8BC6;&#x7684;&#x5E7F;&#x5EA6;&#x4E0E;&#x91CD;&#x70B9;&#x6846;&#x67B6;&#x7684;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x3002;&#x5305;&#x62EC;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#x3001;&#x5E38;&#x7528;&#x6846;&#x67B6;&#x3001;&#x7F13;&#x5B58;&#x3001;&#x961F;&#x5217;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x7B49;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x3002;&#x5176;&#x4E2D;&#x5DE5;&#x5177;&#x96C6;&#x4EE5;&#x77E5;&#x8BC6;&#x5E7F;&#x5EA6;&#x4E0E;&#x5B9E;&#x7528;&#x6027;&#x4E3A;&#x4E3B;&#xFF0C; &#x4F8B;&#x5982; JVM &#x5DE5;&#x5177; JFR&#x3001;tcpdump&#x3001;Git&#x3001;vmstat&#x3001;iostat &#x7B49;&#xFF1B;&#x5E94;&#x7528;&#x6846;&#x67B6;&#x4EE5;&#x7ECF;&#x5178;&#x67B6;&#x6784;&#x7684;&#x5E38;&#x8003;&#x70B9;&#x4E3A;&#x4E3B;&#xFF0C;&#x5305;&#x62EC; Spring&#x3001;Netty &#x7B49;&#x4E3B;&#x6D41;&#x6846;&#x67B6;&#x7684;&#x91CD;&#x70B9;&#x77E5;&#x8BC6;&#x3002;&#x7F13;&#x5B58;&#x3001;&#x961F;&#x5217;&#x3001;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x4EE5;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E3A;&#x4E3B;&#x3002;</li>
<li>&#x67B6;&#x6784;&#x80FD;&#x529B;&#x4EE5;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4ECB;&#x7ECD;&#x4E3A;&#x4E3B;&#xFF0C;&#x8BB2;&#x89E3;&#x67B6;&#x6784;&#x7406;&#x5FF5;&#x4E0E;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x91CD;&#x70B9;&#x673A;&#x5236;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x4F8B;&#x5982; Docker&#x3001;K8s &#x548C; Spring Cloud &#x7B49;&#x3002;</li>
</ol>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="开篇：建立年薪50万的能力框架.html" class="navigation navigation-prev " aria-label="Previous page: 开篇：建立年薪50万的能力框架">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第二节：操作系统与计算机网络.html" class="navigation navigation-next " aria-label="Next page: 第二节：操作系统与计算机网络">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一节：技术人职业发展路径","level":"1.3.2","depth":2,"next":{"title":"第二节：操作系统与计算机网络","level":"1.3.3","depth":2,"path":"32个Java面试必考点/第二节：操作系统与计算机网络.md","ref":"32个Java面试必考点/第二节：操作系统与计算机网络.md","articles":[]},"previous":{"title":"开篇：建立年薪50万的能力框架","level":"1.3.1","depth":2,"path":"32个Java面试必考点/开篇：建立年薪50万的能力框架.md","ref":"32个Java面试必考点/开篇：建立年薪50万的能力框架.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"32个Java面试必考点/第一节：技术人职业发展路径.md","mtime":"2021-05-06T15:14:08.843Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-06T16:41:40.537Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

